[
    {
        "text": [], 
        "dish_name": "Buffalo Chicken Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Chicken Garden Salad"
    }, 
    {
        "text": [
            "for a place that's supposedly known for wings, it wasn't so good. i was very hungry but couldn't finish the 20 wings i was sharing with my friend. the 10 grilled wings were tossed in this super spicy tangy cajun sauce. eeee. should've had the sauce on the side. the other 10 wings had sauce on the side but the batter was chalky tasting. eeee.\n\nthe shrimp and <mark>Shrimp & Spinach Salad</mark> was good. tsk. was so craving good wings though."
        ], 
        "dish_name": "Shrimp & Spinach Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Chicken Caesar Salad"
    }, 
    {
        "text": [
            "the food was ok. service ok. i was hoping to see hot girls. the inly cute one was dominique. the caribean wings were so good and i always love their <mark>Chopped Cobb Salad</mark>. we ordered a bucket of bear and one disnt have a lime in it. i just checked the reviews and photos for the hotel saty and it looks like the most dissgusting place in vegas."
        ], 
        "dish_name": "Chopped Cobb Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Hooters Chili"
    }, 
    {
        "text": [
            "it was good... nothing over the top special.  and, nothing really to complain about either ;)  i'd give another .5 star if i could... but as we all know, i \"can't\" so a 3 star it is! ;)\n\ni had the <mark>New England Style Clam Chowder</mark> soup which was really good!  and, a <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark>, which was good/average.  the fries and wings were also good/average.  \n\ni think it must have been mating season a few months back, because a couple of the \"hooters\" had an \"owlet\" on board! ;)  was kinda funny considering the \"boobie\" concept at \"hooters\" - it must kinda change the way the guys are thinking with those particular hooters ;)  lol\n\noverall everything was good, service was friendly (our hooter girl was one of the ones with an owlet :)"
        ], 
        "dish_name": "New England Style Clam Chowder"
    }, 
    {
        "text": [], 
        "dish_name": "Buffalo Platter"
    }, 
    {
        "text": [], 
        "dish_name": "Chicken Quesadilla"
    }, 
    {
        "text": [], 
        "dish_name": "Lots-a-Tots"
    }, 
    {
        "text": [], 
        "dish_name": "Buffalo Chicken Dip"
    }, 
    {
        "text": [], 
        "dish_name": "Tex Mex Nachos"
    }, 
    {
        "text": [
            "let's just keep in mind that hooter's has to hire all types of body types to appeal to all types of guys. when i was there, i hadn't seen any girl that wasn't in shape. our waitress was very nice, and quick with the refills, which is a big deal to me. i got their spicy <mark>Chicken Breast Strips</mark>, i thought they were pretty good. i got hot, and they could have been hotter but i enjoyed them. the prices are very decent. i will go here again.", 
            "this review is about the restaurant. i wish i could give it no stars! waited in line for 30 minutes with tons of tables open but supposably part of the restaurant was closed! closed? this is vegas and hooters, weird! we were starving and decided to wait in anticipation of good food.  once  we were seated no one even came to talk to us, even to bring us water. people were seated behind us 15 minutes after we were seated and there order was taken right away, we still had not even been acknowledged! my husband had to go ask someone to get us water! the waitress came, i don't believe she was he one who was supposed to wait on us however, but did take our drink and food order. the food came and the fries were cold and the <mark>Chicken Breast Strips</mark> were cold as well, not to mention they looked dried up and crusty. had to go ask for silverware, at that moment my husband took the opportunity to tell someone up at the counter about all the issues. i do also need to mention that i have never left a review and usually am not the type to send my food back even if they get my order wrong. another man came to our table to talk to us after my husband spoke to the other gentleman, he seemed a little irritated but did offer to bring new chicken and fries and he did brought back hot chicken (still no taste) and 3 huge things of fries, way over compensating,  we couldn't even dent them.. he also told us he would give us a discount, when he bill came it was much lower until they took the credit card to run it, when she brought the receipt back to sign it was for the full amount!!! we were too tired to care.. 2 in the morning, last night in vegas, done! don't waste your time, horrible food, beyond horrible service. i still cannot believe how horrible he service was. we did not leave a tip, i've only done that one other time in my life..", 
            "i wish i could give it no stars! waited in line for 30 minutes with tons of tables open but supposably part of the restaurant was closed! closed? this is vegas and hooters, weird! we were starving and decided to wait in anticipation of good food.  once we were seated no one even came to talk to us, even to bring us water. people were seated behind us 15 minutes after we were seated and there order was taken right away! my husband had to go ask someone to get us water! the waitress came, i don't believe she was he one who was supposed to wait on us however, but did take our drink and food order. the food came and the fries were cold and the <mark>Chicken Breast Strips</mark> were cold as well, not to mention they looked dried up and crusty. had to go ask for silverware, at that moment my husband took the opportunity to tell someone up at the counter about all the issues. i do also need to mention that i have never left a review and usually am not the type to send my food back if they get my order wrong. another man came to our table to talk to us after my husband spoke to the other gentleman, he seemed a little irritated but did offer to bring new chicken and fries and he did brought back hot chicken (still no taste) and 3 huge things of fries, way over compensating,  we couldn't even dent them.. he also told us he would give us a discount, when he bill came it was much lower until they took the credit card to run it, when she brought the receipt back to sign it was for the full amount!!! we were too tired to care.. 2 in the morning, lady night in vegas, done! don't waste your time, horrible food, beyond horrible service. i still cannot believe how horrible he service was. we did not leave a tip, i've only done that one other time in my life.."
        ], 
        "dish_name": "Chicken Breast Strips"
    }, 
    {
        "text": [], 
        "dish_name": "Steak Quesadilla"
    }, 
    {
        "text": [], 
        "dish_name": "Sliders (Burger or Buffalo Chicken)"
    }, 
    {
        "text": [], 
        "dish_name": "Flapper or Boneless Teaser"
    }, 
    {
        "text": [], 
        "dish_name": "Cheese Quesadilla"
    }, 
    {
        "text": [
            "ick! what was i thinking ordering a salad at a hooters? <mark>Fried Pickles</mark> were decent...\n\ngirls are cuter in the midwest hooters, seriously..i was sort of surprised! blonde hostess was rude and was probably just angry because she has to wear the silly outfit and was surrounded by a billion rugby players. sorry, get over it.\n\nheard the rooms were hideous. pool looked okay at night.\n\nlost $40 on roulette but it was a fun table and great dealers!", 
            "this review is for the restraunt only!! my best friend was dying for hooters chicken...so we came here to get her fix. it wasnt too busy but seemed like our wait was longer then it should have been. anyway typical hooters menu...i got my usual <mark>Fried Pickles</mark>!! they were good as usual!! nothing to exciting or special here...and fyi the hooters girls werent as hooteriffic as i thought they would be...i mean you would think its vegas!! anyway that was my hooters experience in vegas!!", 
            "<mark>Fried Pickles</mark> are too salty, <mark>Cole Slaw</mark> is blah, and the bun on the <mark>Buffalo Chicken</mark> sandwich is useless. go to a hooters closer to home...it will be much better than this. here, it's shuffle you in and get you out quick.", 
            "i asked the girl at the bar if they had <mark>Fried Pickles</mark>, she said no it's a seasonal item (not really seasonal - she said they only have it at some stores).. so i was okay with that. then when she was handing me my bag i look at one of those little signs on the bar that has the promotions, there you go.. <mark>Fried Pickles</mark>. wtf. i already waited to long to get my food, i didn't even bother ordering the <mark>Fried Pickles</mark>. boo.\n\ni still love their chicken wings. love them.", 
            "food - okay\nservice - awful!!\nprice - overpriced!!!\n\nwe ordered boneless chicken wings and <mark>Fried Pickles</mark>. not enough breading on the pickles, but the food was fine. \n\nthe waitress did have large \"hooters\" and wore her shirt as tight as possible. that's pretty much where her assets end. she had no personality and even less knowledge on providing service. \n\nthe 10 ounce beers on draft were served in a plastic cup for a mere $4.50 each. the 10 ounce margaritas were also served in a plastic cup and you could have as many as you want for $7.50 each. really? i know it's vegas and there are no deals anymore, but those prices are really outrageous. there are better margaritas (16 ounces) at jimmy buffett's margaritaville for $7.00", 
            "its hooters the staff was very friendly and the food was awesome. i tried the deep <mark>Fried Pickles</mark> i dont like pickles very much but thys were very good", 
            "stopped in at hooters for wings and drinks, was pretty satisfied.\n\nthe service was good, loved the <mark>Fried Pickles</mark>, and the wings were delicious. they also have some great drink specials.\n\ndef someplace worth checking out for a bite to eat.", 
            "do you need anything else if you have beer, wings, and tittays??\n\nthere is only one right answer to this question, and the answer is...no.\nunless your answer was: more beer, more wings and more tittays. that answer gets you bonus points. \n\nthis review is for the hooters restaurant and casino. i did not stay in a room. nor would i, because the wood paneling and the bright orange was just too much! i imagine this elegant motif carries itself through to the rooms. much much too demure a place for me to handle staying there. \n\nhooters remains true to their motto. they stay tacky. and they own it, which is why i actually like it. the waitresses still walk around with their logo tank tops, nylon covered ass cheeks, la gear tennis shoes and tube socks. it comforts me to know that i experience hooters the same way patrons did when the place first opened.\n\ni like their wings and <mark>Fried Pickles</mark>, although i will admit, the food here, no matter the location, is always mediocre. hooters keeps thier expectations low so you don't have to. just kidding, you do. i do love the cheap beer and smorgasbord of different shapes and sizes of boobies on their best push up game. never change hooters. i know you won't.", 
            "spent 5 hours at the pool with friends. 3pm till 8:pm. i  was not impressed. it was dirty and unkept. trash blowing all over cups and garbage in the pool. towels on chairs all over with no people using them. the outside pool bar closed at 7:. food was ok winged were meh, <mark>Fried Pickles</mark> had little flavor (but moist), curley fries were soggy. drinks weren't bad, $10 for red bull vodka isn't horrible.", 
            "honestly, you get what you pay for, so it cracks me up when i see 1 star reviews for staying here. \ni stayed here back in october 2014 for frozen fury to see the la kings play at mgm grand garden arena. because of the weekend the rates jumped up to $92 (with taxes and resort fee through travelocity) a night. it was the best deal out there!! we stayed one night, and i was pretty pleased with the hotel. the checkin staff were very friendly. checkin is 4pm, but our room was ready a hour before, so it's good to ask!!! the girl was very quick with checking us in, and by 3:15 we were in our room. the room itself is somewhat outdated, but it's hooters and the theme is wooden florida atmosphere. we had a nonsmoking double beds, which was perfect. the room itself was pretty clean, so i never saw any stains or anything. their casino is small but it's nice cause it's quick to find where you need to go! the casino staff were very friendly as well. we ate at hooters for lunch and also for breakfast the next morning! sign up for the play club, because you get free play (i didn't win though, i suck at gambling) and $5 off a meal! lunch was fine and pretty quick! i had a buy one get one wings, and basically it tasted like <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>! the <mark>Fried Pickles</mark> were the best i've had at any hooters. breakfast was really good surprisingly as well! i had a bloody mary with mine! the convenience store is open 24/7, so you can get your krispy kremes and beer when you need it. prices aren't bad at hooters and the store.\nlocation is great because you are across the street from the mgm entrance. we spent a lot of time in mgm honestly. fat tuesdays is there also, along with 2 monorail entrances. also very close to luxor and excalibur. \ni am returning in mid march for spring break and i am staying at hooters once again! i scored an awesome 2 night deal through travelocity for $85! we will be spending time at hakkasan and some other places! it's just a room honestly, and how often are you in it?", 
            "honestly, you get what you pay for, so it cracks me up when i see 1 star reviews for staying here. \ni stayed here back in october 2014 for frozen fury to see the la kings play at mgm grand garden arena. because of the weekend the rates jumped up to $92 (with taxes and resort fee through travelocity) a night. it was the best deal out there!! we stayed one night, and i was pretty please with the hotel. the checkin staff were very friendly. checkin is 4pm, but our room was ready a hour before, so it's good to ask!!! the girl was very quick with checking us in, and by 3:15 we were in our room. the room itself is somewhat outdated, but it's hooters and the theme is wooden florida atmosphere. we had a nonsmoking double beds, which was perfect. the room itself was pretty clean, so i never saw any stains or anything. their casino is small but it's nice cause it's quick to find where you need to go! the casino staff were very friendly as well. we ate at hooters for lunch and also for breakfast the next morning! sign up for the play club, because you get free play (i didn't win though, i suck at gambling) and $5 off a meal! lunch was fine and pretty quick! i had a buy one get one wings, and basically it tasted like <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>! the <mark>Fried Pickles</mark> were the best i've had at any hooters. breakfast was really good surprisingly as well! i had a bloody mary with mine! the convenience store is open 24/7, so you can get your krispy kremes and beer when you need it. prices aren't bad at hooters and the store. the hooters girls are pretty friendly, except there was one who had a terrible attitude who worked in their hooters merch store. you could tell she hated her job. other than that though it was fine.\nlocation is great because you are across the street from the mgm entrance. we spent a lot of time in mgm honestly. fat tuesdays is there also, along with 2 monorail entrances. also very close to luxor and excalibur. \ni am returning in mid march for spring break and i am staying at hooters once again! i scored an awesome 2 night deal through travelocity for $85! we will be spending time at hakkasan and some other places! it's just a room honestly, and how often are you in it? it's cheap but saved you money for drinks and going out!", 
            "they did good at first. got our chicken wings, basket of fries, & our drinks right away. the food & drinks hit the spot! after that we asked for an order of <mark>Fried Pickles</mark> since i really wanted to try them but did i pay a price, it took more than 30mins to get. the server did great though checking in with us... but really wished those <mark>Fried Pickles</mark> hadn't taken so long"
        ], 
        "dish_name": "Fried Pickles"
    }, 
    {
        "text": [
            "i was really craving fried chicken. because i frequent all the hooters restaurants in los angeles and am never disappointed, stopping by this hooters was no-brainer!\n\nwe were a group of 3 girls and when we walked in the hostess scantily greeted us. then she kept us standing at the podium for one minute while we watched her have a personal conversation with her coworker right in front of us!! it was unreal. she then proceeded to take the menus and drop them on our table....she didnt tell us to have a good meal and she didnt even wait for us to sit down. (i watched her do this to everyone else)\n\nonce our server came, she was like a breath  of fresh air. unfortunately i forgot her name but she was very quick and attentive. she did whatever it took to make and keep us happy. my friends enjoyed their food but my chicken was a little too greasy for my liking. i also ordered the <mark>Buffalo Shrimp</mark> and there was nothing buffalo about them! they were dry and gross! \n\nthis location is pretty big but there were no booths in sight. we had to sit on barstools that did not support our backs..very painful! the location was not as clean as i would have liked it to be and there seemed to be no manager on site....overall this was a bad experience and i will never visit this location again.", 
            "<mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> is in my top 5 favorite things to eat, so of course i spent the very first hours of 2014 here. the line was long, but we got seated within 10 minutes. the server was sweet and the food came out quickly.  got my faves the classic buffalo wings, <mark>Boneless Wings</mark>, and <mark>Buffalo Shrimp</mark>, it tasted like hooters. nothing really to complain about :) if you don't like salty food, don't get the parmesan garlic cause that shit is salty.", 
            "hooters hotel and casino is our choice to stay in las vegas. there are so many options in this city to choose from, but the personal service is what brings us back every time. the staff here always take the time to personally help us feel welcome while remembering us as much as we do them. we always look forward to the familiarity and relief that when we come here, it will always be enjoyable and safe. there is satisfaction in knowing that if there is any concern during our stay, the hooters staff make it priority to fix it, and genuinely, want to ensure our time spent as their guest is positive. \n\nfrom the valet team that takes our bags and chats with us about our drive in, wishing us as good of luck and stay as the last, to the front desk welcome team, that before even giving our name remembers us just from a smile. a special thank you to sweet brandy, who made this possible on this trip, to\nawesome h who, recognizes us and always comes out to welcome us back and ensure we're having the best time possible. we always feel confident the girls  and guys at the front reception or should i say, \"welcome\"reception, will make a point to do their best in any resolving situation. \n\nit doesn't just stop here, everyone to the bar staff, hooters restaurant, gift shop, housekeeping and pool staff to the wonderful, fun loving personable casino table dealers like our dear helen, and sassy flora, our spunky mary, sincere aster, honest jamie, confident michaela to the pit crew lavita, mr. foxx, joe and so many more!! bri at the hooters gift shop was exceptionally helpful and delighted to hear our stay(s) have been fun, positive, and good as she wishes us a safe trip back and \"looks forward to seeing and helping us, when we return\" - already knowing we would! of coarse! \n\nif you're hungry, for breakfast, lunch or dinner, try the  french toast, <mark>Buffalo Shrimp</mark> cesar salad or honey chipotle naked wings, for room service or to hanging out and eat! \n\nat hooters, providing good service in a relaxed, friendly, fun-living atmosphere is the motivator and a positive experience as their guest has always followed as a result. \n\ni recommend kindness, generosity, positive energy when you come to play and stay at hooters, and expect to have fun! win or loose, but mostly a win for us and hooters, we will be back soon and have already planned a few returns this year! \n\ncheck out the hooters website to to view pictures and more info, but visiting it yourself will be the best way to cure your curiosity...\n\nlindsey and jenny!"
        ], 
        "dish_name": "Buffalo Shrimp"
    }, 
    {
        "text": [], 
        "dish_name": "Original Hooters Style Wings"
    }, 
    {
        "text": [
            "don't bother going to this hooters for the food. only go if you are going for the whole \"delightfully tacky\" theme and even then the dealers in the casino are way better looking then the servers. so  i guess save your money for gambling and wait until midnight to eat 25 cent <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> at dan marino's.", 
            "i can't imagine what the creators of this hotel were thinking.. in a world of pure elevated decadence and wonderful visual appeal, they decided to take the theme of a tacky restaurant and convert it into a hotel.. now it's vegas, you can do anything in vegas and make it work..i mean the idea of  creating a hotel from a restaurant focusing on, tatas, isn't far fetched, but they even took the grimy, low quality environment of their typical stores, and transferred that feeling onto the hotel as well.  this hotel has the look and feel of old school, neglected vegas hotels... and this is new.. it looks like those $3 crap, $2 bud light sections between ballys and the flamingo.. and this is a new hotel?\n\nthe food's terrible.  hooters is known for their wings so you'd figured one of the perks of having a hooters hotel is having those wings around, but no, we ordered wings here and they only offered the hooters hot sauce, but not the <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>.. um, ok.  \n\ni walked by the casino where they were giving a car off as a prize.. the car looked like it's been waiting there for decades.. color faded, old fart car.... wow.", 
            "i am now a fan of this place.  when i first stepped foot in this casino and wan not impressed and thought it was kind of ghetto, but after staying here for the weekend, this place really grew on me.  i like the fact the casino floor is smaller than the others on the strip.  that allows for a more intimate gaming experience.  i have always been a fan of the <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> and like the close proximity to the restaurant when a wing craving hits.\n\nthe room quality is not the greatest, but the quality fits the price.  i rather save a few dollars on a room that i will hardly stay in while i am in vegas.", 
            "let me start this off by saying a pregnant girl working at hooters is kind of weird. well at least that's what my group of friends decided.\n\nwe only came here because we have never been and we both love buffalo wings. we stood in line and waited a good 20 mins to be seated. we immediately ordered our wings and ice tea, the tea arrived quickly, the wings however did not. i started to wonder if they were chasing the little chicks around demanding their wings in the fryer. i knew this wasn't the case because it was an open kitchen. they were just slow, and slow might even be an understatement. \n\nwings came out a good 35 to 40 mins later, cold of course. nothing special about <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>.  the sauce sucked, no kick at all. it really could have used some butter. the blue cheese dipping sauce came out of a peel away packet. the color was off...not sure what was going on there. \n\ni will never return.", 
            "okay the hooters restaraunt inside the hooters hotel you think would be at least decent. noot the wings were not crispy and average old <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>. i will say that the steamed oysters were good.\nservice average, i was only and the guy thought it was weird i didn't want to eat at the bar.\ni couldn't give it a 1-star because the steamed oyseters were good.", 
            "customer service was good; however, if your from san diego or from an area where they serve <mark>Hooters Daytona Beach Style Wings</mark> forget about it, cause your not getting it from this location.", 
            "review for $.25 wing deal only. terrible!! these wings were not the same <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> you get at a hooters restaurant. don't be fooled. you must order in multiples of 10 and order a soda or budlight beer which is $1.50. i ordered 10 medium wings. they tasted stale and there was absolutely no flavor. if you want some flavor order the hot, which were more like a mild. ranch or blue cheese on the side was $1 extra. totally not worth the 30 minute wait or the horrible/slow service. if these were the same delish <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> that you get at the actual hooters restaurant, then i would say it's an amazing deal but in this case you get what you pay for.", 
            "wow, i seriously cannot figure out what everyone is complaining about. i honestly think people need to take into consideration that at hooters you get what you pay for. if you are paying $20 for a hotel room in vegas do not expect to get a 5 star, luxury \"wynn\" experience. \n\nwhat we got for our $20 per night was the following:\n\n1 clean, very basic hotel room.\n20 free wings at the hooters restaurant inside the hotel.\n2 free frozen drinks at the pool bar, plus one additional drink because it was \"ladies week\"\n2 free \"american\" breakfasts at the mad onion.\n\nin addition to all the freebies, we received excellent customer service from everyone we interacted with at hooters. all the hotel bars have $1.50 bud/bud light if you are looking for cheap beer. room service will deliver <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> to your room. the pool is open 24/7. there is a pretty decent fitness room/gym. if you are so inclined, there is a tattoo parlor in the hotel. the location is good...it is a very short walk to the las vegas strip from the hotel.\n\nyes, the service at the hooters restaurant inside the hotel is slow.\nyes, the parking garage and elevators are a little dingy.\nno, it did not smell like poo, urine, sewage, raid, or anything else that people have complained about. \n\ntwo items of note:\nthere is an $8 resort fee per day.\nthere were many people on our floor who sat outside of their rooms, in the hallway, and smoked. so fyi, your room may be non-smoking but the hallway is not. \n\nif you are just looking for a cheap, clean, no-frills place to crash, hooters will serve the purpose. if you are looking for anything more than that, this is not the place for you. move along...nothing to see here.", 
            "staying at hooters on the winter offer in dec 2011 was a great decision. i received $200 free promo play, 2 free steak dinners including steaks/unlimited texas toast/fries or mashed or baked potato, $10 bonus slot play, $10 table matchplay, a free mug, and a free tote bag all along with a $19.95 room rate (also a $9.95 per night resort fee charge and $25 security hold per night).\n\nwhat made the deal even more spectacular were the rooms. comfy beds, well-appointed, nice tropical decor with a cute faux plant, 2 complimentary waters every day, several outlets (often hard to find even in high end hotels i have gone to but they had outlets right on the desk top), wifi, brilliant bathroom, relatively clean and just plain comfortable. was not a big fan of the woody-plank-looking things throughout the property but it could be tolerated with all the other niceties.\n\nwhat made the deal even better was the pool. it's a very nice pool at that rate. it has a pool bar (which i was not opportune to use in dec weather), a nice hot spa jacuzzi, 3 pools (though they were too cold in dec), a waterfall, tropical landscaping, a little sandy area, hot beds, fire beds, comfy day bed lounge chairs, a nice sitting/laying area in the pool....quite a bit of features for a 24/7 year-round pool (not sure any other hotel has their pools open at all hours)!\n\nwhat made the deal even sweeter was the casino. yes, it's tiny but the slots were doing well for me, not super harsh. i had some fun at the craps table too. it's also nice to have $2.50 roulette (50 cent chips) and $3 bj right under your nose. also, i hit several small wins (like free wings and free shows and even a $50 bonus slot play) on the promo slots with my $200 free slot play but i kept playing through the wins trying to get a promo jackpot (of $1000 cash) reaching up to about $20,000 in free promo slot play...before losing it all. i got 3 hours on that slot...certainly wished the promo play counted for comps!\n\nwhat made the deal even more intriguing was the facilities. the gift shop has my favorite tollhouse cookie ice cream sandwich! the steakhouse (formerly known as mad onion) has a wonderful and comfortable decor and open all night long. food here was ok with me. did not get a chance to go to hooters but had the 25cent <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> at the bar and it was so nasty (tried them again in new jersey and they still were gross). taxis were always available outside. at least they have shows (which not all off-strip hotels do)! internet kiosks abound. an arcade (though limited hours). and nearby trop and mgm are also nice, fun (more refined) casinos. i also like taking the 201 bus from in front of the hotel down to tropicana cinemas on trop ave for $1.50 second-run movies. \n\ngranted, the bright oranges and wood plank thingies everywhere can be a tad overboard. and people might find hooters *not* as grandiose and impressive as other strip casinos but it's fully comfortable and decent. all in all, however, hooters is a hotel and casino with a very nice and fun vibe with great value especially with a good offer.", 
            "i have always been a fan of the <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> . but on this perticular day i was in a bad mood ( hubby and i did not sleep well) my first impression of our waitress nicole was uh oh but she turned out to be sooo awsome she got our food to us fast and when i was unhappy with my drink (it was way to spicey) she tried to get me an extra shot of vodka to lighten it up for me. ( her manager who i don't think as highly of said no) she brightend up to very grumpy people. thanks again nicole.", 
            "flew in for work... first night i had to switch room 3 times.  no ac, then no tv, then no internet.  next day, ac broke again, then internet.  ordered room service... wings were horrible and back home, i love <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> but these were tiny, oily and cold.  that night, my bed frame broke.  now i'm in my 4th room and the ac is super loud and noisy.  the tv goes in and out and there is no wifi... only a hard line with a broken connector.  seriously... ?!   $30 is cheap but i'd have rather spent a little more $ and gotten a much nicer place.  the one good thing... the staff were very nice and did the best they could.  the food is almost inedible so i can't vouch for the restaurant staff but everyone else did the best they could to help.  no hotel should have this many problems.  i feel sorry for them.  but... it's not worth it.  go somewhere else.  trust me.", 
            "this is a review for the restaurant inside of the casino. \n\ni've always been a fan of <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> and <mark>Curly Fries</mark>. so, after seeing a show we stopped here to eat. my husband and i both got wings. they were cold. cold enough that they could have been cooked and put in the fridge. \n\nthis is the only hooters that hasn't been spot on with the wings. \n\nservice wasn't great either. we got our food and no one came to check on us for 20 minutes and i clearly wasn't eating my food. \n\nat least the <mark>Curly Fries</mark> were good, and warm. \n\noverall cold food and bad service, and they weren't even busy!", 
            "<mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> is in my top 5 favorite things to eat, so of course i spent the very first hours of 2014 here. the line was long, but we got seated within 10 minutes. the server was sweet and the food came out quickly.  got my faves the classic buffalo wings, <mark>Boneless Wings</mark>, and <mark>Buffalo Shrimp</mark>, it tasted like hooters. nothing really to complain about :) if you don't like salty food, don't get the parmesan garlic cause that shit is salty.", 
            "disappointed with the casino and restaurant inside.\n\ni am a hooters lover. everywhere i go, i want <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>...this place served some awful wings. greasy and chicken not cooked enough. i'd give them a pass but my friend also returned his wings.\n\ncasino is small and restaurant has an awkward layout.\n\nwe sat at bar and were served. bar was disgusting. waitresses wanted no business working...typical young girls with nothing better to do. food took 20 mins to come out.\n\nreally let down with the whole experience. next time in vegas is give it another shot but would be very hesitant.", 
            "doesn't even taste like <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>! the ranch that came with wings was pre packaged. what happen to home made ranch? fry's were good though, guess those aren't difficult to make.", 
            "we went to a great hypnosis show but were unimpressed with the casino and restaurant.  we had <mark>Boneless Wings</mark> in the hooters restaurant and they were by far the worst <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> we have ever had.  we have had better food in other states so we were disappointed unexpectedly.  they were gooey and soft and soggy.  very unappealing.\nthe $3 blackjack they advertise so much was just one table out of 6. it was full the whole time we were there so we did not play blackjack.\nit was also very cold inside and i was wearing a short sleeved shirt and capri pants and i almost had to leave because i was so cold.  it was 90 degrees outside guys, so your guests are dressed for warm weather!", 
            "honestly, you get what you pay for, so it cracks me up when i see 1 star reviews for staying here. \ni stayed here back in october 2014 for frozen fury to see the la kings play at mgm grand garden arena. because of the weekend the rates jumped up to $92 (with taxes and resort fee through travelocity) a night. it was the best deal out there!! we stayed one night, and i was pretty pleased with the hotel. the checkin staff were very friendly. checkin is 4pm, but our room was ready a hour before, so it's good to ask!!! the girl was very quick with checking us in, and by 3:15 we were in our room. the room itself is somewhat outdated, but it's hooters and the theme is wooden florida atmosphere. we had a nonsmoking double beds, which was perfect. the room itself was pretty clean, so i never saw any stains or anything. their casino is small but it's nice cause it's quick to find where you need to go! the casino staff were very friendly as well. we ate at hooters for lunch and also for breakfast the next morning! sign up for the play club, because you get free play (i didn't win though, i suck at gambling) and $5 off a meal! lunch was fine and pretty quick! i had a buy one get one wings, and basically it tasted like <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>! the <mark>Fried Pickles</mark> were the best i've had at any hooters. breakfast was really good surprisingly as well! i had a bloody mary with mine! the convenience store is open 24/7, so you can get your krispy kremes and beer when you need it. prices aren't bad at hooters and the store.\nlocation is great because you are across the street from the mgm entrance. we spent a lot of time in mgm honestly. fat tuesdays is there also, along with 2 monorail entrances. also very close to luxor and excalibur. \ni am returning in mid march for spring break and i am staying at hooters once again! i scored an awesome 2 night deal through travelocity for $85! we will be spending time at hakkasan and some other places! it's just a room honestly, and how often are you in it?", 
            "honestly, you get what you pay for, so it cracks me up when i see 1 star reviews for staying here. \ni stayed here back in october 2014 for frozen fury to see the la kings play at mgm grand garden arena. because of the weekend the rates jumped up to $92 (with taxes and resort fee through travelocity) a night. it was the best deal out there!! we stayed one night, and i was pretty please with the hotel. the checkin staff were very friendly. checkin is 4pm, but our room was ready a hour before, so it's good to ask!!! the girl was very quick with checking us in, and by 3:15 we were in our room. the room itself is somewhat outdated, but it's hooters and the theme is wooden florida atmosphere. we had a nonsmoking double beds, which was perfect. the room itself was pretty clean, so i never saw any stains or anything. their casino is small but it's nice cause it's quick to find where you need to go! the casino staff were very friendly as well. we ate at hooters for lunch and also for breakfast the next morning! sign up for the play club, because you get free play (i didn't win though, i suck at gambling) and $5 off a meal! lunch was fine and pretty quick! i had a buy one get one wings, and basically it tasted like <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>! the <mark>Fried Pickles</mark> were the best i've had at any hooters. breakfast was really good surprisingly as well! i had a bloody mary with mine! the convenience store is open 24/7, so you can get your krispy kremes and beer when you need it. prices aren't bad at hooters and the store. the hooters girls are pretty friendly, except there was one who had a terrible attitude who worked in their hooters merch store. you could tell she hated her job. other than that though it was fine.\nlocation is great because you are across the street from the mgm entrance. we spent a lot of time in mgm honestly. fat tuesdays is there also, along with 2 monorail entrances. also very close to luxor and excalibur. \ni am returning in mid march for spring break and i am staying at hooters once again! i scored an awesome 2 night deal through travelocity for $85! we will be spending time at hakkasan and some other places! it's just a room honestly, and how often are you in it? it's cheap but saved you money for drinks and going out!", 
            "i was actually pretty surprised with my stay. \n\nme and my boyfriend stayed 4/4-4/6/15, i got a groupon deal that included free slot and table play and also a buy one get one free breakfast along with, i think, two other coupons. it was a good deal. \n\nit's rather close to everything, literally right across the street from mgm grand. it's a small hotel but everyone's pretty friendly. i didn't have anyone \"stalking\" me and my room wasn't dirty or anything. some appliances were old but you get what you paid for. we had no problem with the sink or the tub so maybe we were the exception. \n\ni liked the vibe, we had some good luck at the slots, as well as the tables. they have $5 blackjack as well as a $3 table hidden inside of the casino. \n\ni'd advise against shopping in the convenience store as it's a bit over priced. stop by a liquor store or find a grocery store to get your water or goods. \n\ni loved the wings. i've never tried <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> and it was my first time but i was happy. they were nice and crispy and nicely sauced. i tried the spicy garlic <mark>Fish and Chips</mark> honey. the spicy garlic was good but sooo spicy the chipotle was perfect. i probably lived off wings that weekend i was there, hahaha. i also tried their soup, broccoli cheddar which was eh, really soupy not thick like other places. \n\nfor sure, i want to try the mad onion next time i'm there. \n\nto be honest, we weren't in the room a lot, just when we were sleeping and resting from the endless drinking and gambling or after shopping. it was perfect for our needs and i'm pretty sure we'll come back. plus, how can i say no to wings that are open 24/7 whenever i have a hankering for them on vacay?!! :d", 
            "my girlfriend gives it a two due to the lousy service, but i give it a four for a couple of reasons: coffee pots in the room, 24 hour pool, cheap room service, and affordable rooms in a good location. \n\nwhere else in vegas can you go swimming at 3 am, get <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> delivered to your door for a few bucks, and then make your own coffee when you wake up? \n\nit's not the palazzo or the bellagio, and for the prices i wasn't expecting anything grand. if you are, it's time to wake up and smell the freshly brewed coffee from your in-room keurig. \n\nthe mad onion is ok for the money, hooters food is always good (except for the long lines every night), and the bars are average. \n\nthe service can be horrible. a bartender ignored me for 20 minutes because he was busy hitting on one of the girls across the bar, bellhops can take an hour or two, and the valet wouldn't even open the girlfriend's car door (it's easier and faster to park your own car anyway). \n\non the other hand, another bartender went above and beyond in making us happy with our drinks, the front desk clerks were almost always polite, and the dealers managed to put up with my neophyte gambling skills without screaming.\n\nhooters is directly across from the overpriced mgm grand, and you can catch the tram from there and visit the entire strip for just a few bucks. you're also right behind the tropicana if you get bored.", 
            "hooters is definitely a cheaper end hotel but they have so much potential. we've stayed here a couple times and it's been ok experiences. we got to stay in the bungalows this time and i liked those rooms better. we had some plumbing issues in the first room so they moved us into another room next door but we had the same issues. they worked with us upon check out for the inconvenience so i was happy. \ni like staying here but it's a hit or miss some rooms are good some arnt. if they just invested some more tlc into hooters it would be a awesome place to stay. \n\nthe pool area is nice but if you want to tan you need to go out early, after the morning the sun sets on the other side of the building so it gets shady over the pool area. one pool is heated and two smaller jacuzzis are too but the nice shallow pool with the waterfall is freezing cold! no one was swimming in it and it's been like that for a few months since my last visit. \n\n\nthe restaurant sucks! just to make a order we got the run around to 3 different people and some of them had no idea what they were doing. after some time we got the order, some good ole fashion <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark>!  i was excited until we opened them in our room. they weren't even nuggets, smaller then chicken nuggets. the sorriest excuse for wings i've ever seen.", 
            "hooters is a little off of the beginning of the strip.  i first started coming here because i was staying at the mgm signature.  i wanted to gamble for cheap and since mgm is a bit higher, i walked over to hooters.  \n\nthey don't have a great location so they make up for that with $5 craps and blackjack tables.  that's more in my range for table games.  i am also a fan of <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> so i always come to the restaurant to eat.\n\nthe service is pretty nice and we were even comped a pitcher of beer because they had originally brought us the wrong one.  the restaurant window side has a view of a pool so you can get some entertainment there.\n\nnice, beautiful workers at the restaurant and also the tables games have pretty nice dealers for cheap prices.  i know it's a bit off the strip, but it's not so bad to come and try.", 
            "we order <mark>Hooters Daytona Beach Style Wings</mark> and it super good. staff offer awesome customer service. \n#customerservice #wings", 
            "thought it was a cool start to hit up hooters to start my trip in vegas being across at the mgm and it was a sweet time. service was far and above great and <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> are just always great."
        ], 
        "dish_name": "Hooters Daytona Beach Style Wings"
    }, 
    {
        "text": [
            "really relaxing and enjoyable experience. great wait staff. it's nice to be able to eat a down-home <mark>Buffalo Chicken</mark> sandwich at a good price while in such an overpriced town. everything we had was good from the <mark>Boneless Wings</mark> to the fries. beer prices are pretty decent too. definitely a good departure for one meal while staying in vega$.", 
            "<mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> is in my top 5 favorite things to eat, so of course i spent the very first hours of 2014 here. the line was long, but we got seated within 10 minutes. the server was sweet and the food came out quickly.  got my faves the classic buffalo wings, <mark>Boneless Wings</mark>, and <mark>Buffalo Shrimp</mark>, it tasted like hooters. nothing really to complain about :) if you don't like salty food, don't get the parmesan garlic cause that shit is salty.", 
            "hooters is always good when it comes to wanting some finger licking good chicken wings and things! came to this location this past weekend with a group of friends and had a pleasant experience for the most part! after all it was like after 1am on a saturday night so i figured it would be busier than what it really was! our waitress was very nice but slow at checkin in on us to refill waters and other drinks, they weren't busy enough for me to want to cut the slack i could possible cut.. anyways the good was great we all enjoyed the <mark>Boneless Wings</mark> and i have to recommend the <mark><mark>Buffalo Chicken</mark> Dip</mark> it's amazing!! i literally would come here now just for this dip and for an appetizer it's a very decent size and believe that it's priced accordingly! will return !", 
            "we went to a great hypnosis show but were unimpressed with the casino and restaurant.  we had <mark>Boneless Wings</mark> in the hooters restaurant and they were by far the worst <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> we have ever had.  we have had better food in other states so we were disappointed unexpectedly.  they were gooey and soft and soggy.  very unappealing.\nthe $3 blackjack they advertise so much was just one table out of 6. it was full the whole time we were there so we did not play blackjack.\nit was also very cold inside and i was wearing a short sleeved shirt and capri pants and i almost had to leave because i was so cold.  it was 90 degrees outside guys, so your guests are dressed for warm weather!", 
            "i have stayed at hooters casino and hotel for at least 4 or 5 years now. the first year was not the best but forgivable. sorry to say that we will never return. why?\n\ncons\n1. toilet clogged (had to call twice)\n2. bathtub barely drained\n3. 2 hangers and 2 broken clips\n4. safe door battery compartment was rigged unsuccessfully with scotch tape. (they never returned to fix it as they promised)\n5. sink looks like someone took a hammer to it\n6. ellie the security guard was totally unprofessional in how she spoke to me. yelled at me because i didn't hear her calling me to see if i had room key because i entered from the bungalow. here's a tip: ask me nicely if i have my room key instead of running after me because you think i want to enter the pool area \"illegally\". (total lack of customer service) side note: pool isn't that great, if the wind is right you get to smell their garbage, hot oil from hooters and the sewer!\n7. no blankets? (has to call)\n8. failure to vacuum hallways of bungalow building\n9. no air in this building\n10. no more 24 hour pool\n11. hooter's <mark>Boneless Wings</mark> for $10.99 were the size of chicken nuggets\n12. hooter's male bartender had several dumb moments \n13. imelda refunded me only two days of resort fee's\n14. $75 resort fee charge on my card even though i prepaid (this was after imelda said she would refund me (i also stayed 4 nights not 3...)\n15. shower temp changes as the others in the building flush toilets and monkey with their temp setting for the shower/sink.\n\npros\n\n1. imelda refunded 2 days of resort fees. \n2. older male security guard was nice as hell. \n\n\nas you can see the cons out weigh the pros. yes, there are more expensive hotels, but i expect decent plumbing, a comfy bed plus to be treated like a person and not just a dollar sign. \n\nfyi- their little store \"splurge is closed\" and i didn't step into mad onion because it's just feels gross in their."
        ], 
        "dish_name": "Boneless Wings"
    }, 
    {
        "text": [
            "reviewing the restaurant only\n\nwe had company here from out of town and he really wanted to eat at hooter's, so we indulged him.  i had never been to this location and i won't be back.\n\nfirst off, the hostess kept us waiting for about 10 minutes while they \"cleaned off a table\" (mind you, there were only 4 of us).  as we were being seated, there were plenty of empty tables so i'm not sure what that was all about.  we interacted with three different hostess/waitresses and all were very rude.  the food was terrible.  one guest in our party had the <mark>Steamed Shrimp (1/2 or 1 lb)</mark> for $11.49. there were maybe 12 smallish shrimp on her plate (no side dishes for this price by the way) and shelling the shrimp seemed to be a lot more trouble than it was worth.  one guest had the <mark>Fish and Chips</mark> - he said it had no real taste at all.  i tried the chili (which i have loved at other locations) and here it was very bland and the texture was more like a can of cat food.\n\nall this was after a 32 minute wait for our food.  i know that because by the time we finally got seated i started worrying about the flight our guests had to catch so i was watching the clock.  not once during this time did a waitress come to refill drinks or let us know our food was on its way.  in fact, we didn't see her at all until she brought the food out.\n\ni tried voicing my concerns about the food and the wait but the waitress looked at me like i was speaking a foreign language and dropped off our check and walked away.  i usually give people and restaurants the benefit of the doubt but i really think unless you happen to be staying at this hotel and don't want to bother going somewhere else, steer clear."
        ], 
        "dish_name": "Steamed Shrimp (1/2 or 1 lb)"
    }, 
    {
        "text": [], 
        "dish_name": "Oysters"
    }, 
    {
        "text": [
            "reviewing the restaurant only\n\nwe had company here from out of town and he really wanted to eat at hooter's, so we indulged him.  i had never been to this location and i won't be back.\n\nfirst off, the hostess kept us waiting for about 10 minutes while they \"cleaned off a table\" (mind you, there were only 4 of us).  as we were being seated, there were plenty of empty tables so i'm not sure what that was all about.  we interacted with three different hostess/waitresses and all were very rude.  the food was terrible.  one guest in our party had the <mark>Steamed Shrimp (1/2 or 1 lb)</mark> for $11.49. there were maybe 12 smallish shrimp on her plate (no side dishes for this price by the way) and shelling the shrimp seemed to be a lot more trouble than it was worth.  one guest had the <mark>Fish and Chips</mark> - he said it had no real taste at all.  i tried the chili (which i have loved at other locations) and here it was very bland and the texture was more like a can of cat food.\n\nall this was after a 32 minute wait for our food.  i know that because by the time we finally got seated i started worrying about the flight our guests had to catch so i was watching the clock.  not once during this time did a waitress come to refill drinks or let us know our food was on its way.  in fact, we didn't see her at all until she brought the food out.\n\ni tried voicing my concerns about the food and the wait but the waitress looked at me like i was speaking a foreign language and dropped off our check and walked away.  i usually give people and restaurants the benefit of the doubt but i really think unless you happen to be staying at this hotel and don't want to bother going somewhere else, steer clear.", 
            "the good things about this hotel are the fact that they are fairly cheap, they have a pool with music and they hold hooters beauty contests. even with all that, you have to admit that this hotel is getting pretty dated.\n\nour group got a pool level bungalow.  an otherwise nice view of the pool which is partially obscured by the bars that are part of the security gate.  the inside of the rooms are pretty antiquated and in some cases run down. our room had a crt(old, non-flatscreen for those technologically impaired) television, rust/corrosion stains <mark>Fish and Chips</mark> in the sink and bathtubs, some of the hardware (faucets) loose and a couple crickets and roaches inside.  luckily the air conditioning worked because it was a good 110+ degrees our entire stay. also on the patio and even in some areas of the pool (waterfall area) there is a weird sewage stench noticeable in the air.  not sure what that's all about. \n\ni didn't eat at the restaurant but a few of my friends did and while they enjoyed the wings, some of them didn't enjoy the other food options offered.  the little gift/snack shop also offers donuts, coffee and sandwiches.  the sandwiches for $6 could be a lot better though, very plain and basic and honestly not a great value. i found myself walking over to the local gas station to buy one of their sandwiches just to save myself about $3 for about the same quality (maybe slightly smaller). a bottle of water was also still $3 so the gas station was also the alternative for that.\n\ni didn't spend much time in the casino but it definitely felt \"old\".  they did have a sports style bar which was usually pretty empty but did have plenty of televisions.\n\nthe pool was actually the best part of this hotel and was probably the only thing other than the ac, that made this place acceptable. there are two main pools, one with a waterfall which runs a little cooler, another which runs a little warmer(and is more popular as a result) and some small jacuzzi style pools. it's open 24 hours which is perfect for hot summer nights.  they have a dj playing music, security and hostesses walking around and a bar right by. plus if you have a bungalow you can go through the security gate (with key card unless it is left open) and get directly to the pool. they also held a beauty/swimsuit contest with the hooters girls by the restaurant area next to the pool which was great. all of this would have brought the review up to 3 stars except for on the last night (saturday) after coming back from a long walk up and down the strip, we came back to find that the warmer pool had been closes and taped off.  not sure why but i fear that some drunken frat kids maybe contaminated the pool \"somehow\" or perhaps it was something far more sinister.  bummer.  the pool was considerably less busy as a result but nobody felt like going in the cooler pool that late.\n\nthe staff i encountered was actually pretty nice so that's one thing i can't really complain about. so kudos there.\n\nthe fact of the matter is that this is a cheaper hotel, so expect that.  if you don't spend a lot of time in a room in vegas and you don't mind the location of this towards the end of the strip then i suppose it is for you.  it is nice that they have a pool which is [usually] open 24 hours.  the rooms are pretty run down, their televisions are antiquated and ours constantly lost signal and you might find a couple bugs here and there.  so if you are looking for \"nice\" rooms just pass.  otherwise, on a budget, this place might suffice. i could see myself maybe staying here again if i was on a tight budget or something was extremely last minute.", 
            "i was actually pretty surprised with my stay. \n\nme and my boyfriend stayed 4/4-4/6/15, i got a groupon deal that included free slot and table play and also a buy one get one free breakfast along with, i think, two other coupons. it was a good deal. \n\nit's rather close to everything, literally right across the street from mgm grand. it's a small hotel but everyone's pretty friendly. i didn't have anyone \"stalking\" me and my room wasn't dirty or anything. some appliances were old but you get what you paid for. we had no problem with the sink or the tub so maybe we were the exception. \n\ni liked the vibe, we had some good luck at the slots, as well as the tables. they have $5 blackjack as well as a $3 table hidden inside of the casino. \n\ni'd advise against shopping in the convenience store as it's a bit over priced. stop by a liquor store or find a grocery store to get your water or goods. \n\ni loved the wings. i've never tried <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> and it was my first time but i was happy. they were nice and crispy and nicely sauced. i tried the spicy garlic <mark>Fish and Chips</mark> honey. the spicy garlic was good but sooo spicy the chipotle was perfect. i probably lived off wings that weekend i was there, hahaha. i also tried their soup, broccoli cheddar which was eh, really soupy not thick like other places. \n\nfor sure, i want to try the mad onion next time i'm there. \n\nto be honest, we weren't in the room a lot, just when we were sleeping and resting from the endless drinking and gambling or after shopping. it was perfect for our needs and i'm pretty sure we'll come back. plus, how can i say no to wings that are open 24/7 whenever i have a hankering for them on vacay?!! :d"
        ], 
        "dish_name": "Fish and Chips"
    }, 
    {
        "text": [
            "i was pretty stoked that i won $75 after starting off with $20. i've been losing at planet hollywood all week and decided to give hooters casino a shot after eating at their restaurant. the casino is huge! with tons of interesting games like the flintstones and willy wonka etc. there are lots of hostesses walking around so your cup \"shalt neverth go dry\". if you stay there long enough, you'll start getting harassed to open a players card with them. all in all, it was a fun experience and i plan on frequenting that particular casino, since it sure has brought me some good luck.\n\ngreat atmosphere and easy going waitresses. lots of good looking waitresses, so you won't have a problem maintaining eye contact. i got some snow <mark>Alaskan Crab Legs</mark> and my friends got wings. this is the first time i ever single handedly just ordered <mark>Alaskan Crab Legs</mark> and i have to say that the <mark>Alaskan Crab Legs</mark> were very tasty!they have a great money saver deal where you buy 10 wings and get 10 more for free."
        ], 
        "dish_name": "Alaskan Crab Legs"
    }, 
    {
        "text": [
            "this review is for the restaraunt: cold fries, smelly <mark>Baja Fish Tacos</mark>, and a cheeseburger that seemed mooshy and seemed to be composed primarily of soybeans or other fillers, not meat. the wings were good, though. the casino is homey and fun, though the tables are usually too busy to get on easily. i'd give the casino more like 4 stars as the staff are nice, the service good. but not the restaurant...", 
            "so, i stopped in to the casino for a low cost blackjack game and a little lunch.  the casino was a little dead so i headed over to get some lunch.  i was there about 2 pm in the afternoon.  what can i say, with a place like this the main attraction is the great looking waitstaff and second attraction is the food.  my server was great but she had to cover far too many tables.  i ordered <mark>Baja Fish Tacos</mark>.  i had this at another hooters restaurant and it was outstanding.  this was poorly cooked, and improperly seasoned.  it was a very mushy taco.  sorry even a great waitress can't bring me back to a place that serves poorly cooked food.  disappointed in my food, i left the casino entirely.  so my server was a 4 otherwise i would have given them a 1 or 2."
        ], 
        "dish_name": "Baja Fish Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Western BBQ"
    }, 
    {
        "text": [], 
        "dish_name": "Double 'D'"
    }, 
    {
        "text": [], 
        "dish_name": "The Baja"
    }, 
    {
        "text": [], 
        "dish_name": "More than a Mouthful"
    }, 
    {
        "text": [], 
        "dish_name": "Texas Melt"
    }, 
    {
        "text": [], 
        "dish_name": "Smothered Chicken"
    }, 
    {
        "text": [], 
        "dish_name": "Big Fish"
    }, 
    {
        "text": [
            "went here out of starvation/desperation, after hitting the sportsbook for a quick wager. we weren't in the mood for wings being that we ate the night before at buffalo wild wings (which by the way hooter doesn't hold a torch to)..opted for a burger and <mark>Philly Cheese Steak</mark> sandwich instead.\n\nthis was probably the blandest <mark>Philly Cheese Steak</mark> sandwich i've ever eaten in my life. my fries were worse than frozen ora ida out the bag from walmart. my bf said the burger was just as bad. i found a bottle of hot sauce on the table and proceeded to dump it all over my sandwich...still no flavor, seriously not even the onion or grilled peppers tasted like anything, how is that even possible? the best thing in that meal was my heinz ketchup.\n\nwhen the check came our waitress asked how the food was, i told her it was really bad and had no flavor...her response :.\" yeah i know they don't season the food i stick to the wings\" ...i wish i had heard that gem before i ordered.\n\nbut the extra bonus of the evening was watching the pregnant hooters girl in shorts delivering food to table.. oh em gee.  p.s. i took pics! lol\n\navoid this place like the plague..", 
            "as a vegas local you expect good service right? wrong!!!! last night myself and my girlfriend went in what a mistake. we ate in the hooters resturant like we usually do when we visit the casino. so we ordered out food, curley fries with cheese sauce for an app, <mark>Philly Cheese Steak</mark> and cheese no onion for my girlfriend, and 10 wings breaded mild for myself. \n\nabout 20 mins after we ordered all the food came out at once. the fries were ice cold and hard as a rock, my girlfriends sandwhich had onion on it and my wings were over cooked as per usual on a slow night. we have to stop a hostess to find our waitress ( who was horridly miserable) to come over. my girlfriend sent her food back and after about 10 more mintues she get her food. \n\nshe goes to move her pickle out from under her fries (because come on who puts a cold pickle under fries right?!), and much to both of our surprise there is a 3 inch long piece of black hair stuck to her pickle. so we call the manager to come over. \n\nwe explain the situation to david, and he offers to remake the food for a third time and claims to see no hair after i pick up the pickle and show it to him. we say no we dont want to we want to leave. so he says were more than welcome to leave our food has been comped. \n\nso we leave as we are leaving, i see david talking to another guy who keeps looking over at me, and nodding his head so i stop. david walked back over to me, and i asked what the problem was. he said nothing but you are more than welcome not to return to the resturant. i asked him why he said oh because we obvisiouly cant make you people happy. ok fine. \n\ni go back today and speak with bill the general manager. he also tells me every time you people are in here theres always an issue. you are always talking to a manager or complaining about something. it would be in your best interest not to come back. \n\nok first off the customer is always right, secondly you people is kind of demeaning to me and i take that as an insult. third i myself and my girlfriend know most of the people in the resturant personally that why were always talking to managers. \n\ni will not be returning to hooters anymore until the higher management staff is changed or they will admit they were in the wrong. i have never been treated so poorly in my life and will make sure this gets out to hooters of america!", 
            "i'm reviewing the hooters restaurant/bar that's in the casino. (not reviewing the hotel or casino itself)\n\nhooters is extremely close and convenient for when i get off of work around midnight. my friend and i went there for some cheap prime rib, assuming the mad onion was still open. unfortunately, even though it was friday night, the mad onion was closed. the only thing open that served food was the hooters bar and restaurant so we dragged our feet there, expecting the worst.\n\nusually when i go to the 'open all night' restaurants in the casinos, either the food or service is terrible, and i just assume it's because of the late hour and the servers and kitchen staff have already mentally checked out.\n\nwe were actually pleasantly surprised. the food was amazing. i got the <mark>Buffalo Chicken</mark> sandwich with teriyaki sauce and fries and my friend got a <mark>Philly Cheese Steak</mark> sandwich. i can't convey enough how much this wasn't your typical late night food. everything tasted so fresh and delicious. my friend said it was one of the best <mark>Philly Cheese Steak</mark> he has ever had.\n\nthe service was even better. given the hour and locale, we just expected sub par service. our server, karissa, was pleasant, enthusiastic and very helpful. (she obviously loves her job. getting served by someone who hates their life is never fun.) she checked on us regularly and made our hooters experience that much more enjoyable. someone get that girl a raise.\n\ni'm happy to say that i found a new post-work eatery and will definitely be back."
        ], 
        "dish_name": "Philly Cheese Steak"
    }, 
    {
        "text": [], 
        "dish_name": "Hooters Chicken Strip Cheese"
    }, 
    {
        "text": [], 
        "dish_name": "Pulled BBQ Pork"
    }, 
    {
        "text": [], 
        "dish_name": "Shrimp Po Boy"
    }, 
    {
        "text": [
            "for being the hooters restaurant in the casino, this place did not stack up to normal hooters' restaurants across america. the service was decent, but the food just did not taste as good as normal. we stayed there for a few nights (we are locals, this was cheap and while our house did not have water for laundry repair) and ended up eating there twice. i usually love the <mark>Buffalo Chicken</mark> sandwich, and both times it was very dry, and pretty much sauce-less and taste-less. normally, i love this sandwich and its smothered. my boyfriend got salads both times which were much better. i'd say this is the worst hooters we have ever been to.", 
            "<mark>Fried Pickles</mark> are too salty, <mark>Cole Slaw</mark> is blah, and the bun on the <mark>Buffalo Chicken</mark> sandwich is useless. go to a hooters closer to home...it will be much better than this. here, it's shuffle you in and get you out quick.", 
            "really relaxing and enjoyable experience. great wait staff. it's nice to be able to eat a down-home <mark>Buffalo Chicken</mark> sandwich at a good price while in such an overpriced town. everything we had was good from the <mark>Boneless Wings</mark> to the fries. beer prices are pretty decent too. definitely a good departure for one meal while staying in vega$.", 
            "i'm reviewing the hooters restaurant/bar that's in the casino. (not reviewing the hotel or casino itself)\n\nhooters is extremely close and convenient for when i get off of work around midnight. my friend and i went there for some cheap prime rib, assuming the mad onion was still open. unfortunately, even though it was friday night, the mad onion was closed. the only thing open that served food was the hooters bar and restaurant so we dragged our feet there, expecting the worst.\n\nusually when i go to the 'open all night' restaurants in the casinos, either the food or service is terrible, and i just assume it's because of the late hour and the servers and kitchen staff have already mentally checked out.\n\nwe were actually pleasantly surprised. the food was amazing. i got the <mark>Buffalo Chicken</mark> sandwich with teriyaki sauce and fries and my friend got a <mark>Philly Cheese Steak</mark> sandwich. i can't convey enough how much this wasn't your typical late night food. everything tasted so fresh and delicious. my friend said it was one of the best <mark>Philly Cheese Steak</mark> he has ever had.\n\nthe service was even better. given the hour and locale, we just expected sub par service. our server, karissa, was pleasant, enthusiastic and very helpful. (she obviously loves her job. getting served by someone who hates their life is never fun.) she checked on us regularly and made our hooters experience that much more enjoyable. someone get that girl a raise.\n\ni'm happy to say that i found a new post-work eatery and will definitely be back.", 
            "hooters is always good when it comes to wanting some finger licking good chicken wings and things! came to this location this past weekend with a group of friends and had a pleasant experience for the most part! after all it was like after 1am on a saturday night so i figured it would be busier than what it really was! our waitress was very nice but slow at checkin in on us to refill waters and other drinks, they weren't busy enough for me to want to cut the slack i could possible cut.. anyways the good was great we all enjoyed the <mark>Boneless Wings</mark> and i have to recommend the <mark><mark>Buffalo Chicken</mark> Dip</mark> it's amazing!! i literally would come here now just for this dip and for an appetizer it's a very decent size and believe that it's priced accordingly! will return !", 
            "i love hooters and their food!!!! but this one was terrible!!! i don't get why some hooters let you split up wing sauces & some don't. all the hooters we go to, you can get a 20 piece split up by 5's, but here you could only do 10 and 10. we only got a 10 piece with the daytona we know we like, but would've ordered more if we had that option! we had the <mark><mark>Buffalo Chicken</mark> Dip</mark> too. the food was really good, no problems there, but just for the absolutely terrible awful service you get one star. it took forever for us to get greeted, we sat down and i went to the restroom & when i got back my fianc\\u00e9 still hadn't been gotten to!! i don't think our waitress smiled once, and she only came to the table to take our order & give the check. she never checked to see if our food was ok, and we left cash because i figured if we had to wait for her to run a credit card we would've been there forever. i worked at hooters for 9 years and was trained to always pay extra attention to the women and couples to make them feel comfortable. she obviously only wanted to take care of her male customers. hopefully they got better service!", 
            "ate here 3 or 4 years ago on my birthday and i was thinking it was going to be like the hooters in arizona which i loved going to when i was in college beautiful woman good food the works but i didn't get that here sure the woman were beautiful and they have different tvs to watch sports but the food here was not good i ordered the <mark>Buffalo Chicken</mark> sandwich and the <mark>Curly Fries</mark> with a soda and i think a cake or shake afterwards the fries were old and stale the cake or whatever desert i got was dry the only decent thing was the sandwich the customer service wasn't really all that good as the lady didn't check on me that much overall it was a disaster and the whole inside of the casino is just blah and it seems since the last time i went nothing really has changed overall this one bad experience has changed my mind about coming here again overall which sucks because hooters was at one time one of my favorite restaurants to eat at and relax and catch the games at."
        ], 
        "dish_name": "Buffalo Chicken"
    }, 
    {
        "text": [
            "absolutely horrible. i chose to stay here for the location and price, probably the worst decision i've ever made. i wish i would have just stayed at the stratosphere the whole trip. if you can afford another 100 bucks for a week please go elsewhere. my first room was a god damn mess. i've stayed at hotels way cheaper and have had way better accommodations. the staff was helpful in moving me to a different room, but the bed in my second room was even worse then the first room. there's no excuse for having a bed in a casino right off the strip where it looks like a 400 pounder died and sat for weeks. no excuse. this a place where people sleep, i should have never had to say anything in the first place. not really sure why anyone would say the casino waitresses are good. the ones i've dealt with walk around like they are above everyone else. sorry, but your shit still stinks no matter how low you stoop to get tips. the \"restaurant\" needs to focus on serving real food instead of passing off a lettuce sandwich with a few pieces of store bought lunch meat as a \"<mark>Club Sandwich</mark>\". the food is gross, you can tell the quality is bad when you're up all night because you can't stop burping. i will never stay in this establishment again, nor will i ever eat in a hooters or recommend them to anyone i know(funny, i never actually ate at one before this trip). i am extremely disappointed in this company, and expected at least a 3 star experience. instead, i've been given a -1 star experience, right off the strip that has soured my first vegas experience. don't waste your money here. the rooms are terrible, and the casino is a joke. not lying folks, seriously go spend the extra 100 bucks and have a good time."
        ], 
        "dish_name": "Club Sandwich"
    }, 
    {
        "text": [], 
        "dish_name": "Blackened Mahi"
    }, 
    {
        "text": [
            "decided to check out the hooters restaurant to have a few beers and wings and watch some college football.  located inside the hooters hotel, it's located in the very back of the first floor of the casino.\n\nthe restaurant has that familiar wood paneling look with plenty of tvs all around to check out the game.  we got here around 3ish so we had no problems getting seats.  we got our menu and it's your typical bar and grill items here, so we're talking about burgers, sandwiches, strip steaks, chicken, and of course their most popular food item, wings.\n\nwe decided to get a couple rounds of beer and also some wings and their <mark>Chili Cheese Fries</mark>.  the service was a bit slow, but when we got our food i have to say they were generous.  the wings were pretty big and we got a big pile of <mark>Chili Cheese Fries</mark>.\n\ni don't know how they cook their wings, but have to say i always thought hooters had some of the best wings out there and this has lived up to it's reputation.  nice juicy wings with a crispy out side.  the fries here were also very good.  plenty of chili with nice chunks of meat with a ton of cheese just made for good greasy junk food to watch college football.\n\nthe eye candy here wasn't quite what we were hoping for.  when you think of vegas and hooters, you have a certain image in your mind.  unfortunately, it didn't live up to expectations we were hoping for.  but no matter, the food and the college football games were still good.\n\nas to ratings, to be honest, the las vegas hooters is really no different than any other hooters i've been too.  i wasn't expecting the sapphire or something, but was hoping for just a little bit more \"las vegas\" to it.  overall, the food hit the spot and the wings were good but honestly i wouldn't go out of my way to coming here when you will get the same experience at any other hooters restaurant across the country.  overall, just average and a 3 star rating."
        ], 
        "dish_name": "Chili Cheese Fries"
    }, 
    {
        "text": [], 
        "dish_name": "Big Dipper Fries"
    }, 
    {
        "text": [], 
        "dish_name": "Onion Tanglers"
    }, 
    {
        "text": [
            "it was good... nothing over the top special.  and, nothing really to complain about either ;)  i'd give another .5 star if i could... but as we all know, i \"can't\" so a 3 star it is! ;)\n\ni had the <mark>New England Style Clam Chowder</mark> soup which was really good!  and, a <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark>, which was good/average.  the fries and wings were also good/average.  \n\ni think it must have been mating season a few months back, because a couple of the \"hooters\" had an \"owlet\" on board! ;)  was kinda funny considering the \"boobie\" concept at \"hooters\" - it must kinda change the way the guys are thinking with those particular hooters ;)  lol\n\noverall everything was good, service was friendly (our hooter girl was one of the ones with an owlet :)", 
            "my waitress was very efficient. she was pretty busy but she too good care of us! i ordered the cheesy totts, they were ok. they were a little skimp on the bacon and sour cream, and although it was ok, i dont think i'd order that again. my friend ordered the <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark> which in our opinion had too much dressing. she ordered that to be healthy and we all know there are lots of calories in dressing. we also ordered the <mark>Caramel Fudge Cheesecake</mark>. its was ok, the fudge on the bottom of the cheesecake was a little overwhwhelming for me. the chocolate syrup swirled on the the plate would've been enough chocolate for me. but otherwise it was good. so i give this hooters 3 stars because it was all around ok. nothing, not the food or the service was great. in addition it was about a 35 minute wait, there were a lot of empty tables, im thinking they were short staffed and should hire more people so they can accomodate more people so the wait is in turn shorter, just a thought.", 
            "my girlfriends and i ate at hooters on tropicana at hooters casino hotel on the first night of a bachelorette party - and i say fittingly because hooters were a prerequisite for the trip - you either have them, or you like them. apparently though, for this place, the type of salad was unnecessarily \"high class\" with its actual greenery, but i liked it - i always like a better salad than just romaine. \n\nbut hooters gave us live entertainment in the form of  a cover band and boobs. what else do you really go there for? i ordered chicken wings (which were good, though i couldn't finish them), whereas chicken sandwiches and <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark> were the other main courses for my friends, and there weren't any complaints to be had. \n\ni go to any hooters because i like the atmosphere and it seems to be on my bucket list - i've been to quite a few of them. if there's a hooters, i'm there. at least once. and because you don't expect much, you get a lot more. \n\ninexpensive food, cheap drinks, loud music, and pretty girls (for the most part) - that's the point of the place, so why fight it? it's always a good time.", 
            "reading the reviews for this hotel had me very skeptical before booking through groupon but  i am so happy that i am able to make up my own mind. is this the best hotel i have ever stayed at no but its most certainly not the worst and it is not the motel hotel as others have described. the hotel rooms were big and clean. yes, the carpets can use a nice steam cleaning at least once a month but again you get what you paid for. i don't walk around barefoot even on carpet for $250 a night. the mad onion was very disappointing the waiter was terrible she said they were out of the bbq <mark>Buffalo <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark></mark>, when we asked what part was missing she said everything,however we were able to order a <mark>Side Garden or Caesar Salad</mark> and chicken nachos we were confused as you can imagine. the only thing good about the mad onion was the free bottle of wine. if i can get this hotel for under $50/night again i will be back for sure!"
        ], 
        "dish_name": "Side Garden or Caesar Salad"
    }, 
    {
        "text": [
            "horrible food. my chicken sandwich tasted like rubber, the <mark>Curly Fries</mark> weren't cooked enough, and the wings were mediocre. \n\nstop supporting horrible chains like this and they will all go away.", 
            "this is a review for the restaurant inside of the casino. \n\ni've always been a fan of <mark>Original <mark>Hooters Daytona Beach Style Wings</mark></mark> and <mark>Curly Fries</mark>. so, after seeing a show we stopped here to eat. my husband and i both got wings. they were cold. cold enough that they could have been cooked and put in the fridge. \n\nthis is the only hooters that hasn't been spot on with the wings. \n\nservice wasn't great either. we got our food and no one came to check on us for 20 minutes and i clearly wasn't eating my food. \n\nat least the <mark>Curly Fries</mark> were good, and warm. \n\noverall cold food and bad service, and they weren't even busy!", 
            "must wanted to say thank you to lindsay and kelsey from the bar. excellent service and very attentive.\n\nmy partner in dining (pid) went here recently for a small lunch. it was about 11:30am and we ended up here by accident because my pid took a wrong turn. definitely worth it!\n\nwe were immediately able to get seats at the bar. lindsay quickly greeted us and took our drink orders. we got two pints of blue moon ($6 each) to start.\n\nafterwards we ordered the honey chipotle wings with bleu cheese and a side of <mark>Curly Fries</mark>. the place was fairly busy, but it seemed that everyone was getting taken care of. lots of birthdays were being celebrated so there was lots of singing.\n\nour food arrived within 10 minutes of ordering. the wings and fries hit the spot and went down well with the blue moon.\n\nthe restaurant is very clean, and able to accommodate larger parties. what's also great is the food is affordable. yes the location is on the south end of the strip, but if you need some good old wings, you can't go wrong.\n\non tap i believe in addition to blue moon there's coors and red's apple cider (that's a first). there were others but i don't quite remember them.\n\nuntil next time, wing wednesday is every day!", 
            "i am not a fan of hooters but we were staying in the hotel to the left and did not want to walk far on the strip in the freezing cold so stopped here for lunch. i ordered the chicken sandwich with <mark>Curly Fries</mark> and was not disappointed. the chicken appears baked or grilled (not fried) which is just the way i like it. the service was pretty good too. would i choose hooters as my first choice in the future? no but for a quick bite, the food will do and it is pretty good.", 
            "i enjoyed lunch at the hooters cafe. i ordered the bbq burger and it came with <mark>Curly Fries</mark> and my drink was a iced tea. the service was very good. and my server was jenelle. i left too full to get a dessert.", 
            "ate here 3 or 4 years ago on my birthday and i was thinking it was going to be like the hooters in arizona which i loved going to when i was in college beautiful woman good food the works but i didn't get that here sure the woman were beautiful and they have different tvs to watch sports but the food here was not good i ordered the <mark>Buffalo Chicken</mark> sandwich and the <mark>Curly Fries</mark> with a soda and i think a cake or shake afterwards the fries were old and stale the cake or whatever desert i got was dry the only decent thing was the sandwich the customer service wasn't really all that good as the lady didn't check on me that much overall it was a disaster and the whole inside of the casino is just blah and it seems since the last time i went nothing really has changed overall this one bad experience has changed my mind about coming here again overall which sucks because hooters was at one time one of my favorite restaurants to eat at and relax and catch the games at."
        ], 
        "dish_name": "Curly Fries"
    }, 
    {
        "text": [
            "<mark>Fried Pickles</mark> are too salty, <mark>Cole Slaw</mark> is blah, and the bun on the <mark>Buffalo Chicken</mark> sandwich is useless. go to a hooters closer to home...it will be much better than this. here, it's shuffle you in and get you out quick."
        ], 
        "dish_name": "Cole Slaw"
    }, 
    {
        "text": [
            "things i love about hooters:\n1. wings. \n2. classy decor, with the signature logo (which is universally known as a sign of sophistication) and the surf-shack meets small town strip club theme.\n3. hooters girls manning the table games and wandering around the place like lost little aerobics instructors - omg, those socks make my heart race.\n4. pool - three pools of differing temperatures, sweet waterfall, and premixed tasty tropical drinks (with admittedly less alcohol than i would like). \n5. rooms - are nice, clean, orange and have comfortable beds.\n6. the dam - a diner with a very educational theme- the hoover dam. hey, it's a big deal, ok. its an exact replica of a rocky mountain diner experience, complete with cracked-out looking waitresses in ugly gray uniforms serving decadent burgers, and they got you covered for breakfast with a great buffet. but what happened to the frosted flake french toast???\n7. sense of humor - dont go to vegas without it. while most other hotels try to convince you that simply staying there and spending your money on their casino, overpriced rooms and nightclubs make you a sexy celebrity, hooters does not front. you know you like scantily clad, cute but not too attractive girls serving you <mark>Onion Rings</mark> and dealing your blackjack. hooters has a sense of irony and doesnt take itself too seriously and that makes the vegas thing more relaxing and enjoyable.\n8. did i say wings?\n9. gift store- bring the old lady home a t shirt and she'll forget about that hooker you accidentally killed during a bachelor party.\n10. dan marino steakhouse - need i say more?\n\nthings i could live without - dudes at the pool bar whistling every time a girl walks by (even me, so you know they arent even picky), long waits at the hooters restaurant, room rates have increased significantly for the weekend since last summer. other than that, its delightfully tacky yet...totally fun.", 
            "this review is just for the restaurant..\n\njust landed from coming in from hawaii for edc2011. some of our friends wanted to go out that night but i was dead tired and didn't want to go anywhere except to eat and sleep.\n\ni asked my sister who lived there for many years and suggested a place on where to eat. she said go eat at terrible's cake in the hotel with the same name.. its cheap & no frills food. the people i was with didn't like the idea of a restaurant named terrible's so they suggested hooters.\n\ni was like okay that's fine, since you cant really mess it up right?\n\nwe get there and we have to sign up for some hooters card thingy to get the discounted chicken wings. i'm like okay cool. then after about 20 minutes later, we are signed up and seated.\n\ni just wanted some wings and a side to suppress this stomach cramps i have been having because of nothing to eat. the wing special they have is for some really cheap amount, i forgot how much it was, like 10 cents or 20 cent wings?\n\nbut here is the catch, you need to buy a soda, and a minimum purchase of wings. the wording was really complicated but we had to ask the waiter and she explained it to us.\n\ni get wings and some <mark>Onion Rings</mark> and a diet coke. it comes out fairly quickly. i was hella hungry so didn't even bother to assets what i was eating. i just went chowing down.\n\nafter eating all the minimum order of the wings. we leave the restaurant. but then a little bit after, about 20 minutes or so after eating, my start to get stomach cramps again and had to use the restroom at our hotel.\n\nseems like i got food poisoning from the chicken. when i think back about it. the chicken was really cold like it was sitting out side for a while already. i asked my sister about it who also works in the food service industry and she also said she got food poisoning from there.\n\nnext time i'm in vegas, i'll pass on hooters. there is so many better places to eat.\n\nwell there you go, if you want some chicken wings with a side of food poisoning, hooters for cheap wings is the place you want to be.", 
            "great food great experience\ni'd like to take a few moments of your time to let you know about our recent dining experience at hooters.\non tuesday april 1st, 2014 my friend and i decided to have dinner at your establishment.\nfirst of all, i'd like to say a few things about our waitress jasmine.\nshe was awesome. very polite and outgoing. she made us feel welcome. it was a wonderful experience having jasmine looking after us. she really was sincere and made us very comfortable. always smiling.\nfirst we had drinks and then she even asked us when we would like to have our <mark>Onion Rings</mark>. before or with our dinner. we thought that was amazing!\nour dinner came and yet more friendly comments. wow!\nour chicken wings were amazing and exactly how we ordered them. once again more friendly chatter.\nafter dinner she asked us if we would like to take our leftover food home with us. we said yes of course.\nshe even sat down and chatted briefly with us once again.\njasmine is a wonderful young lady and you could just tell that she truly enjoys her job. she is a superb asset to", 
            "i love hooters restaurants ( in general ). this hooters in the hotel had the worst food, and customer service.  the chicken sliders were stringy and tough, the <mark>Onion Rings</mark> were not good. \n\nmanagement greeted us rudely saying that they were not going to serve us at their high top tables. no reason except of their waitress manning schedule.  we mentioned that we didn't come here to sit in their back in the corner seat they were offering.  \n\nthis hooters had absolutely no redeeming qualities from the management to the food."
        ], 
        "dish_name": "Onion Rings"
    }, 
    {
        "text": [
            "my waitress was very efficient. she was pretty busy but she too good care of us! i ordered the cheesy totts, they were ok. they were a little skimp on the bacon and sour cream, and although it was ok, i dont think i'd order that again. my friend ordered the <mark>Chicken <mark>Side Garden or Caesar Salad</mark></mark> which in our opinion had too much dressing. she ordered that to be healthy and we all know there are lots of calories in dressing. we also ordered the <mark>Caramel Fudge Cheesecake</mark>. its was ok, the fudge on the bottom of the cheesecake was a little overwhwhelming for me. the chocolate syrup swirled on the the plate would've been enough chocolate for me. but otherwise it was good. so i give this hooters 3 stars because it was all around ok. nothing, not the food or the service was great. in addition it was about a 35 minute wait, there were a lot of empty tables, im thinking they were short staffed and should hire more people so they can accomodate more people so the wait is in turn shorter, just a thought."
        ], 
        "dish_name": "Caramel Fudge Cheesecake"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Mousse Cake"
    }, 
    {
        "text": [], 
        "dish_name": "Key Lime Pie"
    }
]