[
    {
        "text": [
            "great <mark>Beef Taco</mark> but just be wary of what you order!  buche (stomach) and tripe (intestines) are not for me but some may enjoy them.", 
            "if i could give this place a negative number i would. after reading the other reviews on yelp, i was excited to try this place while in las vegas. the ordering process is confusing at best. one of the people in our party was so frustrated they  actually walked out the door  and did not order anything,i wish i had gone with them !!!  i wanted my tacos on flour tortillas but instead i got corn tortillas.  one was the pork taco and the other was beef. i took one bite from the <mark>Beef Taco</mark> and i swear this was not beef but the most disgusting taste i have ever had. i promptly spit it out.  daughter got a overpriced quesadilla which amounted  to a small piece of queso fried on a grill and slapped between two extremely small tortillas.  even the toppings were lame and were nothing, really.  if you want the worst , overpriced tacos on the planet- go here.", 
            "there are a lot of wild things that we couldn't translate on the menu.  we played it safe and went with spicy <mark>Pork Stomach Tacos</mark> and a <mark>Beef Taco</mark> and tostada which were great.  next time we will be more adventurous and order a bunch of items.", 
            "fuck! the line is hella long... imagine standing in line for 20 mins or more in vegas in the heat at a place that doesn't have ac and jacked up fans... \n\nhey, the line is so worth it!! oh. my. gawd....!!! i am a fan. it's so good i'd wait inline again.\n\ni felt like i was in mexico... very authentic.\n\ni got the chicken and <mark>Beef Taco</mark>. i ordered 10- 5 for me and 5 for my sister. we were starved! my nephew had aau basketball tournaments all day.\n\nonce you get in:know what you want. there are line for each option. \n\nnext time i am going to try their carne asada fries. mmm! \n\nminus a star for the long ass lines and hot ass spot!", 
            "great mexican food with a simple menu of 10-15 tacos $2/taco. we had el pastor tacos and <mark>Beef Taco</mark>"
        ], 
        "dish_name": "Beef Taco"
    }, 
    {
        "text": [
            "main foods: tacos with meat\n\nprice: $\n\ndate visited: april, 2015\n\nverdict: i did not know tacos can taste like gold.\n\nbe prepared to line for a long time cause this place is popular. there are separate lines for different types of meat so make sure you line up for the pork (my recommendation, but generally the longest line). the staff are extremely efficient though. best go if you're in town.\n\nadobada: this <mark>Spiced Pork</mark> reminds me of the taste of char siu (bbq pork in canto cuisine). the warm juice flows from the pork itself and fuses with the cold sauce; the pork is well spiced and prepared as it complements the crisp yet soft tortilla. the only complain: why the hell is this so small. i ordered 3 and still did not have enough of it. going to get more the next time i go to vegas.\n\ni lost my memory here i only remember this as one of the beef. (should be either suadero or cabeza) the beef is crispy and is a bit blander than the previous taco. but it serves as an excellent transition taco before the adobada"
        ], 
        "dish_name": "Spiced Pork"
    }, 
    {
        "text": [], 
        "dish_name": "Brisket (Beef Breast)"
    }, 
    {
        "text": [
            "this place is epic! i mean... they have seriously ruined street tacos for me forever. no where else i go will ever measure up to this place. i admit i only tried the spicy pork and <mark>Beef Head Tacos</mark>, but both were excellent. actually, the spicy pork ones were amazing as i had four of those and two <mark>Beef Head Tacos</mark>. plus, what really put this place over the top was they had orange bang and all the other bang products on tap! on tap! needless to say, i started to od on the frothy orange goodness of it. all and all, i can't wait to go back as this place is not only amazing for their food and drinks, but service to.", 
            "i can't believe i've never reviewed this place. been here a million times and everything is delicious! everydamnthang! adobada with that extra pineapple, <mark>Beef Head Tacos</mark>, fries..."
        ], 
        "dish_name": "Beef Head Tacos"
    }, 
    {
        "text": [
            "now you know a taco place is good when you don't have to always settle for carne asada. gordos has the best spicy <mark>Pork Stomach Tacos</mark>! and they're proud of it :) this has been the best taco i've had for a whole-in-the-wall place. the vibe is great too, from workers to customers. the place is crackin up until 4am. oh and best of all.. non stop refills on horchata", 
            "the best tacos in town, very affordable, and tasty.  i thought since moving from tucson  i was doomed to never find a taco like at taco tote. \n\nconfusing as heck on how to order but it goes as follows: \n\nthe line with the pork hanging on a spit is for pork adabado. \n\nthe line in the center is for tongue, brains, aka nasty bits that my friends who like their food a bit more \"authentic\" swear by. \n\nthen the last line where someone is making tortillas is for chorizo, steak, and probably chicken, but i always order the chorizo so no clue. \n\nthe staff speaks english, but they move fast so if you want no onions, no sauce, no avocado (and you're sick if you don't get the avocado)  speak quickly and clearly. they are super nice though and remade three tacos after my husband corrected them that he didn't want onions on his <mark>Pork Stomach Tacos</mark>.", 
            "what can i say about this place that people haven't already said?! as you can see by my frequent visits, i'm hooked on their tacos! i have tried their carne asada tacos and carne asada fries but nothing comes close to the tacos de adobada (spicy <mark>Pork Stomach Tacos</mark>). my bf says they taste just like the ones from tj!\nthe staff here is really friendly, they even have my order memorized (7 spicy <mark>Pork Stomach Tacos</mark>) and no they're not all for me! hehe\nmake sure you get a side of green onions and chilies and sprinkle them with salt....\nthink i might go there now! enjoy", 
            "best authentic tacos in las vegas - hands down.  they make the corn tortillas fresh - grabbing the masa and throwing that stuff right on the grill.  you can taste the freshness and care they put into every taco.\n\nthis place is packed at 10:30 on a saturday night (totally full) and for good reason.  their spicy pork taco is out of this world.  also really enjoyed the lengua (beef tongue).  \n\ni'm gonna have no problem driving from summerlin to this joint on a regular basis.  it's just that good.  \n\nfyi the line on the far right is for the spicy <mark>Pork Stomach Tacos</mark>, the middle is for brain and tongue, and the left one for everything else.  you order your tacos, get them, then go to the register.  piece of cake once you know the system.  the pork line is always longer than the others.", 
            "after a long night shift of yelping and eating nothing but tasteless diet popcorn i got off shift and my hubby asked if i wanted breakfast. of course i replied and we drove over to tacos el gordo and sat in the parking lot. we waited with several others till 9am when they opened their doors. (kinda sad but true!) \nthe place is clean and during our visit the staff was busy milling around cleaning an already spotless dining area. restrooms were also well maintained which was a good sign! \nbecause of the early hour, the pork adoboda was not ready so we each ordered a chorizo & carne asada taco and waited for the pork to be ready. \nthe chorizo taco was ok, the corn tortilla, made fresh before your eyes, was soft and flavorful. the chorizo was soft but not so tasty. i tasted more of the salsa and guac then the meat filling. the chorizo taco was ok but i wouldn't order it again. \nthe carne asada taco was my least fave. they use the less desirable cuts of meat and the presence of connective tissue and other non-meat parts was really kinda gross. \nthank god the <mark>Pork Stomach Tacos</mark> were ready. they were excellent. the pork was slightly sweet and spicy and the cool creamy green sauce and salsa they put on top complimented the meat perfectly. they were so good we ordered 2 more! you know the food is good when you eat in silence =) i would definitely return and order the adoboda tacos. the place had brisk business at 9am so you know the place is awesome!", 
            "went back and along with the spicy pork had some of the beef <mark>Pork Stomach Tacos</mark>.  i like the pork better but the stomach was solid.  this place just hits a home run every time.\nwas told by the nice cashier they are going to be opening up a location at the strip mall right next to encore.  it's on the strip and just past encore coming from venetian, bellagio, etc. heading towards stratosphere.\ngood  times.", 
            "this place is awesome! i'm from the bay area and i wish they had one of these places there because the spicy <mark>Pork Stomach Tacos</mark> are addictive!! the carne asada tacos are very good as well, probably the best i've ever had. give it a try. you wont be disappointed.", 
            "omg when i found out lv had a location i dropped to my knees! i've had this place in san diego! my friends were all raving about the spicy pork. i was thinking.. come on how good can it really be. i drove to sd and had to try it for myself. heavenly tacos being sliced up right in front of you. the pork is similiar to the vietnamese bbq pork that i eat at home. it's made with this awesome green sauce that's to die for. the corn tortillas are thrown on the grill and lightly cooked. you will not get tacos like this anywhere else. i recommend this place to everyone!\n\nrecommendation: spicy <mark>Pork Stomach Tacos</mark>.", 
            "tacos el gordo has several walk up windows, it's cafeteria style. they're known for adobada or spicy <mark>Pork Stomach Tacos</mark>. the pork is sliced off the rotisserie and topped with cilantro, onion, and a creamy cilantro guac sauce, and also pineapple if you'd like. they have carne asada, too, and more rare finds like tongue, head and tripe. all tacos are $2.\n\nthe adobada was good, but not spicy nor tasty enough to order a second.\n\nthe carne asada earned no stars, the meat had an odd flavor almost musty and the runny guac helped it none.", 
            "this place is the best!  excellent spicy <mark>Pork Stomach Tacos</mark>, the quesadillas are very good.  i love that they give you the grilled peppers.  very authentic food, so amazing, my husband makes me go once a month at least!", 
            "love this place! the spicy <mark>Pork Stomach Tacos</mark> are my favorite however, everything i've tried here (and i've had damn near everything twice) has been better than great.  the staff is friendly and the joint is always clean.  no wonder there are so many great reviews for tacos el gordo.  \n  it can get busy and it's frustrating waiting on a table when some folks want to take their time and not get the hell out but this by no means the fault of the restaurant, simply a testament to their success.", 
            "ok,ok, i know from my profile it probably looks like i'm throwing 5 stars out at will but i promise you this place is a 6 star gem! there are two things i could eat everyday and as non-foodie as it may sound they happen to be mexican food and ny style pizza. this place was hands down one of the best mexican spots i have been too!\n\nthe restaurant appears chain-ish at first glance and looks like nothing special. however, the charcoal smell looming over the parking lot is your first hint that you are in for the real deal.  the setup is order yourself, pay and eat; simple and perfect.  \n\ni apparently signed up for my own eating contest because i ordered 2 pork, 1 lengua, and 1 cow brain taco (don't know the spanish term..i can hardly ask for agua), annnd split the carne asada fries - unbelievable!  the <mark>Pork Stomach Tacos</mark> were hands down the best i have ever had!!  they are shaved right from a slab of meat as the orders roll in so it appears in strips as oppose to the chunks/cubes or \"flakes\" as you may be use to.  its appearance oddly reminded me of pork in a chinese restaurant. the lengua was fresh, tender, and just right. the cow brains, don't judge me,  i was trying for the first time. i thought them to be more tender and even better than the lengua!!  one aspect of the tacos that made them so good were the toppings they are loaded with the best ingredients and \"salsas\" which only my pics can properly describe.the carne asada fries (also have pork option) were amazing! they are very similar to mcdonald cut and tasting fries, which i secretly love, and the fresh cooked steak was nearly infused with smoke from the fresh charcoal grill it was cooked on. \n\nthis is not a hoity-toity mexican restaurant so keep that in mind when considering.  most of the places i frequent that have the best mexican you can get a few tacos and a pair of cowboy boots if you wanted.  they are hole in the wall places that dish up awesome food.  this is one of those places (minus the boots) and it is a must have if you are an authentic mexican lover like myself.\n\nenjoy!!\n\nkent", 
            "my husband and i went here twice because it was soo close to our hotel and it was so cheap.  the first time, we shared an order of carne asada fries for $10.  i had no idea what to expect, but it sounded interesting.  it turned out to be exactly what it sounded like.... french fries covered in grated cheese, guacamole and carne asada.  they were good but not really what i was looking for in terms of spice.\n\nthe second time we got the spicy <mark>Pork Stomach Tacos</mark>.  the pineapple on top was a nice touch.  they had great flavor and spice.  my husband got flour tortillas and i got corn.  we also learned to ask for peppers and onions on the side, which were free.  the people were friendly and helpful.", 
            "are you f*kn serious the spicy <mark>Pork Stomach Tacos</mark> are absurd the best taco i have ever had.  waited in line for 30 minutes but that was the strip location on saturday afternoon.", 
            "beyond the glitter and flash of the las vegas strip is a humble little taco joint tucked in an unassuming shopping center somewhere between wynn, encore and ross.\n\nin terms of ambiance this place is definitely lacking -- there are no pinatas, mariachi bands, or oversized margarita glasses in sight.  but as soon as you step up to the order counter you will be treated to a feast for the eyes.  a giant slab of sizzling pork on a rotating skewer with a giant pineapple on top, it's juices slowly basting the meat to delicious perfection.\n\nexcuse me, i just drooled on my keyboard.  \n\nback to my description -- after i placed an order for spicy <mark>Pork Stomach Tacos</mark> my order taker carefully sliced a few slabs of pork onto warm handmade corn tortillas topped off with fresh pico de gallo, crema fresca and a thin slice of grilled pineapple.\n\nit was truly the best taco i ever tasted and for only $2 i had lots of extra money to drop at the slot machines!", 
            "best tacos in vegas!! can't believe i'm eating these tacos in this city! these tasty tacos seem like i'd be driving to california or mexico for them. <mark>Pork Stomach Tacos</mark> are amazing! especially with the avocado sauce and all the fresh fixins! oh and if you like pineapple, ask for them on the <mark>Pork Stomach Tacos</mark>! you're welcome!", 
            "moments after landing i was whisked away by my cousin and his words are ... i know i am going to take you to some very fancy places to eat while your here, but the first place we have to stop to is this taco place. \nhe was very right we had the spicy <mark>Pork Stomach Tacos</mark> with the fried peppers and green onions on the side. this was the perfect start to my trip to vegas. i also loved the horchata (the rice milk drink) and it was the best i ever had. \nif your going to las vegas i would make sure to give this place a try.", 
            "i came here on a thursday afternoon and ordered 2 spicy <mark>Pork Stomach Tacos</mark>, horchata and shared carne asada fries for 8. \n\n- best tacos i've ever had! soo good! must come. \n- spicy pork is awesome. they slice it right in front of you and put this delicious sauce! drool ~____~\n- carne asada fries are huge. a bit expensive, 10 for a large, so you have to share. a large in socal is a bit less, 8. lots of guacamole. :)\n- security has a gun! gangsta....", 
            "a tad overrated.\n\nis it delicious? yes. is it muy autentico? good question. i've been to mexico a few times and the food that the locals eat away from touristy areas seemed more gringo-ish than this. \n\ni will say that once you wait in line for 15 minutes and then pay way too much for street tacos, you are treated to spicy pork deliciousness. however, i think $2 each for small tacos and long lines with little seating is too much for me to give tacos el gordo 5 stars. \n\ni took a buddy who i thought would like it and he wasn't impressed at all. same complaints as me. too long of a line, fighting for a seat, too expensive for what it is. but damn, those spicy <mark>Pork Stomach Tacos</mark> are good.\n\ntip-if you are really hungry, order the fries and two tacos=tons of food for $14.", 
            "what can i say that hasn't already been said in the myriad of reviews of this place?  i come here as often as i can for one item only - the adobada tacos. they are uh-maze-ing!   the carne asada tacos are pretty good as well but the flavor compared to the spicy pork (adobada) pales.  come here, order some spicy <mark>Pork Stomach Tacos</mark>, thank me later.", 
            "came here on a friday night, the wait was not long at all. i ordered 2 spicy <mark>Pork Stomach Tacos</mark>. and my fiance ordered a half order of the adobada fries. this totaled to just under $10. \ni watched one of the workers shave the pork right onto the tacos. they were very flavorful. the pork was juicy with a slight crisp to the outside, so good. \ni didn't try my fiances fries but he ate all of it so i'm pretty sure he loved them.\nwill definitely come back.", 
            "i loooove this place. tacos el gordo, by far, has the best tacos in las vegas!!! i absolutely love the spicy <mark>Pork Stomach Tacos</mark>; don't get just one cause you'll be back in line asking to order another one. the price is also extremely reasonable which is definitely a plus.", 
            "the best tacos in the area hands down! you can tell by the line this place is good and definitely worth the wait. the green sauce they put on the spicy <mark>Pork Stomach Tacos</mark> is out of this world good! i cant give this place enough stars!", 
            "there are a lot of wild things that we couldn't translate on the menu.  we played it safe and went with spicy <mark>Pork Stomach Tacos</mark> and a <mark>Beef Taco</mark> and tostada which were great.  next time we will be more adventurous and order a bunch of items.", 
            "the marinated <mark>Pork Stomach Tacos</mark> are the best i have personal ever had hands down.  still not a fan of there decision of having split lines for different tacos, but its worth it!", 
            "my first stop once i get my car rental is taco el gordo. win or loose in vegas this place gets a minimum of 3 visits during a 5 day trip. the <mark>Pork Stomach Tacos</mark> are out of this world. i feel like i am in mexico from the first to last bite. i would give this 10 stars if i could. thanks for making this a must whenever i go to vegas!", 
            "best tacos i've ever had. hands down. get the <mark>Pork Stomach Tacos</mark>."
        ], 
        "dish_name": "Pork Stomach Tacos"
    }, 
    {
        "text": [
            "i will start off by saying that tacos el gordo is extremely clean for a mexican restaurant, and i say this with all my love for mexican restaurants and mexican food. \n\nnow that we got that out of the way, the tacos are pretty amazing.  i had the lengua (tongue) tacos, and i must say they were probably the best <mark>Beef Tongue Tacos</mark> i have had by far, and i have had quite a few lengua tacos.  the tongue was prepared to the almost-perfect texture, and as my dining companion has described it, the tongue \"was clean\" - pure tongue meat. \n\nand, of course, the adobada tacos were also very delicious.  the grilled pineapple highlights the flavors of the meat and becomes a pleasant surprise in the mouth.  \n\nwe also had the carne asada, which i thought was quite tasty; however, it was not spectacular.  \n\none thing about tacos el gordo is that it is a bit pricey compared to its competition.  at $2.50 a pop for the lengua taco, it is definitely on the high-end side.  \n\nthen again, you get what you pay for!  me gustan tacos!", 
            "some of the best tacos i've ever had were in mexico- playa del carmen. since then i thought nothing could compare to the real deal.\n\ni was so wrong.\nsome friends took me here, and i was so surprised by the flavor and tenderness of the tacos al pastor. i've heard the <mark>Beef Tongue Tacos</mark> are good, but i'm not gutsy enough to try it. \n\njust stop by and grab a couple- they're my favorite tacos in vegas.", 
            "walking into this joint you might be a little overwhelmed at first (especially if you go when they're busy), but don't fret your pretty little head, you got this. the meats are ordered in different lines, so if you want to sample more than what's offered in one line it helps to have a friend to wait in another line for you. the advantage to this is that by streamlining the ordering and preparation process the lines do tend to filter through reasonably quickly so even if you go alone it shouldn't take terribly long. \n\nthe adobada is without a doubt my personal favorite, it's hard to go wrong with grilled pineapple and smokey & sweet seasoned meat but most of their tacos are delicious, well seasoned/sauced, and interesting. the <mark>Beef Tongue Tacos</mark> are also quite good. definitely get yourself some grilled green onions and peppers, which are yet another line but usually quite short.\n\nsit underneath the stuffed cow head for good luck or to contemplate cows and stuff while stuffing your face with cow...or pork...\n\nalso had a guy mention this place while out at another restaurant with my boyfriend. the man claimed to be originally from mexico and said that these tacos were the most authentic in town. i don't know the veracity of his claim, but sounds good.", 
            "this place is dabomb.com! i always order the al pastor tacos and eat a few bites of my husbands cow <mark>Beef Tongue Tacos</mark>. (the cow tongue is extremely tasty, but i can't get rid of the mental barrier enough to eat whole ones). we've tried random taco places and vendors around town, and none of them are as good as this place so we keep returning. my husband lived in mexico for a few years and even said these are the closest to authentic he's been able to find. you can get flour tortilla's instead of corn if you just ask.", 
            "i love greasy <mark>Beef Tongue Tacos</mark>. i love them on occasion and sometimes on sundays. \n\ni love <mark>Beef Tongue Tacos</mark> and that is all i will ever order from here. it's not to say that i wouldn't have anything else- it's just that my diet doesn't allow for so much grease...so when i come to a taqueria i make sure i get as slippery as i can *sssslurrrp*!!! \ni get my tacos as fast as i would get them in the heart of mehee-co..\n\ni love beef- gimme that beef tongue in between two tiny corn tortillas...con pico y mucho cilantrrrrro. omg <mark>Beef Tongue Tacos</mark> for days! it will be a while until i have another slimy and onion crunchy tongue taco but that day can wait....\n                                                                           i prefer to keep my girlish figure...anyways. get your tacos come and get your <mark>Beef Tongue Tacos</mark> (or whatever it is you may want..) come and get your sugar packed horchata...get it here...get it now!! ay ya yay (i'm allowed to do this...i have proof)", 
            "if you have never been here and are having trouble with the menu i suggest you start off by listening to pitbull song. cabeza, lengua and other cow body parts can easily be explained through him. some head and <mark>Beef Tongue Tacos</mark> never sounded too bad! :p\nif the thought of eating these things disgust you, do not be afraid and just try it! it is not as bad as you think! i was so happy to know that the \"guac is not extra\" here! the unfortunate part is that the food is actually pretty descent, but what is up with the guacamole! it looks and tastes like green paste! c'mon! :p"
        ], 
        "dish_name": "Beef Tongue Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef Guts Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef Brains Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef & Pork Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Azteca Taco - Beef & Cactus"
    }, 
    {
        "text": [], 
        "dish_name": "Fries"
    }, 
    {
        "text": [], 
        "dish_name": "Mulas"
    }, 
    {
        "text": [], 
        "dish_name": "Quesadillas"
    }, 
    {
        "text": [], 
        "dish_name": "Sopes"
    }, 
    {
        "text": [], 
        "dish_name": "Tostadas"
    }
]