[
    {
        "text": [
            "where have you been all my life??!?!\n\ni'm from a state where real tacos like this doesn't exist. taco bell?? screw that!!\n\nthis place is amazing!! cow tongue taco?? spicy pork taco?? cow stomach taco?? regular <mark>Beef Taco</mark>?? amazzing!!! but don't try the cow brain taco....yeah..it's not that great. but all the other stuff, aaamaazing!!!!!!!!!\n\nand so cheap!! only $2 per taco?? that's insane! i'm so excited thinking about this place, i wanna go back.\n\ni will go back!!", 
            "3 1/2 stars. \n\nmy gf mentioned this place so we decided to check it out on sunday before we headed back to la. parking is pretty big and the line was even bigger. menu is pretty simple. interesting was that the line forms in 4- 5 different sections. if you want pork then there's a line section just for pork, and same for beef and so on. it can get a little hectic and kind of sucks because you have to keep getting in different lines just to get a  few things. the pork line was pretty fast, my gf waited in the beef line for at least 30 min or more. \n\n_taco de adobadas (spicy pork taco $2.00) the most popular and the best! they slice the pork real thin right in front of you. the pork isn't too spicy but just enough flavor. the green sauce gives it a nice little kick and sweetness. add some lime on top and it's the perfect bite. i could have had 3 of these.. oops already happened!\n_taco de asada. (steak taco $2.00) i'm never a huge fan of <mark>Beef Taco</mark> because normally the beef comes out dry, but i thought this place may be different. turns out i was right. the beef was a bit dry and after eating the pork taco the beef just did not cut it for me. i wish they added more guacamole sauce.\n_taco de suadero (beef shoulder $2.00) the beef shoulder was a bit juicier than the steak taco.  i would pick this over the asada but still the pork is the best!\n_carne asada fries ($10) huge portion. we shared this with myself and 3 other girls. it can get quite heavy and rich but so hard to put the fork down. i would do the adobadas fries instead. \n_adobadas tostada. ($2.00) this was pretty good. the crunch factor from the tortilla was nice and the pork was again amazing! \n\ni would come here again just for the spicy pork taco and would like to try their sopes. i'm more of a fish taco person so don't go all crazy on me on my rating :) btw great place to eat after a hangover.", 
            "i went through 3 different emotions from the moment i placed my order to when i received my order. first i saw the prices. $2 tacos, $4 burritos, $10 for combos. yay, cheap food!!  so i ordered one <mark>Beef Taco</mark> for $2 and one beef burrito for $4. next i saw the portion. the burrito wasn't a \"burrito\" i am used to eating. so i was a little confused. and i thought the portion was so small. once again, not what i am used to. so sadness came over me. i sat down to eat my meal. omg, these people know how to make tasty mexican food! pure joy and happiness began to take over any past emotions. the food was very tasty. and it turned out the portion wasn't small at all. i got full on just those two orders. the point is, this place is awesome! sooo good! 4 stars instead of 5 because they don't give you utensils when dining in. i literally sat down and had to get up again to find the forks. and it was so crowded in there, getting the fork wasn't easy. i saw that most people were eating with their hands. but they should offer utensils during when the customer is up at the register paying for their meal. i don't mind eating with my hand but when i've been sightseeing all day, i know i do not want to touch my food with my dirty hands. hence why they need to automatically offer utensils rather than assuming the customer will locate the utensils and take one.", 
            "the line was crazy when we came here on the thursday night before edc weekend. you have to order different tacos at different sections of the restaurant. the first line to the left when you enter the doors is for <mark>Beef Taco</mark>, the line on the right next to it we got the spicy abodaba taco, on the corner of that on the right is the lengua taco, and then the carne asada fries on right of that section.  confusing but you'll probably see it when you enter the restaurant. we ordered half a carne asada fries and it was definitely enough for two people along with 3 lengua, 1 beef, and 1 adobada taco. the tacos ranged from $2-2.50 and the half of carne asada was only $5. we also ordered a horchata which was good too! seatings are outdoors and we found seats pretty quick but it was so humid sitting outside. will be back since it wasn't too expensive compared to other restaurants on the strip.", 
            "we went on sept. 4 thursday evening. it was our first time. \na bit confusing with different lines you have to stand in base on what you want. \nwe asked the cashier and she explained it well. \nyou can pay ahead of time or pay after you order and get your food. it's $2 a taco. \n\nwe got the <mark>Beef Taco</mark> (carne asada)- it was okay. maybe overly cooked, kind of chewy.  not memorable.  3/5 stars.\n\nwe also tried the park tacos (adobada)- mmm... taco heaven. tender. they refer to it as spicy pork but it's not spicy. the taco tasted amazing. you can have pineapple on the side or on it. same for the cilantro.  throw some lime on it and boom ...5/5 stars! \n\nwe didn't try the other items. \nwe highly recommend the <mark>Pork Stomach Tacos</mark>. went back again just for them on sunday sept7 evening.  the second time we went, they were cooking the pork at both stations and had to wait 10mins. this was around 6:30pm. both evenings the line up wasn't too long. \n\nnegative- most of the cooks were wearing hats. one was wearing a hair net.  it can get pretty hot and they were working hard. lots of sweat. with the cook sweating that much on his face, it was not appealing to fear lots of the sweat dropping on to the meat as he was chopping it up.  our cook wiped the sweat off his face twice when it looked like it was going to drip on to the food. luckily none did. but a bit hunger killing seeing that. \n\ndefinitely will be back."
        ], 
        "dish_name": "Beef Taco"
    }, 
    {
        "text": [], 
        "dish_name": "Spiced Pork"
    }, 
    {
        "text": [], 
        "dish_name": "Brisket (Beef Breast)"
    }, 
    {
        "text": [
            "pure delicious awesomeness. where else can you get cow tongue, brain, and <mark>Beef Head Tacos</mark>? don't worry, they also have excellent (normal) beef and pork options. very nice people too. when i was told that they don't have tamales, a sweet employee even gave me one of hers that she brings in for her fellow coworkers. skip the overpriced casino eateries and grab a couple of tacos for just $2 each (and you might even get a free tamale).", 
            "sorry to all of the people who rave about this place, but it's exceedingly overhyped. \n\ni was actually really looking forward to this place and had high expectation for what was popular which was the adobada and carne asada. since there was 2 lines to order, i told porky to wait in the asada line while i wait in the adobada line. i made the big mistake of trying to make an order to a wab without porky there. i asked for a big adobada fries without cilantro and he replied ok. i waited there for about 10 mins....\n\nmy bf already got his order and finally, he asked the wab where my order was in spanish and he replied that i never made an order with him, putting the blame on me, and trying to make me look stupid.. gtfo -_- i finally got my fries and i went up to the cashier. without realizing it, the cashier girl gave me an attitude and my bf had to defend me telling them that i'm paying for the fries and he's paying for the tacos since i don't know spanish and i didn't understand the situation. how rude! i do not appreciate the fact that i was being put down for not understanding any spanish when we are in a country that english is the primary language, especially from people who sound like they don't even have their citizenships!! *slam fists*\n\nin any case, on to the food. i looked at my food and i specifically asked for no cilantro, and of course they would fuck it up by leaving little pieces of it all over our food. i don't mind the cilantro but porky hates it. -1 point there for making me put the effort of playing hide and seek with the cilantros. the carne asada was ok. the meat was tender and juicy but bland. the only thing you could really taste in it was the guacamole since they slapped on a handful of it on the taco. the adobada tacos had no flavor whatsoever. i read that there was some pineapples sliced in it, the sauce was amazing but i did not taste anything on that taco. the best ones i have had was the stomach and the shoulder. i should have fought porky more for the brain, tongue, and <mark>Beef Head Tacos</mark> since they were all cooked in the same way as the shoulder and stomach, but i gave in since porky was so adamant about not trying anything else. never again will i let his closed mind affect my choices in food! anyways, the fries were awesome! i love the sauce in it and the fries were the thin and crispy ones, not those disgusting steak fries. i just wish i got the carne asada instead because the adobada was flavorless and dry.\n\nanyways, i really want to like this place because i want to come back and try the other tacos, quesadilla, and tostada but i wouldn't want to come back here by choice because of the rude workers and there's nothing really special about their popular stuff. 2 stars for their stomach and shoulder tacos and fries!", 
            "\" the carne asada tacos and the adobada tacos are bomb here!\" \" those are the best tacos i've had\" please......\n\nall i could hear from my friends is them talk about this place n san diego.  how good the tacos are and what not.  they found a las vegas location and insisted we go when we got there on our vegas trip this past weekend.\n\narriving at the restaurant, the employees wanted us to make two lines ( for the beef and the pork meat ).  my gf said lets split up in the lines so we could get our orders.  we decided to order:\n\n1 taco of shoulder meat\n1 taco of stomach meat\n1 taco of carne asada\n1 taco of adobada meat\n1 order of adobada fries\n\nthe employees gave me a bit of an attitude until they forced me to speak spanish.  they gave me my orders and went to the gf to check on the fries.  she was still waiting for the order and said they were taking a bit long.  i talked to the cook there and he was like she didn't order anything and putting her down.  i switched back to spanish mode and told him to make the order ( with an attitude ). if that wasn't enough, the cashier girls were giving my gf attitude when she was paying because they couldn't understand that she was paying for the fries and i was paying for the tacos.  back to spanish mode, put them down, explained to them in a way you explain a 5 year old how to do things because obviously these people came from tijuana yesterday and think they can give customers attitude when they themselves can't understand english in the us.  really pissed me off that these immigrants like to talk smack in spanish when you don't speak spanish.\n\ngoing back to the food, i had my eyes set on the carne asada tacos and adobada ( since everyone is ranting about them). i couldn't be more disappointed in the flavor of the meat.  the asada taco's meat was tender, but really bland.  i guess cause its so bland, they smacked so much guacamole on the taco to make up for the flavor ( which made it worst).  the adobada taco meat was really dry and no flavor either!  what was the hype about??  surprisingly when we were tasting the stomach and shoulder tacos, we were like ok that's pretty good.  the shoulder taco was kinda like carnitas style with some of the broth it was cooked in.  the stomach taco was not all chewy and nasty texture.  had some of the broth that it was cooked in as well.  these two tacos were the best ones out of the others, how ironic ha ha.  i think the brain, stomach, head and shoulder meat is all cooked in the same broth.  the fries were pretty good too.  they were thin, crispy fries smothered in some salsa they make there.  personally me, that salsa was ok but too much on it.  again, the adobada meat did not help the fries.  you might want to eat the fries as soon as you can or else they will become soggy from the overload of salsa they put in.\n\nthis place really did not live up to the hype.  rude employees, flavorless meat and expensive tacos.  i would have given this place a 1 star, but the shoulder and <mark>Pork Stomach Tacos</mark> managed to change my mind.  i would like to try the <mark>Beef Head Tacos</mark>,brain tacos, tostadas and quesadillas next time, but i feel like it wont be for awhile since it would have to be because friends wanna go and has to be the san diego location.  if the san diego location is just as bad with the immigrant workers and attitudes they give, i will gladly say i'm done with this restaurant. never again....", 
            "awesome tacos! i was one of three white guys in the place and i was wondering what some of stuff on the menu was. if you squirm when out of your comfort zone, this may not be for you...as the beef tongue and <mark>Beef Head Tacos</mark> spanked the pork taco!  ps. it is only the asada line that is to the left...i finally figured that one out.  everything else is available in the right-side line. i could have gone here everyday i was in las vegas. i hope to get back.", 
            "i was really looking forward to this due to all the great reviews and also because, after days of paying for $25 dollar entrees, my wallet needed a break big time.  \n\nmaybe they were having a bad day (i notice another 1 star reviewer went the same day i did).  quite simply, the food was inedible.  first off, this is a place that loves their organ meats.  no fish or chicken tacos here so keep in mind that choices are very limited if you don't like tripe, brain, tongue or <mark>Beef Head Tacos</mark>.  that's ok, we went for the carne asada fries, abodabo and spicy <mark>Pork Stomach Tacos</mark>.  fries looked awesome.  first bite....my mouth filled with fat/gristle/tendon.  ick.  i'm a good sport, tried another bite.  huge piece of fat.  one more bite.  same thing.  moved on to the abodabo taco.  first bite.   fat.  i wasn't dumb enough to try another bite.  spicy pork taco next.  no fat but no flavor either.  \n\nso yeah it was only $20 for me and my husband to \"eat\" but neither one of us actually got to swallow any of it.  have not had this horrible of a restaurant experience in years.  i'm left wondering, did i truly go on an off day or do regular folk just love fat filled tacos?  i'm certainly not putting out another $20 to get an answer to that one.", 
            "excellent tacos, but adobada and <mark>Beef Head Tacos</mark> called my attention !!!\ndecent price at $2 dollars most tacos. plenty of meat.\n\nonly disappointment is that you have to order separately your tacos (eg. asada, adobada, chorizo, etc,and make line separately for different meats, thus first tacos ordered will get cold before you get all your order together,,,,,,, otherwise i'll be perfect !!! \n\nworth coming back ... best tacos in vegas  !!!!"
        ], 
        "dish_name": "Beef Head Tacos"
    }, 
    {
        "text": [
            "today i went on a food tour around town ...  and i first went to a shanghai restaurant and this place is the second spot i stop in .... gotta tell ya it was just so good ...i ordered a cow brain taco, a pig <mark>Pork Stomach Tacos</mark> and one carne asada taco .... the cow brain i dont really recommend it ,wish they coulda doing somethings better with the brain other than just boil it .... but the pig stomach and the carne asada was so good with grilled scallion and fried jalapeno and their salsa ....", 
            "the spicy pork taco was the bomb diggity yo for real!! the carne asada is also yummy, one of the better ones we have had.  we were pretty lost on the line/ordering process, and might have cut a few people shuffling around to get our tacos, but they churn them out so fast, no one got too screwed over by our newbee butts.  the grilled peppers are great along side the tacos.  my only complaint is that the guy doing the <mark>Pork Stomach Tacos</mark> didn't help explain where we needed to order the rest, so we kept asking for our carne asada from him... basically he helped us look even more silly :)", 
            "best tacos ever. period. the manager or owner was very welcoming. he gave us free samples of all the different meats. i was very pleasantly surprised by the pork stomach and the cow tongue. the spicy <mark>Pork Stomach Tacos</mark> are a must. they are cooked on a rotisserie like a gyro yummy", 
            "this taco spot is legit especially in the heart of las vegas.  i can't believe i never seen this place, maybe because i'm always stuck at palazzo gambling.  i do recommend there spicy <mark>Pork Stomach Tacos</mark>.  they even have hardcore security guards on busy days to keep the business running.  they were nice though.  there are separate lines for what type of meat you want.  and i know the spicy pork line is always the longest.  tacos are 2 bucks and carne asada fries are 10 bucks.  i had 4 tacos and i was satisfied.", 
            "spicy <mark>Pork Stomach Tacos</mark>!!!\n\ngreat street tacos, $2 a piece.", 
            "very good carne asada tacos. i went on may 5th to  celabrate the  mexican holiday. the whole 2 line thing is a little weird,but the staff was very helpful. i can't wait to go back and try the spicy <mark>Pork Stomach Tacos</mark>.\n***update-i went back a few days later and tried the spicy <mark>Pork Stomach Tacos</mark> .they were awesome i can't stop thinking about them. i could eat them all day every day .i have a new addiction and my body craves them.", 
            "wow! this place was absolutely amazing the spicy <mark>Pork Stomach Tacos</mark> were great.  i highly recommend the sopes with the spicy pork or carne asada they were unbelievable with the cooked onions and the jalapeno peppers, definitely the best mexican taco joint i've ever been to.", 
            "quick tip: the line on the  middle right is for <mark>Pork Stomach Tacos</mark> only but you can still get carne asada fries there and believe me folks, you want those fries. \n\nsome people have acid flashbacks, i had a taco flashback to being 18 and partying it up in rosarito beach and eating a delicious drunky taco. 100%, totally, undeniably legit <mark>Pork Stomach Tacos</mark>. i love that people say that the carne asada fries are \"really big, enough for 2-3 people,\" yeah or enough for one drunk person at 3am. \n\nwe came on a monday at 2pm and the line went out the door. be willing to wait, your taste buds will thank you for it.\n\ntwenty bucks will buy you four tacos, one carne asada fries and two drinks. where else in vegas will you eat this good for that cheap? that was a rhetorical question.\n\nlast note: leave the staff a tip, they work their asses off and do it with a huge smile.", 
            "why come here? because they spit roast and carve their <mark>Pork Stomach Tacos</mark> to order\n\nstrolled thru lunchtime last saturday and the line was going out the front door, so many ppl gotta make sure your standing in the right line, i came here for the adobada (pork) and luckily i stood in the right line, the middle, the left is for carne asada and the far right is for everything else, brains, guts, and quesadillas etc....\n\nordered 3 of the <mark>Pork Stomach Tacos</mark> at $2 a piece, everything includes cilantro, onions, and two house made sauces, hot sauce and crema, extra fixings you gotta hit the side bar yourself if you want radish and any other sauces\n\nthe tacos were all the hype, freshly grilled, crusted edges, juices running into the tortilla which by the way were heated simultaneously under the spit and picked up when your order is carved, to top it off, you get a slice of the that pineapple roasting on the top of mt. meat, all good, btw if you want roasted onions and peppers i think you gotta ask for it\n\ninside/outside seating, open 10am to 5am daily, parking is hit or miss (on the strip), park in the lot around the corner\n\na must try if your into cheap eats, especially in vegas", 
            "\" the carne asada tacos and the adobada tacos are bomb here!\" \" those are the best tacos i've had\" please......\n\nall i could hear from my friends is them talk about this place n san diego.  how good the tacos are and what not.  they found a las vegas location and insisted we go when we got there on our vegas trip this past weekend.\n\narriving at the restaurant, the employees wanted us to make two lines ( for the beef and the pork meat ).  my gf said lets split up in the lines so we could get our orders.  we decided to order:\n\n1 taco of shoulder meat\n1 taco of stomach meat\n1 taco of carne asada\n1 taco of adobada meat\n1 order of adobada fries\n\nthe employees gave me a bit of an attitude until they forced me to speak spanish.  they gave me my orders and went to the gf to check on the fries.  she was still waiting for the order and said they were taking a bit long.  i talked to the cook there and he was like she didn't order anything and putting her down.  i switched back to spanish mode and told him to make the order ( with an attitude ). if that wasn't enough, the cashier girls were giving my gf attitude when she was paying because they couldn't understand that she was paying for the fries and i was paying for the tacos.  back to spanish mode, put them down, explained to them in a way you explain a 5 year old how to do things because obviously these people came from tijuana yesterday and think they can give customers attitude when they themselves can't understand english in the us.  really pissed me off that these immigrants like to talk smack in spanish when you don't speak spanish.\n\ngoing back to the food, i had my eyes set on the carne asada tacos and adobada ( since everyone is ranting about them). i couldn't be more disappointed in the flavor of the meat.  the asada taco's meat was tender, but really bland.  i guess cause its so bland, they smacked so much guacamole on the taco to make up for the flavor ( which made it worst).  the adobada taco meat was really dry and no flavor either!  what was the hype about??  surprisingly when we were tasting the stomach and shoulder tacos, we were like ok that's pretty good.  the shoulder taco was kinda like carnitas style with some of the broth it was cooked in.  the stomach taco was not all chewy and nasty texture.  had some of the broth that it was cooked in as well.  these two tacos were the best ones out of the others, how ironic ha ha.  i think the brain, stomach, head and shoulder meat is all cooked in the same broth.  the fries were pretty good too.  they were thin, crispy fries smothered in some salsa they make there.  personally me, that salsa was ok but too much on it.  again, the adobada meat did not help the fries.  you might want to eat the fries as soon as you can or else they will become soggy from the overload of salsa they put in.\n\nthis place really did not live up to the hype.  rude employees, flavorless meat and expensive tacos.  i would have given this place a 1 star, but the shoulder and <mark>Pork Stomach Tacos</mark> managed to change my mind.  i would like to try the <mark>Beef Head Tacos</mark>,brain tacos, tostadas and quesadillas next time, but i feel like it wont be for awhile since it would have to be because friends wanna go and has to be the san diego location.  if the san diego location is just as bad with the immigrant workers and attitudes they give, i will gladly say i'm done with this restaurant. never again....", 
            "located in a strip mall next to the encore, there is limited parking, but most people walk to this location.  it's very busy and you need to be experienced to get what you want. it's like the seinfeld soup nazi.  you have to know what line to get into for which type of food.  one line for asada, one for spicy pork and a line for the rest.  so, if you want one of each, you need to get into three lines. \n\ni had 4 spicy <mark>Pork Stomach Tacos</mark>. the meat is on the spindle like gyro meat.  it's got good flavor and they give you a lot of meat on two small street taco tortillas. they also have some homemade sauces and garnishes that make them really good.  i think they make the tortillas on the premise because i see them making them, but i can't be sure the ones i ate were from that same process.  i can't see them making every tortilla because they sell a bunch.  there is some seating indoors and a lot of table outdoors under a canopy.  i don't think i would make a special trip to eat these. i would wait in line if i happened to be the area.", 
            "came here after lounging at tao beach all day. between my sister and i, we ordered:\n\n3 lengua tacos\n3 spicy <mark>Pork Stomach Tacos</mark>\n1 campachana fries\n2 coke zeros--you know, cuz we're trying to watch our figures.\n\ni loves me some pork so of course i ordered the adobado (sp) tacos for myself. i thought they were really good, however i don't think they are as good as the al pastor from tacos mexico. the ones there come very greasy and seemed to be slow cooked amongst ingredients such as onions that you can clearly see on the taco (aside from the toppings). i love the greasy, juiciness of that type of marinated pork. it seems i've only been able to find them at tacos mexico.\n\nanyhow, my sister and i swapped a taco and that lengua taco on my lengua blew my mind! so tender and juicy! i already thought i discovered the best lengua tacos in town (super b burrito) over by eastern and st rose so i didn't have high expectations. god, i love it when i'm proven wrong in that sense.\n\nthe campachana fries were delish with half of it topped with carne asada and the other with the spicy pork. all in all, great food especially after sitting under the sun getting drunk. the restaurant was very clean, as well as the bathroom. i can't wait for my next excuse to be on the strip so we can stop by again.", 
            "gross!! where do i begin. i was hoping for some awesome food. my homies from work had mentioned about going here. i decided to finally give it a try. they said delicious and huge stuffed tacos. cool, im a taco kind of guy. you walk in it a normal place. old style fast food kind of place. the menu is basic, tacos with different kinds of meat. i saw meats i wouldn't touch but knew enough to choose the carne asada, spicy pork, and <mark>Pork Stomach Tacos</mark>. staying away from the tongue and other things that are scary and gross tasting to me lol. anyways, i get my order, pay and get a drink. i should of figured something was up when one of my tacos was covered in foil. i sit down and start on the carne asada taco. pretty decent, mild flavor and hardly any fat. the onions and cilantro was fresh and the salsa was tangy. cool, im thinking maybe the spicy pork taco should even be better. it to was decent. nothing spicy about it. it was more colored pink as an illusion to spicyness i guess. kinda bland in flavor. im starting to think that this place isnt as good as my friends said. especially for the price of a couple bucks per taco. which are small and not worth the price. they werent even stuff like the name claims lol. i take off the foil to the last taco. its the pork taco so i thought. it was fatty, smelt weird and had greyish chunks in it. the texture looked like some kind of sea creature. i asked an employee is this pork? not pork tonuge or kidney or some strange animal part, just is this pork? she said yes. i took a piece of the so called pork and took a small bite. thats not pork!! if it is, they have some nasty ideas what pork is. i think some health inspectors need to investigate and see what they are selling as meat, especially the pork. eat at your own risk, this is one place i will never, ever go to again!! until next time, let's eat!!", 
            "went by here twice.  both times i tried the steak and <mark>Pork Stomach Tacos</mark>.  these were very fresh, and tasted pretty good.  for $2 a piece, it's hard to go wrong with these.  definitely worth a try.  there's always a line.", 
            "after reading the reviews prior to arriving in vegas i knew i just had to try this place.  spicy <mark>Pork Stomach Tacos</mark> cut right from a giant hunk of meat that stares you in the face?!??!?! uhhhh, yes please!\n\nwent here around 9:30pm on a thursday night and it was effing packed.  i knew it was a good sign when i saw a ton of mexicans and a security guard packing a real gun.  tacos are serious business!\n\ni ordered 3 tacos.  i got the adobada (spicy pork), lengua (tongue) and carne asada tacos.  all 3 tacos were very good, though i was probably the most disappointed with the adobada.  it wasn't that it wasn't good, but there just wasn't a lot of meat in the taco.  the meat that was in there was good, but that particular taco looked a little sad.  i did enjoy the free guac topping on the carne asada taco.  the lengua was cooked very well done and i thoroughly enjoyed that taco as well.  \n\nall in all, i'd give this place a solid 4.5 stars.  if there was more adobada in my taco i would definitely give this place 5 stars.  it could've just been bad luck with that particular taco.  \n\nif you want good tacos, definitely try this place out.", 
            "i know this is redundant, but the spicy <mark>Pork Stomach Tacos</mark> are out of this world.  the meat is slow cooked and shredded in front of you, while the cook behind the counter slightly fries two corn tortillas and preps the taco for the meat.  the contents are the complimented with a dressing similar to the cilantro ranch served at cafe rio.  there are also other vegetables and a spicy chile sauce to boost.  for $2, you absolutely cannot go wrong.", 
            "i was really looking forward to this due to all the great reviews and also because, after days of paying for $25 dollar entrees, my wallet needed a break big time.  \n\nmaybe they were having a bad day (i notice another 1 star reviewer went the same day i did).  quite simply, the food was inedible.  first off, this is a place that loves their organ meats.  no fish or chicken tacos here so keep in mind that choices are very limited if you don't like tripe, brain, tongue or <mark>Beef Head Tacos</mark>.  that's ok, we went for the carne asada fries, abodabo and spicy <mark>Pork Stomach Tacos</mark>.  fries looked awesome.  first bite....my mouth filled with fat/gristle/tendon.  ick.  i'm a good sport, tried another bite.  huge piece of fat.  one more bite.  same thing.  moved on to the abodabo taco.  first bite.   fat.  i wasn't dumb enough to try another bite.  spicy pork taco next.  no fat but no flavor either.  \n\nso yeah it was only $20 for me and my husband to \"eat\" but neither one of us actually got to swallow any of it.  have not had this horrible of a restaurant experience in years.  i'm left wondering, did i truly go on an off day or do regular folk just love fat filled tacos?  i'm certainly not putting out another $20 to get an answer to that one.", 
            "a definite stop when i'm in vegas. i've been here on my last 3 trips to vegas and i've never been disappointed. the meat is extremely juicy and tasty and the toppings are delicious!\n\nwhat we've tried:\n\n- carne asada fries: delicious! the carne asada here is insanely tender so these fries are a lot more satisfying than the carne asada fries back home.\n- carne asada tacos: i love that these tacos come with guac and pico de gallo! \n- lengua tacos: my favorite!!! the lengua is the best meat here! so tender!\n- spicy <mark>Pork Stomach Tacos</mark>: i like the creamy sauce that compliments the meat. and of course, the meat is tastyyyy. yum!\n\noverall, i really love the fact that the sauces are all different for each type of meat that i've tried.\n\nfree refills on drinks which includes horchata :) mmmm.", 
            "simply put, the best street tacos in las vegas!\n\nthe minute you walk into this place you will notice it is insanely busy, and that most people are on the pork line-- because it is the best item on be menu. don't get me wrong, steak is also tasty, but the pork is excellent on any menu item. here is what i normally order.\n\ncampechana fries, half order. these fries are smothered in steak or pork, cheese, cheese sauce, guacamole, sour cream and their special sauce... virtually a food group of its own. beware you can probably share your fries with three of your friends and still eat plenty.\n\n<mark>Pork Stomach Tacos</mark>: i get them with everything and a bit extra of their green sauce--a cilantro based sauce.\n\nmulitas on flour tortillas: there are topped with the same ingredients as the tacos but the ingredients are sandwiched between two flour tortillas with grilled, melted cheese on them. amazing.\n\nyou can have a filling lunch for no more than $10 bucks. if show up during the lunch hour be ready to wait for about 15 minutes before getting your food.", 
            "some of the best tacos i've ever had. it's like being transported to mexico when you take that first bite. the spicy <mark>Pork Stomach Tacos</mark> are so delicious. wouldn't have ever expected tacos this good when i first saw the joint. a true gem in vegas.", 
            "$2 meaty-tacos?! what's not to like? they have a bunch of different types of meat, i just stuck to the carne asada and spicy <mark>Pork Stomach Tacos</mark>. the carne asada was just ok but the spicy <mark>Pork Stomach Tacos</mark> were amazing. make sure you get a slice of pineapple on top! the only weird thing about this place is that they didn't serve chicken.", 
            "ultimate addiction! \n\nif you want street tacos, this is the best place to find them! the spicy <mark>Pork Stomach Tacos</mark>, are heaven. i normally order the mula version, which cost $4. it's the best bang for your buck. this is a great place open 247 on the strip if you are starting or finishing partying for the night.", 
            "spicy <mark>Pork Stomach Tacos</mark> were the best! delicious and cheap.", 
            "yes, 2 dollars/street taco is a little steep. but it's still cheaper than most food places on the strip.\n\ni ordered 2 carne asada and 2 spicy <mark>Pork Stomach Tacos</mark>. then i went back and ordered 2 more spicy <mark>Pork Stomach Tacos</mark>.  if i were to go back i'd order 6 spicy <mark>Pork Stomach Tacos</mark>.\n\nmaybe i've been on the east coast for too long but after the first bite of the spicy pork taco i felt like weeping for joy.", 
            "spicy <mark>Pork Stomach Tacos</mark> are a must try!!! the best $2.00 tacos money can buy.", 
            "anybody who doesn't give this place 5 stars was either drunk as a skunk when they went there and therefore couldn't enjoy the food or just doesn't like good fresh mexican food at an incredible price.\ncome on........<mark>Pork Stomach Tacos</mark> at two bucks each. it can't last, but i sure hope it does.", 
            "you know the tacos are good when you only see mexicans eating there.  i ordered the beef brain, beef head, and cow <mark>Beef Tongue Tacos</mark>.  the cow <mark>Beef Tongue Tacos</mark> here were hands-down the best tacos lenguas i've ever had in my life.  it was too spicy for me (you can ask them not to put the sauce on), and i still thought they were super delicious. i love cow <mark>Beef Tongue Tacos</mark>, and these were really the best ever.  tacos cost around $2 each, with the exception of the tacos lenguas, which were $2.25 each.  worth it!  my brothers got the spicy <mark>Pork Stomach Tacos</mark>, and they said those were the best they ever ate.  they also have a bunch of other things like cow tongue fries, sopas, and other traditional mexican foods, but i'll save that for next time.  yep, go to this place.  cheap good food, and it's enough to satisfy your stomach.", 
            "they have a confusing system of ordering first at one of the two cooking stations then paying at one of the two cashier stations you hope have an employee at them so you know where to pay. i was so confused for the first 10 minutes i was there. that, and my arm got burned by a fleck of something that came off the grill across the way while i was just waiting for my food. i asked for a cup for water and was given one, but they didn't have a dispenser for water at either of their two drink fountains! i tried pulling the little tab under the sprite that is normally water, but all i got was super flat and disgusting tasting sprite. i  was super irritated!\n\napart from that, the spicy <mark>Pork Stomach Tacos</mark> are epically amazing and deserve 5 stars alone. i wasn't a fan of any of the other tacos.\n\ni soooo had wished my experience would've been better so i could justify going back here for more tacos. make sure to ask for everything on them, cause the extra additions and sauces make the tacos taste so much better.", 
            "updated review: 3.5 stars\n\ncarne asada fries $10, not worth the price!  not as good as alberto's. the lengua tacos are good and very tender. the spicy <mark>Pork Stomach Tacos</mark> are good too. if i have to compare, the taco truck in pasadena,ca is better, taste wise and price-wise.", 
            "i love tacos el gordo, its fresh and simple mexican food.    for ordering stand in the line according to the meat you want, you want pork , stand in the line in front of the huge spinning pork meat on a spic.  steak stand in the steak line, look for the signs.  when its not busy it doesn't matter, but when this place is rocking, the lines are 5-7 people deep, standing in the wrong line cause issues.  \n\ni have had the steak and <mark>Pork Stomach Tacos</mark>, both are great.   if you are near the wynn, try this place.", 
            "super yummy spicy <mark>Pork Stomach Tacos</mark>! the locals eat here. the tacos are small so order a few... you order your food first and then you pay.", 
            "best tacos i've had in vegas. the <mark>Pork Stomach Tacos</mark> cured my slight hangover. i also was deprived from sleep, only slept 3 hours, and after stuffing my mouth with these mouth watering tacos instantaneously my  soul was lifted. cured my hangover and also gave me the energy needed to overcome another day of partying. definitely worthy of five stars!", 
            "the spicy <mark>Pork Stomach Tacos</mark> are amazing!!!!!!! this is a must try place in vegas. regardless, if the rest of you meals are at 4 star restaurants this place is worth the trip. i only stay at the encore so its near by but, even if you are staying at mandalay bay its worth the trip. i will eat every time i go to vegas, which always happens at least one time a year.", 
            "i legit love this place!  it's definitely a go to spot after a night of partying.  i always order a couple of the spicy <mark>Pork Stomach Tacos</mark> which i think is the best type of meat they serve.  their spicy pork fries are also a great choice, but i will suggest ordering half of a full size order because even their half size fries can feed about 2-3 people.  they also provide grilled peppers and green onions for free and they go great with just about anything you're eating at the place.  \n\nthis place definitely is the best taco place in town!", 
            "just so freakin delicious!!!!  had tongue, asada and spicy <mark>Pork Stomach Tacos</mark>.  i could eat here forever!", 
            "the asada tacos, spicy <mark>Pork Stomach Tacos</mark>, and asada fries were all really good. the lines for food were long even at midnight but it was worth the wait.  we knew the food would be good when we saw a lady making tortillas on the spot!", 
            "why did i only find out about this place on my last day!!  this place is legit and conveninetly located right outside the wynn!!!  they are definitely doing tacos justice, served with care and attention to detail.  it looks like a place that was picked up right out of tijuana so don't expect a classy place, but it doesn't matter because your their for the food.  their <mark>Pork Stomach Tacos</mark> are phenomenal, moist and juicy, and i'm pretty sure the only place i've seen serve tacos from a rotating gyro-like spit, which are cut freshly as you order.  also, don't forget to get the roasted peppers.", 
            "$2 spicy <mark>Pork Stomach Tacos</mark>. you want these. tasty snack and best deal on the strip. yummy mexican sodas to boot, what's not to love.", 
            "you have to walk north of the strip pass the wynn and encore but trust me it is worth it. i did not expect to enjoy it as much as i did, but the carne asada tacos were amazing.  i had the tripe and spicy <mark>Pork Stomach Tacos</mark> as well, on a full stomach and it was still delicious and authentic.  for 2 dollars a piece, the size was perfect, and if you are walking down the strip you might as find this little mom and pops place.  the lines are long but they go pretty fast.  it is the right amount of spice and flavor.", 
            "i've heard about tacos el gordo as their main branches are in south san diego and they are well known for authentic mexican street tacos. these aren't just *any* run of the mill chicken/steak/carnitas tacos but the real ones where they use certain... innards of the animal. although i've lived in chula vista for so long i hadn't visited one (shame on me), so not only am i able to complete a pilgrimage to such a well-known taco establishment before i move to the bay area, i also got to introduce the no1dp to real tacos. it's a step up from the \"mexican\" food he's been used to eating on his business trips but he says it was way too late to try brain and <mark>Pork Stomach Tacos</mark> :/\n\nthis is one of the few places in vegas that are open quite late on a weekday (3am) and even more late on weekends (5am). frankly there's not much that's open for late night eating afterwards unless you are willing to go off-strip and even then you have to know what you are looking for. this area is also short walking distance from the wynn/encore hotel group so this would be a perfect late-night spot for people getting out of xs/surrender/tryst and needing to sober up.\n\nthere's indoor and outdoor seating. outdoor seating is covered. no1dp says that outside is a good place to go people-watching as it overlooks las vegas blvd.\n\ninside the taco shop there are various counters. each counter you can order specific items. place your order then fall in line at cashier towards the door to pay.\n\nall tacos use two flour tortillas to soak up the fat/give stability to the taco plus each taco has a generous portion of salsa verde. there's no cheese or sour cream on the taco (which is a sign of a true mexican taco joint). each taco is between $2-$3.\n\nasada: typical beef carne asada taco. tastes like any other carne asada taco. if you live in socal and are lucky enough to have taco shops within reasonable driving distance, just do yourself a favor, be more adventurous and try a taco that you'll only find here.\nsuadero (shoulder): one of the best cuts of meat for a taco i've ever had. shoulder seems like it was braised as the meat was quite soft and juicy without it being too greasy.\ncabeza (head): for this taco i think they grind up the head so that the end result texture is similar to a pate. the taste was a bit weird and didn't have much flavor as a meat; it absorbed more of the oil and the salsa verde. \n\ni can definitely justify the hype regarding this place and this taco joint, along with tj's oyster bar for tacos from the sea, are my two recommended taco joints for real street tacos. now if i can find someone to drag along who is willing to try beef brain, tripe and pork stomach before i leave...", 
            "omfg.. this place never fails!! i come to vegas quite often from phx and wow just wow. spicy <mark>Pork Stomach Tacos</mark>.. amen. compliments ;)", 
            "we had spicy <mark>Pork Stomach Tacos</mark> , really good the sauce was simply amazing, very authentic!!! it is a must", 
            "<mark>Pork Stomach Tacos</mark> straight off the spit. what else do you need? we come here multiple times every trip. one of the required visits.", 
            "this place is so amazing!! get the <mark>Pork Stomach Tacos</mark>? they are $2 a piece and are to die for!!", 
            "tried this place with my hubby for a snack and totally fell in love with their food. it's a great cheap eat in the heart of vegas (next to the wynn). make sure you taste their spicy <mark>Pork Stomach Tacos</mark>! they are just fantastic! (and cheap, 1 taco = $2)", 
            "by far the best taco spot in las vegas. i first came here when i went on a date with this guy; i still thank him for bringing me here lol. but ever since then, i can't stay away! i come here at least once a week and every time my taste buds praise me for gracing them with such great tasting food. i also brought my family here with me one day and they all fell in love. \n\ni've tried both the carne asada and the spicy <mark>Pork Stomach Tacos</mark> but i have to say that the spicy <mark>Pork Stomach Tacos</mark> are my all time fav! the people are always really nice and the guys working the grills be movin! i can't get enough of this place!! great food for a great price... that's what i'm all about.", 
            "i'm from texas, houston to be exact so i've had plenty of mexican food in my lifetime. the spicy <mark>Pork Stomach Tacos</mark> had me chewing and shaking my head in silence. so good, best tacos i've ever had. great food for a low price right on the strip, what more could you ask for?", 
            "with all the good reviews, i had to give this one a try. glad i did! all the other reviews were spot on. only downgrade from 5 stars is due to the disposition of the cashier. she was not very nice and was not happy when i had to ask more than twice for some translation because my spanglish needs some work. other than that, a few pesky gnats found their way onto my tacos. ordered 2 steak tacos and 2 spicy <mark>Pork Stomach Tacos</mark> and a diet coke.---$10.05. not bad for vegas.", 
            "maybe i am spoiled with the mexican cuisine in salt lake city, but i just don't think this place lived up to the hype. over 700 ratings averaging 4.5 stars, i thought it had to be mind blowing.. but not exactly. we had the spicy <mark>Pork Stomach Tacos</mark> and carne asada tacos. the guac was very bland. the service was really bad, too. we ordered and stood there forever, finally getting our carne asada tacos. they must have completely forgotten about the <mark>Pork Stomach Tacos</mark>, but after reminding them we eventually got them. it wasn't even crowded, either. it was a bummer to discover the horchata was out of service, too. i wouldn't go back here--but that's because i can get better authentic mexican in my hometown. i guess i can see how those who don't have access to these type of places would love it. it's definitely authentic.. just not that great.", 
            "everything from quesadillas to beef brain tacos, everything is tasty! i love this place so much! my friends and i were all getting tired, but we had to drive back to saint george that night and everyone wanted tacos. we tried other places, but most of them were 21+ and one of my friends wasn't 21, so we found tacos el gordo. \nwhen we got there, it seemed to have a long line trailing outside, but it didn't take long until we were inside ordering.\ntheir spicy <mark>Pork Stomach Tacos</mark> are to die for! and if you order peppers and onions, beware! they are super tasty, but way spicy (and i can handle a lot of spice)!\ni have recommended this to everyone going to vegas because it is totally worth it and is super close to everything on the strip.\ngo to tacos el gordo, you won't regret it!!!", 
            "i tried the sesos (brains) for the first time. it was like eating soft tofu. the spicy <mark>Pork Stomach Tacos</mark> is where it's at. \n\nabsolutely simple and delicious.", 
            "so we were told by boo's dad that we must visit this place in vegas...so we did.\ni can tell you that it is super easy to pass on the strip but it is in a plaza adjacent to walgreens and they have little tents out front where you can sit and eat.\n\nthe menu is very basic, you tell the cook what you want and they cook it up right in front of you. i think i had steak tacos...i can't remember. i think boo had the same thing. they were pretty good but it was nothing exciting to me. i think i was still on a high from the 24 hour joint in san diego. i guess i should have gotten the spicy <mark>Pork Stomach Tacos</mark>?\napparently we beat the rush because there was a super long line of people waiting to order after we sat down and ate. they have soft drinks that taste like floats that are pretty tasty.", 
            "i got the spicy <mark>Pork Stomach Tacos</mark>. extremely good, probably the best street tacos ive ever had. these guys are very authentic. if you want a dining experience, you will be dissapointed. these are street tacos! this place is absolutely about one thing, and they do it well.", 
            "asada (steak), lengua (cow tongue), adobada (spicy pork)...omg! i don't even know what to say about this place besides \"you have to go\". it's good!!! the meat is tender and flavorful, all 3 that i tried. the guy that made my tacos put on a little show with flipping the tortillas in the air and catching them. plus he was cute. :-) and, on the spicy <mark>Pork Stomach Tacos</mark>, he sliced some pineapple which totally took it up another level. the salsas and sauces are spicy & tasty, and everything is so fresh! please know, this is a hole in the wall, but aren't those the best after all?", 
            "strayed away from the convention center and big name palatial casinos to take a break from all the overpriced nonsense and corporate types.  i felt comfortable at tacos el gordo, the service was fast, and the steak and spicy <mark>Pork Stomach Tacos</mark> were excellent.  i'm glad i checked this place out and am going to make it a place i come to every time i'm in vegas from now on.", 
            "authentic tijuana style tacos, fresh and interesting as it gets, go for the al pastor spicy <mark>Pork Stomach Tacos</mark> and buche \"pork stomach\" tacos.\n\ni try to avoid this place at popular times due to many rookies not knowing the process and it can get frustrating.\n\nother than that, its completely legit.", 
            "i'm loving it!\nmake sure to add pineapples to the spicy <mark>Pork Stomach Tacos</mark>!\noh oh oh and don't forget the fries with meat!", 
            "hm, not sure why this place got such high reviews...maybe because most people were tipsy when coming here?  well, we came here sober cuz we wanted really good tacos and read all the rave reviews.  i told myself and my bf (who was the one who wanted to come here) that driving in vegas traffic and waiting in this extremely long line better be worth it.  well sorry my friends, it was sadly not!  it took us about a half hour in the line outside to get to the line inside, lol.  we ordered the spicy <mark>Pork Stomach Tacos</mark> and a quesadilla and both were just ok - i've had a lot better elsewhere.  apparently the spicy <mark>Pork Stomach Tacos</mark> are supposed to be kickass here but for me, they were only meh.  have you guys ever had really good tacos??!  my theory is that there's not many good taco places on the strip and that's why all the rave reviews?  who knows, but i'm definitely not coming back here again...", 
            "so, i had to come to vegas to discover a restaurant that is also in san diego!!!  found this place mentioned as a top choice on several websites, especially when researching the best cheap eats in vegas.  granted, they are not necessarily cheap for street tacos ($2 to $3), but compared to prices in vegas as a whole, tacos el gordo is a bargain!  during a lunch break during a business conference at the lv convention center, my friend and i came here.  expecting huge lines, we prepared for a long wait, but it turned out that lunch time is a pretty good time to visit.  according to my friend, the lines are absolutely huge during the late night hours, after the clubs get out.  anyway, i ordered two of their famous spicy <mark>Pork Stomach Tacos</mark>, one beef shoulder taco, and, because i wanted to be adventurous, one beef brain taco.  i had each one \"with everything\" and all of them were delicious!  without a doubt, the two <mark>Pork Stomach Tacos</mark> were the absolute best...sweet, savory, spicy...full of flavor!  the beef shoulder was excellent to, a bit stringy, but overall very tasty.  the brain taco was...interesting.  with all of the accompanying toppings, it was very tasty, but it was the texture that was the most different.  creamy is probably the best word to describe it.  would i order one again?  probably not, but i am very glad that i tried it.  was it filling?  after eating my four tacos, i felt thoroughly satisfied.  i was by no means full, but happily fed (for about $10 mind you) and looking forward to a future visit.  \n\nwhen in vegas, i will visit again and now that i know that they are also in my home town, i will be making a drive down there soon as well!", 
            "a notch lower than the one in chula vista definitely, because the pork goes on the grill for a little bit before reaching your taco, rather than cutting it right off the rotating roaster and dropping into the taco.\n\nin order from best to good\n\n1 - spicy <mark>Pork Stomach Tacos</mark>\n2 - lengua tacos\n3 - shoulder tacos\n\nquite honestly i would recommend getting 4 spicy <mark>Pork Stomach Tacos</mark> and 2 lengua tacos for yourself.  ask your friend to simultaneously line up for a different ingredient so you don't have waste time standing around", 
            "read the reviews here on yelp and decided to give it a try.  so glad we did!  i am born and raised in texas and we know our mexican food.  when we first walked in we were a little skeptical but as soon as we received our food we were completely sold!  not only is it super cheap, but the food is amazing!  the spicy <mark>Pork Stomach Tacos</mark> were delish!  the spicy pork quesadilla was amazing too!  first time i've ever had a quesadilla where the bottom layer was a soft tortilla and the top was crunchy.  then the fries!  wow!  i only got a half order and it fed 3 peeps and we had to stuff ourselves to finish them.  so we had 3 people with sodas that ate until we waddled out for $20...what?!!!  can you say fat and happy???  yup! = )", 
            "i didn't get anything to get here because i was recovering from food poisoning. but my bf got the spicy <mark>Pork Stomach Tacos</mark> and he said they were the best tacos he's ever had. this place is authentic and the long lines and people show that it is really good. he gives 5 stars for that.\n\nhowever, one has to ask whether it's worth the 50+ minute wait. the lines bring down the rating from 5 stars to 3 stars. the queuing system was really confusing. as others have mentioned, there are separate lines for everything. there are six lines, two sets of three lines. the three lines are for pork (abodaba), offal (brains, tongue, stomach, tripe, intestines, etc), and beef (asada, etc). the line didn't actually look that long so it was ridiculous how it took so long. \n\nas we got closer, we found out why. it's because there was one guy doing the job of two people. he makes the tacos really fast but he would have to make like at least 5 for each customer. also, he made like 50+ tacos while we were in line that looked like it was for to-go orders (paper plates wrapped in foil). so the amount of time per person and the amount of extra work the taco maker is doing for people not in line contributes to long wait times. it feels like there has to be a better way for them to do this!", 
            "yum yum and more yum. can't go wrong with spicy <mark>Pork Stomach Tacos</mark> here! tacos are authentic here. gets pretty crowded but the lines go pretty quick! everyone wants to chow down on some tacos after a night of drinking.", 
            "everything here is really good! spicy <mark>Pork Stomach Tacos</mark> are bomb! must try if you haven't already! you can eat inside and outside too! :)", 
            "place is a madhouse. crazy packed. got some carne asada tacos and spicy <mark>Pork Stomach Tacos</mark> to go with carne asada fries. the fries were a pleasant surprise. tacos are very good. the salsas need a little work. the meat in the tacos have a nice smokey flavor. came here late at night to avoid crazy lines during the day.", 
            "we went on sept. 4 thursday evening. it was our first time. \na bit confusing with different lines you have to stand in base on what you want. \nwe asked the cashier and she explained it well. \nyou can pay ahead of time or pay after you order and get your food. it's $2 a taco. \n\nwe got the <mark>Beef Taco</mark> (carne asada)- it was okay. maybe overly cooked, kind of chewy.  not memorable.  3/5 stars.\n\nwe also tried the park tacos (adobada)- mmm... taco heaven. tender. they refer to it as spicy pork but it's not spicy. the taco tasted amazing. you can have pineapple on the side or on it. same for the cilantro.  throw some lime on it and boom ...5/5 stars! \n\nwe didn't try the other items. \nwe highly recommend the <mark>Pork Stomach Tacos</mark>. went back again just for them on sunday sept7 evening.  the second time we went, they were cooking the pork at both stations and had to wait 10mins. this was around 6:30pm. both evenings the line up wasn't too long. \n\nnegative- most of the cooks were wearing hats. one was wearing a hair net.  it can get pretty hot and they were working hard. lots of sweat. with the cook sweating that much on his face, it was not appealing to fear lots of the sweat dropping on to the meat as he was chopping it up.  our cook wiped the sweat off his face twice when it looked like it was going to drip on to the food. luckily none did. but a bit hunger killing seeing that. \n\ndefinitely will be back.", 
            "best tacos.  hard to say anything that hasn't already been said.  i'm just here to backup all the other 5 star reviews and it's mainly for the <mark>Pork Stomach Tacos</mark>.", 
            "went here with the wife from a lot of people talking about it and was highly disappointed we got carne asada fries and some spicy <mark>Pork Stomach Tacos</mark>, the tacos were decent at best but the carne asada was the worst tasting ever it tasted like it was blasted with gas or something i cant place it but theres no way it could always taste like that and have such good reviews absolutely horrible we will never be back", 
            "best tacos in vegas!! i love this place! i haven't been back to robertos since i discovered el gordo! the spicy <mark>Pork Stomach Tacos</mark> are theeeee best...seriously!! everything is made fresh right in front of you and the lines are always crazy. its well worth the wait!!", 
            "these are the best tacos i've ever had.  you must try the spicy <mark>Pork Stomach Tacos</mark>!  \n\nthe asada fries are great too but if you order them the half portion is more than enough for two.  the full portion could probably feed a few poeple.\n\nthe spicy pork fries are great as well.\n\nthe line can get long especially around 1am but it's a great late night meal after a night of gambling!", 
            "best tacos i have tasted. the <mark>Pork Stomach Tacos</mark> are the best. it is so yummy that i want to go back just for these tacos. the best part, cheapest mean i had the whole time i was in las vegas. amazing!!!", 
            "glad this location opened back up. best carne asada fries!! also, best <mark>Pork Stomach Tacos</mark> i have ever had. yummy!!"
        ], 
        "dish_name": "Pork Stomach Tacos"
    }, 
    {
        "text": [
            "this place is in my top 5 of all time restaurants!!!\n\ni had the spicy pork sopas and that was on of the best foods i had ever eaten. i had 2 sopas, the <mark>Beef Tongue Tacos</mark> and carne asada taco. if you are on the strip and want an explosion of flavorful food, this is definately the place to come. the spicy pork name comes from the spices that it is marinated in rather than a hot spicy marinate. i will be back whenever i come to town.", 
            "so, this trip to las vegas was essentially a post-deployment treat - one that i went on by myself as to get the freedom to do whatever the heck i wanted - including playing 20 straight hours of poker at the wynn, which is the reason i found tacos el gordo - which i believe means fat tacos.\n\n2 a.m., i drunk, walking down the street - just about the only tacos i was going to get to eat at that time was a real one - and i wasn't going to complain.\n\nstepping into tacos el gordo is to be transformed from las vegas to tijuana - in fact, the owner says they are formerly from tijuana, which i often visited as a kid. dirty, scuzzy, and authentic - that's about the only things i can use to describe this place. \n\nalthough there are about eight different types of tacos - each costing about $2.50, i opted for the stomach and <mark>Beef Tongue Tacos</mark> - both culinary delights i'd learned to eat having grown up in southern california.\n\nin my best spanish, which i failed both in college and high school, i ordered two of each, and an horchata (a milky, cinnamon drink). the guy behind the counter looked at me with amusement, and in lightning speed, whipped up two of each. after paying for it all and putting a few bucks in the tip jar, i went to my seat only to be summoned back and given an extra side of meat. \n\n\"shoulders,\" he said. \"try it.\"\n\ni tried it and instantly fell in love (the next day i came back and ordered more) - it was not only flavorful and full of spices, one could almost taste the nutty, meaty taste of the cow cheeks. i was in taco heaven.\n\nonto the tongue and stomach, however: stomach tastes exactly the way you'd expect it to - a bit slimy, but flavorful with a hint of bitterness. no worries - a bit of lime and salt takes away the flavor that you might not be used to. i quickly wolfed it down and then tried the tongue.\n\nsubtly beefy - that's the only way i can describe it. tender, moist, and full of flavors, it also packed a beefy flavor that no way in hell taco bell could deliver - new 100 percent meat be damned. it's also a light meat - that is, it's beef, but doesn't come with the heaviness that beef often is known for. it is, in a sense, as soft and gentle as a baby's sigh - heavenly goodness.\n\ni washed it all down with the drink i mentioned - the sweetness cleaning my palate with each swallow, allowing me to go back to the tacos and tasting everything packed in it each time.\n\nthe next day, i went back for more. in fact, during my eight-day stay, i ate at tacos el gordo five times - each time leaving me satisfied, but also longing for more.\n\nif you do go there, i recommend the tongue and the shoulder tacos. i also recommend the horchata. what's more - get the little vegetables that are left to be eaten over a bed of ice. they are meant to cleanse your palate. take a bite of it after each bite of the tacos (or if you're like me you shove the entire taco in your mouth), and i promise you'll be ranting and raving about this place, too.\n\nanother note: do leave a tip. these people work really hard, and they do a good job serving. you're in vegas - you're going to splurge anyway. might as well make someone's day.", 
            "this place is excellent. the spicy pork and <mark>Beef Tongue Tacos</mark> i had were on point. the tortillas are small but so tasty. they also put so much on it you cannot see the tortilla. it smells as good as it taste. i wish i would have eaten more but i had a buffet waiting for me a couple hours later. no complaints about anything so it is a definite 5 stars *****", 
            "you know the tacos are good when you only see mexicans eating there.  i ordered the beef brain, beef head, and cow <mark>Beef Tongue Tacos</mark>.  the cow <mark>Beef Tongue Tacos</mark> here were hands-down the best tacos lenguas i've ever had in my life.  it was too spicy for me (you can ask them not to put the sauce on), and i still thought they were super delicious. i love cow <mark>Beef Tongue Tacos</mark>, and these were really the best ever.  tacos cost around $2 each, with the exception of the tacos lenguas, which were $2.25 each.  worth it!  my brothers got the spicy <mark>Pork Stomach Tacos</mark>, and they said those were the best they ever ate.  they also have a bunch of other things like cow tongue fries, sopas, and other traditional mexican foods, but i'll save that for next time.  yep, go to this place.  cheap good food, and it's enough to satisfy your stomach.", 
            "a hole in the wall, a short walk off the strip, but what it lacks in glitz it makes up for in deliciousness. \neverything is delicious and full of flavor! the <mark>Beef Tongue Tacos</mark> and steak al pastor tacos are my favorite. \n\nif you want authentic mexican tacos in las vegas, this is your place.", 
            "when they offer tripe,  brain or <mark>Beef Tongue Tacos</mark>,  you know the place is authentic. but go for the spicy pork  adobada tacos. came for two,  ate four.  the carne asada with prickly pear (taco azteca con nopal asada)  was also very good."
        ], 
        "dish_name": "Beef Tongue Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef Guts Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef Brains Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Beef & Pork Tacos"
    }, 
    {
        "text": [], 
        "dish_name": "Azteca Taco - Beef & Cactus"
    }, 
    {
        "text": [], 
        "dish_name": "Fries"
    }, 
    {
        "text": [], 
        "dish_name": "Mulas"
    }, 
    {
        "text": [], 
        "dish_name": "Quesadillas"
    }, 
    {
        "text": [], 
        "dish_name": "Sopes"
    }, 
    {
        "text": [], 
        "dish_name": "Tostadas"
    }
]