[
    {
        "text": [
            "-- the sushi is good. 23 bucks for all u can eat anything off the menu is unbeatable. that means anything off their given menu..... sushi, appetizers, dessert..... everything. \n-- i've gone there 3 times in the past 3 trips to vegas. cousin brought me there to eat and make it point to go back everytime i'm in vegas. \n-- japanese cooks can mess up japanese food. but this place doesnt. \n-- their <mark>New Special Roll</mark> are fun to try out. they usually have 20 <mark>New Special Roll</mark> of the night. \n\n-- fyi, i was told alot of sushi restaurants in vegas are moving toward to the all u can eat format. but this place has been doing it for years now. \n\n-- service was good.\n\nkngkonga's take home advice:\n-- order and try appetizers you wouldnt normally order. it's a good opportunity to try things if you havent tried different japanese dishes.", 
            "all you can eat sushi. i am going to agree with one of the yelpers that sushi and buffets do not go well together. however, nowadays we have to get the most bang for our buck and one of the ways to do that is to go for buffets or all you can eat. \n\nmost of  the sushi they serve here is really fresh. very good taste and texture. some of it was a bit disappointing but for $19.99 for lunch all you can eat. i think it is a small sacrifice on the consumers part. they do half rolls here so you can try a lot of the <mark>New Special Roll</mark>. they do not over stuff the rolls with rice either.  i had the halibut and yellowtail tuna and  it was quite fresh and tasty. the rolls are creative and had great flavor. eel sauce anyone? \n\nthe service was excellent.  the wait staff was very attentive and they did not let your drinks to go empty. the sushi chefs were very fast and efficient. they are constantly aware if you are ready for more food. for the coup de grace, we had plum ice cream. quite flavorful. \n\nawesome service and decent all you can eat menu.", 
            "this is was our favorite sushi place to go to, however we've switched to bluefin on sunset and annie oakley. whenever we were served by jun we had a good meal with expedient roll delivery. my favorite things to order; spicy seafood salad with extra radish, sun of the beach, no name roll, uni, and the seaweed salad. mmm, i left with a happy belly every time. if you become overzealous upon seeing the menu and order a ton of rolls, expect the waitress to drop by and ask if you want to cancel anything about a half hour or so in. all of the <mark>New Special Roll</mark> we've tried have been tasty, and there's a high turn over so the fish has been fresh. the amaebi was a little disappointing, and the portion sizes/quality have varied slightly with the different chefs but given how busy the restaurant is (it's often packed with a long wait for larger parties) it's understandable. overall it's been very tasty, well worth the money! they even have mirugai, which is rare. we were going about once a week for several months.\nedit: went for our weekly trip with some of the boyfriend's family. we were lucky and got to sit at the bar with jun and he hooked us up with several pieces of hamachi belly sashimi, which was ridiculously good! by the time we left the line was out the door. i love this place :}\nedit #2: the fish is even fresher at bluefin at sunset & annie oakley!        yama has been outdone!!", 
            "recently tried yama sushi for the first time during a visit to las vegas. i used the mobile version of yelp to find the place, but still had a bit of trouble since it's part of an outdoor shopping center with several establishments and the buildings are far back from the street. if you're looking for this place, look for the shopping center with the albertsons on flamingo and maryland and you'll find this place.\n\ninterior of the restaurant is small, but very clean. tables are close together, but the sushi bar was packed so i sat at a table. there is a laminated menu with the <mark>New Special Roll</mark>, and a paper menu that your server will bring with the more standard fare. ayce with tax is just shy of $23.00. a fantastic deal.\n\ni was very pleased to see that half-orders were available for all rolls, even the special ones. this meant that since i was the only one eating sushi in my party, i was able to try several rolls. while i tried to pick rolls, i had the albacore sushi (just ok) and the salmon sushi (pretty good!). both were served with large pieces of fish and just enough rice. i don't think i'd get the albacore again, there was something about the texture i didn't like.\n\nfirst up were the \"man whore\" rolls: spicy salmon roll baked w/ a mixture of spicy tuna and cream cheese on top and served with spicy mayo and eel sauce. these were just okay. the baked topping was dry, possibly over-baked? not sure. so, the man whore wasn't fantastic, but it wasn't awful, either.\n\nnext were the \"yama crunch\": tempura shrimp and crabmeat roll with a crunch layer on top. these were pretty tasty. they were served with a sweet sauce which was pretty good.\n\n<mark>Kai Roll</mark>: eel, cream cheese, avocado and spicy tuna roll w/ spicy tuna and avocado outside. again, there was a sauce served with these rolls that was pretty good. i would have gladly had more of these and skipped the man whore rolls.\n\nlast, but not least, the \"wet dream\". omg. delicious. these are a california roll baked with cream cheese and shrimp on top with a sweet yam sauce and eel sauce. did i say delicious? these were the perfect end to the meal.\n\nservice was fine. the place was very busy, but i barely would finish a plate of 4 pieces and the server would come around and ask if i wanted something else. it's also very noisy, but that's okay as long as the person next to you doesn't have an annoying celphone ring that goes off ever 2 minutes or so. ahem.\n\ni would definitely go here again if i'm with non-sushi diners. otherwise, i'm still a fan of sushi on trop .. for now.", 
            "best all you can eat sushi place in the vegas area that i know of! every time i'm in las vegas, i really try to hit this place up. it's good sushi (<mark>New Special Roll</mark>) yum, all for a fairly decent price!  note: vacationers..it's not anywhere near the strip, maybe a $20 cab ride to and from the strip..make sure to get a taxi's number so they can pick you up once your done. enjoy it's worth it! =)", 
            "we dropped by this place on the way back from a vegas weekend and really enjoyed it! we got lucky, getting in just before 12 and only had about a 5 minute wait. the place got packed moments after we were seated though. \n\nthe ayce sushi is fresh (uni!!! ikura!!) and delicious! the menu includes various sushi, cut rolls, hand rolls, cooked items, sides, and a couple choices for dessert. they've got all the standard sushi items you would expect at any respectable sushi place, but also have their own <mark>New Special Roll</mark> that they've named with a vegas theme, though most of them seem like other rolls with cream cheese added (not something that floats my boat much...). the service is very friendly, though waiting for some of our orders sometimes took a bit longer than expected. \n\nit takes a bit for me to give 5 stars to a sushi place...its really gotta be amazing in that case. i only drop a half a star because they took a little longer than expected on some of the items, and one item didn't come at all. not a big deal as we did get our filling, and though we did get our filling, i would have liked to try the other items too.", 
            "$20 all you can eat sushi. this place is away from the strip. came here with a big group of friends (13 people) and they put our tables together and we were seated within couple mins. their <mark>New Special Roll</mark> are the best. i like how you can order anything u want off their menu (appetizers, sushi, soups, desserts) since some place only have limited selection and you can order as many time as you want. our group ordered so many rolls i don't even remember which rolls we got. we were so full we almost didn't finish but we made sure we did so they wouldn't charge us extra for not finishing (not sure if they do but most ayce restaurants do charge for not finishing). i like how how you can order mochi ice cream as many times as you want (strawberry and chocolate mochi ice cream yummy!), i don't know any other ayce sushi places that do that. the service was good especially for a big group like ours. if i'm ever craving ayce sushi in vegas, i'll make sure to come back here.", 
            "where to begin?? this is my favorite sushi joint ever! i happily make the drive from summerlin to yama every chance i get!  the prices are very reasonable compared to most sushi places!! (at yama, my son and i can eat ayce dinner for just under $50 leaving plenty of cash for tips!  the last place i took him too, cost us $75 before tip.. and it was ayce too, but most stuff wasn't included, but you'll read about that in their review later. =)\n\n*now, about the food: always fresh, never fishy, and they always customize it for your tastes! i go about once every other month or so, but the chefs still remember me, and keep the crazy red chili sauce to themselves. so that speaks great for their service too and ensures the food is how i like it every time. another reviewer mentioned the baked green mussels- those are a must on every trip! they have the best mussels ever!  like they have their own way of making it that sets theirs apart from every where else. also, their man whore, son of a beach and harry potter rolls are to die for! plus, i love that you can order half rolls!  so if you just want to try a roll, or if you want to be able to maximize the amount of choices you get without stuffing yourself sick, you can half roll it all day long! lol. the chicken yakitori and teriyaki is delicious too! and this is perhaps the only joint in town where you can have as much mochi and ice cream as you want\n\n*about the ayce: ok, i noticed some people commented that you will be charged for what you don't eat- that is semi true here, but true for all ayce sushi joints. all ayce joints have the time limit/no waste signs, and some even have the no mochi with ayce sign too! and i understand why- you don't want some one ordering 15 rolls, eating 2 bites of each and wasting the rest. it totally makes sense to me. the difference with yama is- if you tried it and it just totally didn't suit your taste buds, tell them and they will take it back. if you make an honest effort to eat the whole roll but have a few pieces left, they won't care. the only time they have ever said anything to my friends or myself, was when we have about 15 pieces of various rolls laying around. plus yama doesn't have a time limit, nor a food quantity limit like some places. if you want 30 pieces of mochi, then bring on the ice cream headache! again, the ayce rules makes total sense.\n\n*the service: they are freaking awesome! i see some people talking about wait. they must be going at 7pm on a friday or saturday, and you'll experience long waits at those times anywhere you go. i usually have a party of 4 with me when ever i go, and we are usually seated within minutes.  the chefs remember our choices and have even created <mark>New Special Roll</mark> just for us when we go in! and if you don't like their experiment they made for you, not a problem! they aren't offended, and they don't charge you for it. you can flag down any waitress, they aren't territorial in any way. nor are they judgmental - sure they giggle when my 11 year old son orders one of every flavor of mochi plus a green tea and plum ice cream, but they deliver it to him none the less!  after all, it's me that has to deal with his sugar high later, right? lol\n\n*over all* this is a great restaurant! if you had a less than perfect experience the first time, it was just a fluke and you should give them a second chance! and regardless of what any one says, the crazy red chili sauce is the work of the devil. =)", 
            "nice ayce sushi place off the strip. it gets pretty busy so expect a line. the <mark>New Special Roll</mark> have funky names and most of them are pretty good. the staff is attentive and pretty good at refilling drinks.\n\nonly thing i suggest is to not get the uni. everything else was great.", 
            "i read the review about getting sick here but i haven't gotten ill.  when i in vegas for business i usually try to stop here a few times.  been coming here for years and it's getting crowded. they now have these <mark>New Special Roll</mark> with silly names like man whore and <mark>Happy Ending</mark>. when they first introduced it i had an older waitress that asked with a heavy accent 'would you like to try man whore or <mark>Happy Ending</mark>\" i almost did a spit take \"excuse me??!!\"  i like that there is a lot more than sushi on the ayce menu like tempura (you can order shrimp only) but my favs are soft shell crab and hamachi kama - onolicious.  one dish i would never order again is the yakitori - it was nasty. i was expecting grilled pieces of skewered chicken but their korean interpretation is baked flat pieces of chicken that they cut into little squares and stick them on a skewer with muchrooms, green onion and white onion and it is baked just a little more and brought out luke warm, drenched in teri sauce. mushroom tasted more raw than cooked. update aug 2011 i'm going to downgrade my review to a 3 soon.  last 3 visits which have been at lunch or early dinner they have not had hamachi kama which is disappointing since i also brought others with me and told them about that dish. i can see them running out if late during dinner but 3 times in a row is more a sign of them cutting corners. quality of some items are going downhill too like the uni and dried pre made unagi that was inda dry.", 
            "wow, from the minute i sat down it was a great experience. i sat at the bar and it was busy. love being greeted and asked if i want ayce which they knew i did. the chef introduced himself and while i was deciding on my first roll he was busy making me something. he handed me a plate with a roll called no name. its new to the menu and i suggest you try it. it was delicious. and in between me ordering rolls he was making concoctions for me to try. im definitely impressed with the level of service and attention i received. \n\nfrom the server never letting my lemonade get to the south end of the levy. to even though the chefs were busy how my rolls kept coming in a timely manner. and i say go when jun is working, hes a master at the rolls in my eyes. and from the appetizer i had chicken teriyaki i was so engulfed which trying <mark>New Special Roll</mark> i forgot i ordered it til it came out which was quickly as well. the other patrons are more than friendly as well when they are your bar neighbor. i had so many rolls but the no name and the harry potter and the wet dream stood out to me. sad that i went to unlv for 4 years and drove by yama everyday and never went in. im kicking myself because it was yama yummy. \nthey didnt go overboard on rice or sauce. my wasabi and ginger didnt come out right away but thats not enough to deter me. and try the mochi ice cream. i shall be back maybe soon as the next day lol.", 
            "another mediocre sushi place.\n\nit was pretty crowded when we went, so we had to split into two parties to make seating easlier.\n\neverything i had there was just... okay. i didn't really expect anything that great, since we were pretty far inland and in the nevada desert.\n\nyou da ma too! (spicy tuna w/ salmon and spicy mayo) - underwhelming\nsalmon nigiri - not fresh\nalaskan salmon roll - pretty skimpy\n\npoints for having unusual (sometimes suggestive) names for <mark>New Special Roll</mark>.", 
            "my friend and i drove across town to try this all you can eat sushi. the restaurant is small and very crowded. waiting time for us on friday night was 30 minutes. but i definitely will go back. the price is 24$ dinner buffet. i had seaweed salad for appetizer. highly recommend it. the saba fish is ok, i had better. my absolute favorite dish was \"no name\" <mark>New Special Roll</mark>. it has tempura inside and salmon on top with yam yam source wrapped with soy paper. combination of crunchy and sweet and raw texture from salmon. so yummy.", 
            "i know it's unfair to rate a place by it's business, but when the plae can't run nicely when it's busy.. then i think it's fair.\n\ni love yama sushi! as far as rolls, it's my favorite ayce sushi in the city, kaya is second.\n\ni love their <mark>New Special Roll</mark>: <mark>Strip Tease</mark> and wet dream are my favorites.\n\nalso love the seafood salad which is raw fish slices in a spicy dressing.\n\ntheir servers always seem annoyed which is fair.\n\ni only took the star off for their limited waiting area, not having something i wanted in stock, and for their disgruntled enployeees.\n\ntip is to definitely go around opening for an early lunch! \n\nless busy with little to no wait.\n\nalso a plus is their desserts are all you can eat. at least my servers always give it to me.. hmm i'll put the star back :]", 
            "best all you can eat sushi place i have been to in vegas! the best part is it is all you can eat everything on the menu, appetizers, teriyaki, sushi, <mark>New Special Roll</mark>, and dessert for a low price. if everyone at the table gets all you can eat then you can share. great flavors, always fresh. i wouldn't recommend sitting at the bar, you surprisingly have slower service when you do.", 
            "i wish i could give yama 3.75 stars. yama used to be the \"go to\" place for sushi. every time anyone mentioned sushi, yama it was. until the service started going downhill. their food is pretty good. their selection of <mark>New Special Roll</mark> is pretty unique. their palm job is amazing! their roll names are a bit amusing but you have to have a sense of humor. \n\nthe servers and sushi chefs are hit or miss. sometimes your water is overflowing and sometimes your slurping the last drops of your melted ice for 10 minutes. also, the sushi chefs have a horrible habit of ignoring you if they are in the middle of doing a service order, even if you stare right at them. normally i am pretty patient when it comes to ordering at the bar, however a simple \"i'll be right with you\" would be plenty.\n\non the plus side, they have a great ayce price, which more than pays for itself when you add up the individual roll prices. they also will make you half rolls too, which is my favorite. this way i can try a whole bunch of rolls without filling myself up. they do tend to cover their rolls in a good amount of sauce so if this turns you off, make sure to ask for it on the side. \n\nall in all, i do go back to yama, but not as often as i used to. step up the service guys!", 
            "the all you can eat special\nhand, half or cut rolls + <mark>New Special Roll</mark>\nfirecracker", 
            "this is one place i just have to go every time i'm visiting here in lv. if you are into big spacious restaurants, this isn't for you. you sit pretty close to your neighboring tables and are easily observed. it's loud in here, but keep in mind, it's always busy and especially during the lunch hour- but you'll still have more than enough time to enjoy all the goodness this place has to offer since they are super friendly and fast!\n\n\nyou can't go wrong with the all-you-can-eat option! i especially prefer this since it allow me to order all kind of different sushi specials. the nice thing about it is that you can order a \"half\" order of any kind of <mark>New Special Roll</mark> they have to offer. meaning you have more room to try something else. plus you still get the great perks of ordering meat choices of chicken or beef teriyaki or korean short ribs as well. \n\nthe staff is super friendly and helpful if your not sure on what to order. the sashimi salad is sooo yummy! i highly recommend! some servings of particular orders may seems small, but that's ok, it allows you to venture out and try other things on the menu (all you can eat menu). regular items that are not ordered from the all you can eat menu are of the normal portion of japanese bento box style. \n\nquality of the food is great. fresh sashimi, fish and seafood found here in lv? yes!!! i spoke with the owners and chef a few times and they get daily shipments of fresh seafood. you know what that means, this place is no joke! \n\nprice? more than reasonable for what you get. if your on a budget or just not looking to spend over $25 for a lunch or dinner, i say keep more $$$ in your wallet, avoid those corporate buffets at the hotels on the strip and enjoy some great japanese/korean food in a not so busy environment. \n\nthere is plenty of parking since this is located at a strip mall next to albertson's and cvs. you can't go wrong!!!!", 
            "i like creative cut rolls and that is the one thing i did not like here.  they have over 20 specialty rolls, but after reading the descriptions it seemed like 3-4 rolls with one thing changed to make it a <mark>New Special Roll</mark>.  \nour service was great and everything was fresh.  the nigiri is the best i've had from an ayce sushi restaurant.  nice big fish piece of fish and just enough rice.", 
            "when you get a hankering for some sushi, you ultimately know it is going to be an expensive experience. however, there are some spots that offer an all you can eat (ayce) experience that can runs the gamut of being good or downright terrible. while the service is a bit interesting and the ambiance somewhat confining, their well-made sushi rolls more than make up for its shortcomings and keep me coming back for more.\n\nthe menu certainly offers your normal menu that you would expect along with their <mark>New Special Roll</mark> that define a sushi establishment. the chef specials are amusingly named and certainly offer an array of flavors. the man whore roll was interesting with a spicy salmon, spicy tuna, and cream cheese and certainly a good starting point. the wet dream was alright but essentially a california roll, while the son of the beast was certainly a good offering of sweet and savory, spicy and mellow. the fresh fish was pretty good and well cut, while the rice was nicely rolled.\n\nservice was reasonably attentive and water glasses rarely went empty while the sushi arrived in a nice progression and the wait wasn't too excessive. i'd suggest ordering more when you have a roll left on the table. it certainly was loud and a little rambunctious, but i think that was part of the charm. \n\ntables are rather close together so you might be overhearing the table next to you. probably not a good idea to discuss a business merger or chat about the insider stock tips you got. \n\nplan to make reservations otherwise you might be in for a wait. we waited about 20 minutes for our table, which wasn't too excessive but we didn't go on a peak night either. you'll thank me for my suggestion when you wait in the 105 degree heat. \n\nall in all, you definitely get a good value for your money and definitely one of the better options for affordable and good sushi.", 
            "tonight clayton and i went out for some ayce (all you can eat) sushi with big appetites so that we could try as many items as possible. we do sushi like this pretty frequently and find that having a big appetite increases the value of a dinner that generally runs upwards of $50 dollars for two. yama sushi's prices for ayce are within the average that you would find in most las vegas sushi restaurants, but we think the quality of the food and experience are above average, so you feel as though you are getting a deal.\n\ndinner hours can be very busy. the restaurant itself would probably be considered small (between 50-75 seats). getting there early or planning on a later dinner will ensure that you are seated right away. we arrived at 8:15pm on a wednesday night and waited about 15 minutes for a table. we noticed that at about 9pm it appeared that there would be no wait.\n\nservice has always been polite and very attentive. if you sit at the bar there are plenty of chefs to take your order and chat with as you dine. also the restaurant is a little cramped for space so we always sit at the bar. less noticeable.  the chefs are quick as well. the atmosphere behind the bar is light, accentuated by the chefs colorful uniforms and the floral art that adorns the walls. it leaves the customer feeling relaxed and ready to enjoy a great meal.\n\nour drink orders were taken quickly after being seated , and we chose a few appetizers to get the ball rolling on our evening. \n\nhere's a breakdown of some of the items we selected this time around, for those of you that have never gone to a sushi bar, or who are perhaps curious about some items they've never tried. \n\ngyoza- we always start with a gyoza  (fried dumpling) appetizer. it was a delicious way to begin. crispy and savory. \n\nsalmon kama- this item took a long time to come out of the kitchen, but was very tasty. it was a fairly large portion of salmon that had appeared to be baked. less of a traditional sushi item, but that is part of what is great about ayce. nearly every item on the menu is available for you to try, and the gf and i make a point of trying a few new items each time. for a cooked salmon dish it was excellent. cooked well. good flavor. accompanied by a sweet brown teriyaki style sauce for dipping the flaky pieces of fish.\n\nsushi salad (ordered creamy)- great light appetizer. fresh tuna and salmon atop cucumber slices and what i believe is a mild radish that has been turned into a fine sort of angel hair. i should be more certain about this, but some dishes i don't question i just stick them in my face knowing it is going to awesome again.\n\nyakitori- essentially an asian style chicken kebab. very tasty, and a good item for those that tag along hoping to avoid the sushi. chicken is very tender and seasoned well.\n\nbbq ribs- another appetizer. apparently we were in the mood for them. this would be another great choice for a non sushi eater. a small portion, but seasoned well. both sweet and savory. the meat is tender but fatty. a great little appetizer.\n\nsnow in vegas-this is a great roll for those that enjoy something relatively light with a spicy kick but also a sweet side. use of different sauces makes these characteristics come through. was my favorite of the night.\n\nyama crunch- shrimp tempura, of which there are many options at yama sushi. good flavor and texture. the crunch is sweet and mixes well with the more savory tempura inside.\n\nellen roll- big bites. lots of different elements going on on this one. made with soy paper which adds a unique flavor. spicy sauce on top is great.\n\nsmoked salmon and salmon sashimi always comes out super quick and fresh. great color and texture.\n\noverall: always happy with flavor of <mark>New Special Roll</mark>. appetizers come out hot. staff is attentive and polite. atmosphere is relaxed. price is fair for quality. always a great experience, if you love sushi, you have to try this spot.", 
            "this place has great potential, but they give you soooo much rice!!! they literally packed it on, so we got full on our first round. the quality was surprisingly very fresh for ayce and includes many <mark>New Special Roll</mark> which were tempting to order, but after just one roll, we just couldn't do it.\n\n my favorite item i usually order  is a crunchy hand roll and they got the crispy part done right, but it was overwhelmingly drenched in eel sauce resulting in it being a sickeningly sweet and overloaded rice roll. the service was definitely lacking, you get ice cream or mochi at the end of you meal, and it took 20 minutes for the check and another 20 just to get our green tea ice cream. 40 freaking minutes to get out of there despite reminding two different waitresses 4 times!!! throughout our meals, we had to request for more water, our rolls, and napkins several times. so the price and quality of the fish is decent, large selection of <mark>New Special Roll</mark>, but if you want to get full, just order one hand or <mark>New Special Roll</mark> and you're set.", 
            "yama is the sushi place that made me love ayce places in vegas. they used to be smaller but i think they've expanded their space. i actually haven't been here in years, but my friend and i decided to come here for lunch. a couple of things you should get:\n\nseafood salad: fish galore! tired of rice? this is a must! it also has a \n\nfried muscles: you can just never go wrong with this.\n\nall of the <mark>New Special Roll</mark> kind of taste the same, don't get me wrong they're still delicious. i enjoyed getting just maybe 2 rolls an trying other stuff on the menu. \n\nturn off about the place thought? the waitress and waiters kept switching. a bunch of people would ask us for orders so we never knew who to tell or what to tell them. it's nice that they're attentive, but maybe just a little too much.", 
            "it is pretty good, and it is mostly packed throughout the day.  firecracker roll and other <mark>New Special Roll</mark> are awesome.  a lot of selections.  seafood salad - spicy is awesome.  been to the sushi bars numerous times.  would highly recommend...also, man whore roll is fabulous! all sushi is awesome, and this all you can eat menu is one of the best in town.", 
            "the seafood salad is amazing!  the sushi i thought was 'meh'.  while the names of the <mark>New Special Roll</mark> sound interesting, the taste was pretty mediocre.  i'd come back for the seafood salad in a heartbeat though!", 
            "this is the hidden jewel in vegas. the diamond in the rough. a lot of out of towner's don't know about yama because it's off the strip. don't waste your money at any other sushi spot in vegas. eat at yama once, and you'll never wanna eat at another sushi spot again! $25 for all you can eat, tons of choices, great staff. all your typical appetizers, all your typical rolls, sushi, and sashimi. but what puts yama above all the others are their <mark>New Special Roll</mark>! many tasty selections to choose from. you can order by the half or full roll, and most of the rolls can be rolled into the seaweed cones by request (son of the beach hand roll!!!). \n\nhands down, yama is the best sushi spot in all of vegas. don't go anywhere else to satisfy your sushi fix. you'll regret it!!!", 
            "after literally getting up and leaving a \"modern\" sushi joint, which has made me despise the word tapas, we went to yama sushi hoping to salvage our dinner date.  for a monday night this place was full, which was a good sign of tasty things to come.  the wait was quoted at 25 minutes, but it took only 10 to get seated.  although the all you can eat sushi was tempting, we weren't starving and opted to have 2 <mark>New Special Roll</mark> that weren't part of the ayce menu and an appetizer.  i highly recommend ordering the sun of the beach roll.  another highlight was the staff, which was really friendly and attentive during our meal.   i also have a basis that separates good service from great service, which was the refilling of our drinks.  our cups never went below the halfway mark, which is a bold statement but 100% true.  if you're ever in vegas and need a sushi fix, this place is a must.", 
            "i was trying to come here last year with some of my colleagues from out of country but they were too impatient to wait and went to the place next door which we regretted big time.  anyways we came here sunday may 4th around lunch time ending the weekend for my cousin's 21st birthday bash.  it happened that he found this restaurant using the yelp app and i remembered that i tried coming here before.  i knew it must have been a good sushi spot since there was a line outside the door when we tried coming during dinner last time.  there were 6 of us and the hostess was quick to get us seated even though the place looked pretty packed but no line outside the door this time.  they ended up seating us on the left side near the front.  it kinda looked like a mini room and there were 2 sets of tables in that little area enough to sit the 6 of us and these cute korean ladies on the next table.  there was 1 small tv in there..it was playing inception and i remember another tv in the larger dining area airing the basketball game.  i didn't get to see the other room since this is our first time being in there.  our waitress' name was ellen i believe.  she was quite the comedian.  she was quick to give us the popular rolls and side orders.  the name of the <mark>New Special Roll</mark> are hilarious...<mark>One Minute Man</mark>, man whore, wet dream, son of the beach, <mark>Happy Ending</mark>,   i freakin love the names.  we decided to do a.y.c.e. just as the ladies did next to us....my brother asked them that's how we knew.  we ordered the sashimi salad for an appetizer.  i would recommend that to anyone.  there was almost 0 greens in that salad.  it was mostly just the sashimi and the special yama sauce that they wouldn't sell to us even if we begged them to.  we ended up ordering 4 more orders later on of that deliciousness.  we also had the <mark>New Special Roll</mark> i mentioned above and some nigiri as well.  uni was nice and fresh.  we'll definitely hit this spot up again and again when we come to vegas.  only thing i regret is not opening my mouth when the ladies next to us talked about visiting san diego soon...lol.", 
            "this is the best sushi place in las vegas hands down. i make it a point to eat here at least once a month. it's located off the strip so it's pretty much locals only. this is nice because you don't have to deal with the drunk tourists who wander around. it can get extremely crowded, and if you have a large party you will probably have to work. it's worth it!  the rolls are delicious and fresh. if you like uni, this is the place to go. you can only get one order per person though so make it count!\n\nfor rolls, i recommend the man whore and salmon loves lemon rolls. they do have a lot of choices though, so there is something for everyone. i try to try a <mark>New Special Roll</mark> every time. you can even order a half roll which can be the perfect size when you are starting to get full! \n\ni'm sad that i moved away from las vegas and won't get to eat at yama. but i'll make sure to stop by every time i'm there!", 
            "i love sushi  (but we don't get out as much these days) and when my hubby asked me what i wanted for my special birthday meal, this was my number one choice (we'd never been here but i'd seen this place on yelp and heard good things from many people). hubby enjoyed it too, because he said he'd like to come here again! our little one also liked his chicken and rice plate (the server suggested this when we learned that they didn't have fried rice, his favorite). \n\nlots of choices on the two-sided menu- ayce includes side dishes and appetizers, but not sashimi (no biggie) and the rules (order small, luckily, you can order half-rolls, which we did; no sharing unless everyone is ayce) are listed on the front side of the menu. i tried the spicy tuna roll, 007 roll, and ordered several different shrimp rolls, but my favorite one was the <mark>Yama Crunch Roll</mark>. on the salad side, i loved the seafood salad- it was such a good portion of tuna, salmon, yellowtail, and octopus. i am definitely getting that again! we also had beef teriyaki (excellent), edamame, and gyoza (tasty, but i don't think hubby liked them because they weren't sticky, but a bit on the crunchy side). the <mark>New Special Roll</mark> are on the back side of the menu. didn't reach that side, though, because we got full. i didn't want to overdo it. i was satisfied though, and we were also planning to have ice cream later on, too, elsewhere. \n\nalso got a nice presentation for my birthday- two sliced mochi ice cream (mango flavored) with a scoop of green tea ice cream in the middle accompanied with a birthday song and a lit candle. aww, how sweet.\n\nit wasn't crowded, but one of the servers said that dinner is crazy busy. (good to know!) lunch is probably better because of that. ($20.95 for lunch ayce). \n\ndecor is elegant and pretty; and also nicely decorated for the christmas season. hubby was surprised at how nice it was inside. it's not big, but it's not hole-in-the-wall, either. \n\nservice was excellent. and really appreciated the suggestions they gave on the sushi rolls. everyone there is your server. everyone's very nice, too. empty plates were quickly taken away.\n\nthe website needs a bit of an update. prices could be listed on there, and the entire menu of sushi, would help out a little, too. needs some attention. when you click on some items, a message appears on the screen, \"this page is currently under construction.\"  \n\nyes, we plan on coming back here for lunch.", 
            "yama is my go-to sushi spot. dancing in the sheets and no name are must tries! i rarely go anywhere else because $21-$25 for ayce sushi (depending on whether it's lunchtime or dinnertime) is such a great deal.\n\nthe place is always packed, but i have never been disappointed with the service. occasionally a waiter will forget a roll, but when you're ordering 5+ rolls at a time, what do you expect? they're so quick, you can have a <mark>New Special Roll</mark> out in just a few minutes. \n\ni would highly recommend this place to anyone looking for a yummy ayce sushi spot.", 
            "this place popped my ayce sushi cherry so it's always had a soft spot in my heart.\n\ni'm not a big fan of their nigiri because they put more rice than what i'm used to. but their rolls are good. and you can order half orders of most of them if you want! \n\nfavorite rolls:\n<mark>Strip Tease</mark>, son of the beach, man whore, dancing in the street and pretty much any of the rolls on the <mark>New Special Roll</mark> menu\n\ni also really like their seafood salad. it's basically a sashimi salad and it's just so good!"
        ], 
        "dish_name": "New Special Roll"
    }, 
    {
        "text": [
            "a couple of years ago, a friend of mine told me that this place has the best sushi and the freshest fish. why the heck did it take me so long to finally try it?\n\nsimply put, yama sushi is awesome. you wouldn't know it from the outside. it's in a typical vegas strip mall near the corner of flamingo and maryland. walk inside and it just automatically feels like you're in for a treat. the decor seems very traditional japanese. it looked crowded, but we were seated immediately.\n\nso how's the sushi? amazing. it definitely lived up to expectations. we tried not to go too crazy, but i think we incurred some decent damage.\n\n* miso soup\n* edamame\n* seaweed salad\n* seafood salad\n* soft-shell crab\n* salmon kama\n* unagi\n* ikura with quail egg\n* <mark>Yama Crunch Roll</mark>\n* roger roger roll\n* soft-shell crab roll\n* dancing in the sheet roll\n* mochi (strawberry, mango, and chocolate)\n\na definite must-order is the seafood salad (limit one per person). it's basically a plate of sashimi stirring in some mild or spicy dressing. i know of no other ayce menu that offers sashimi. pretty much everything we ordered was delicious. the only thing i won't order again is the soft-shell crab appetizer. breaded in panko and deep-fried, it's just a little too oily and unnecessary. i'll stick with the sushi and salads next time.\n\ni'm not sure if we got lucky, but the service is incredibly fast. since we were only an hour out from closing time, we started marking things on our paper menu as soon as we sat down. i went out to get my camera from the car, and as soon as i got back, it seemed like items just kept coming at a rapid pace. fortunately, i eat at a rapid pace!\n\nby the way, at $22.95 for dinner, this is one of the cheaper ayce sushi spots. not by much, but it's worth mentioning.\n\ni've said before that i'm really not that picky when it comes to sushi. lately, i've been holding back on my five star ratings. yama sushi deserves a five. with fast service, delicious and fresh offerings, and a very competitive price, it just does the ayce thing right.", 
            "this is my roommate's favorite ayce sushi in town, and i'm always happy with a good <mark>Yama Crunch Roll</mark>. my friends adore the seafood salad and no-name roll.", 
            "like most of the reviews mention this place is small and it can get crowded.  we didn't have to wait on weekday afternoon and got there about an hour before it switched over to dinner.  it did fill up rather quickly after that and at one point a room divider almost fell on me. but after experiencing yama sushi i really can't imagine going anywhere else!  the price is more then fair for ayce and the entire menu is fair game.  the standouts for me were the seafood salad, <mark>Yama Crunch Roll</mark>, superman, wet dream.... seriously everything was good!  i can't wait to go back.   not to mention the servers are very attentive.  water always refilled, plates taken away quickly and always ready for our next order.", 
            "i *hated* sushi until one fateful night i was dragged to yama sushi.\n\ni hadth seafood salad and i thought it was yummy. my friend informed me that it had raw fish in it, and encouraged me to try the <mark>Yama Crunch Roll</mark>.\nsince then, i have been hooked on sushi in general. what keeps me coming back to yama sushi is how good the rolls are! almost every roll is like yum omg. the service is really good too.  i also like all the appetizers and the gyoza. overall best sushi place for me!", 
            "yama.. you never disappoint and tonight was no exception! the best customer service, friendliest waitresses and awesome sushi chefs! i'm thankful for the ayce menu because i'm able to try something new every time but my favorite is always the <mark>Yama Crunch Roll</mark>.", 
            "before a business meeting at a local bar, my best friend and i decided to have a lunch date at a new sushi joint to help nurse our hangovers.  i did a little research on my yelp app and came across this place.  people seemed to really like the place, so i was curious to check it out as well.  \n\ni've been to this strip mall many times.  for albertson's, for the nail salon (eyebrow wax), for chase bank.  it's a cool area, full of businesses.  it's located on flamingo and maryland pkwy.  some close businesses that i frequent:  buffalo exchange, the garage, seafood city, target, etc.  it's a great neighborhood.  i enter the location and i'm super surprised to find a large venue.  a very small hostess area, but the place has a couple of rooms attached to the big dining area.  we were taken to the room on the right side of the restaurant.  super cute!  the focal point is the sushi bar.  there's a background montage of flowers, all lit up.  the recess lighting that shines on the bar and cloth picture panels makes for a very enlightening focus.  i really liked it!  the small two top tables were separated with a little japanese folding curtain to create a more intimate setting for me and my lunch date. \n\nas in all sushi joints, i always get the ayce (all you can eat) special.  since we can after 3pm, we had to pay the dinner price of $23.95.  i also have some very strong feelings and practices when it comes to ayce.  i always stick to the side dishes, appetizers and nigiri so i can get more for my buck.  here's what i got, grouped based on my preferences:\n\nthings i liked:  yellowtail nigiri (fresh and less of a fish flavor), miso soup (perfect for monsoon weather), seaweed salad (lovely taste of the ocean), hamachi kama (collar of the fish, grilled, full of marbleized meat and served with a soy dipping sauce), deep fried mussels (tempura battered and soo good!) and as an exception, the <mark>Yama Crunch Roll</mark> (tempura shrimp roll with eel, shrimp, avocado layered on top.  sooo flavorful)\n\nthinks i didn't like:  gyoza (it was nicely fried, however the filling was not as good as i've tried.  more filling than meat, it seemed), chicken teriyaki skewers (tomatoes, onions and white meat chicken.  not as good as other sushi joints.  the chicken was a bit dry) and the bbq ribs (marbleized and flavorful but i prefer more of a grilled rib.  there were not grill marks and it just seemed a bit rubbery)\n\nthe great thing is that it all still great.  i would definitely be back for more servings of the hamachi kama.  i don't often find myself in this area, but when i do, i at least know there's a great sushi joint!", 
            "after hearing that there is no good sushi in las vegas due to a lack of ... oceans ... i decided to venture out into the desert wilderness a 5 min drive down flamingo road from caesers palace to the restaurant.  the place was bustling with patrons, waiting in every available seat and standing inside and outside waiting for a table.  obviously, this place was well known and popular.  a good sign indeed.\n\ni went inside and was miraculously seated at the bar without any wait (birthday luck i guess).  i embarked on the best all you can eat (ayce) sushi experience ever.  fresh fish, balanced proportion of rice to fish (an ayce rarity) and the most expedient and friendly sushi chefs.  i tried the <mark>Yama Crunch Roll</mark> and something with soy paper, soft shell crab, scallop and crunchies that melted in my mouth. let's not forget the 4 orders of mouth wattering albacore, my two handrolls, and a reorder of the <mark>Yama Crunch Roll</mark> as a handroll.  when it was all done i even got mochi ice cream and regular ice cream.  ayce + dessert in the desert was a rare bonus.  for $23 bucks for dinner, i will be coming back here everytime i come to vegas.\n\nthe service staff were so unbelievably attentive and nice; going above and beyond.   this place deserves 6 stars.  i'm going to dream about these rolls now; don't go anywhere else, this is the real deal.  yamazing!", 
            "boy was i a <mark>One Minute Man</mark> while having my <mark>Happy Ending</mark> after the <mark>Strip Tease</mark>. nooooo! i'm not talking about crazy horse iii. sheeesh, thats another review. haha.\n\nwhat i'm talking about are the signature sushi rolls @ one of my fave ayce sushi restaurants, yama. that's just 3 of many different style of sushi rolls offered here. love this place, and yes they are always busy, so when you come know your stuff. learned the hard way 5 years ago when ordering taco thinking it was a japanese style <mark>Yama Crunch Roll</mark>, and it ended up being an octapus salad, so yes know your stuff. \n\ncustomer service is always good, friendly staff, but because of it being so busy, they tend to forget about you at times, so maybe more friendly staff to move things along more smoothly may work. \nambience is just right, with their expansion it evens it out a lil.  if you do happen to have a large group, they do have an area with lcd tv that can seat up to about 10-15 people. in there you get your own server, but i believe you may have to call to reserve this room.\n\nat only $22, you can get your hands on all your favorite sashimi style, hand rolled, cut rolls and appetizers. all your favorite assortments of fish including yellow tail, salmon, tuna, uni, albacore, and white tuna. always fresh here with a good rice to fish ratio. you are limited to some of their rolls or sashimi to 2 per person, like the sweet shrimp with fried heads or seafood salad, but when ordered with a group, well satisfying. \n\noverall, a great experience for that sushi craving without having to dig deep in your pockets. come hungry, and for those busy days, come patient. otherwise, get your sushi on at yama.", 
            "i love sushi  (but we don't get out as much these days) and when my hubby asked me what i wanted for my special birthday meal, this was my number one choice (we'd never been here but i'd seen this place on yelp and heard good things from many people). hubby enjoyed it too, because he said he'd like to come here again! our little one also liked his chicken and rice plate (the server suggested this when we learned that they didn't have fried rice, his favorite). \n\nlots of choices on the two-sided menu- ayce includes side dishes and appetizers, but not sashimi (no biggie) and the rules (order small, luckily, you can order half-rolls, which we did; no sharing unless everyone is ayce) are listed on the front side of the menu. i tried the spicy tuna roll, 007 roll, and ordered several different shrimp rolls, but my favorite one was the <mark>Yama Crunch Roll</mark>. on the salad side, i loved the seafood salad- it was such a good portion of tuna, salmon, yellowtail, and octopus. i am definitely getting that again! we also had beef teriyaki (excellent), edamame, and gyoza (tasty, but i don't think hubby liked them because they weren't sticky, but a bit on the crunchy side). the <mark>New Special Roll</mark> are on the back side of the menu. didn't reach that side, though, because we got full. i didn't want to overdo it. i was satisfied though, and we were also planning to have ice cream later on, too, elsewhere. \n\nalso got a nice presentation for my birthday- two sliced mochi ice cream (mango flavored) with a scoop of green tea ice cream in the middle accompanied with a birthday song and a lit candle. aww, how sweet.\n\nit wasn't crowded, but one of the servers said that dinner is crazy busy. (good to know!) lunch is probably better because of that. ($20.95 for lunch ayce). \n\ndecor is elegant and pretty; and also nicely decorated for the christmas season. hubby was surprised at how nice it was inside. it's not big, but it's not hole-in-the-wall, either. \n\nservice was excellent. and really appreciated the suggestions they gave on the sushi rolls. everyone there is your server. everyone's very nice, too. empty plates were quickly taken away.\n\nthe website needs a bit of an update. prices could be listed on there, and the entire menu of sushi, would help out a little, too. needs some attention. when you click on some items, a message appears on the screen, \"this page is currently under construction.\"  \n\nyes, we plan on coming back here for lunch."
        ], 
        "dish_name": "Yama Crunch Roll"
    }, 
    {
        "text": [
            "recently tried yama sushi for the first time during a visit to las vegas. i used the mobile version of yelp to find the place, but still had a bit of trouble since it's part of an outdoor shopping center with several establishments and the buildings are far back from the street. if you're looking for this place, look for the shopping center with the albertsons on flamingo and maryland and you'll find this place.\n\ninterior of the restaurant is small, but very clean. tables are close together, but the sushi bar was packed so i sat at a table. there is a laminated menu with the <mark>New Special Roll</mark>, and a paper menu that your server will bring with the more standard fare. ayce with tax is just shy of $23.00. a fantastic deal.\n\ni was very pleased to see that half-orders were available for all rolls, even the special ones. this meant that since i was the only one eating sushi in my party, i was able to try several rolls. while i tried to pick rolls, i had the albacore sushi (just ok) and the salmon sushi (pretty good!). both were served with large pieces of fish and just enough rice. i don't think i'd get the albacore again, there was something about the texture i didn't like.\n\nfirst up were the \"man whore\" rolls: spicy salmon roll baked w/ a mixture of spicy tuna and cream cheese on top and served with spicy mayo and eel sauce. these were just okay. the baked topping was dry, possibly over-baked? not sure. so, the man whore wasn't fantastic, but it wasn't awful, either.\n\nnext were the \"yama crunch\": tempura shrimp and crabmeat roll with a crunch layer on top. these were pretty tasty. they were served with a sweet sauce which was pretty good.\n\n<mark>Kai Roll</mark>: eel, cream cheese, avocado and spicy tuna roll w/ spicy tuna and avocado outside. again, there was a sauce served with these rolls that was pretty good. i would have gladly had more of these and skipped the man whore rolls.\n\nlast, but not least, the \"wet dream\". omg. delicious. these are a california roll baked with cream cheese and shrimp on top with a sweet yam sauce and eel sauce. did i say delicious? these were the perfect end to the meal.\n\nservice was fine. the place was very busy, but i barely would finish a plate of 4 pieces and the server would come around and ask if i wanted something else. it's also very noisy, but that's okay as long as the person next to you doesn't have an annoying celphone ring that goes off ever 2 minutes or so. ahem.\n\ni would definitely go here again if i'm with non-sushi diners. otherwise, i'm still a fan of sushi on trop .. for now.", 
            "went to vegas for the weekend, drove around the strip looking for a good sushi place...saw this restaurant in a strip mall, hoping the sushi was better than the restaurant looked. it was 3:00 on a saturday and the place was packed, which instilled confidence. we were seated immediately and had our first roll within 10 minutes. hubby had all you can eat, i had the <mark>Kai Roll</mark>...loved it! great service, awesome sushi.", 
            "this is without a doubt one of my favorite sushi spots i have ever been to.  i come here at least twice a month.  i am not a big fan of sushi if it isn't all you can eat since i am a huge eater.  yama offers all you can eat for between $22 and $25, depending on the time of day.  i prefer to come here with a large group since they have so many delicious rolls.  this allows you to pick one or two pieces off each roll and indulge in dozens of assortments of sushi.  \n\nfavorite rolls at yama:\nwet dream, you the man 2, yama crunch, spider roll, snow in vegas, <mark>Kai Roll</mark>, and unagi.  \n\nyou have the option at the end of your meal for mochi or ice cream.  both are delicious.  \n\nwarning:  if you are claustrophobic, do not go to yama.  this has to be the most tightly packed restaurant ever.  it always has a wait, so expect during busy time to arrive about 30-60 minutes before you are waiting to sit down.  food preparation time is fairly quick, considering how busy it is."
        ], 
        "dish_name": "Kai Roll"
    }, 
    {
        "text": [], 
        "dish_name": "Combination Roll (c)"
    }, 
    {
        "text": [], 
        "dish_name": "Combination Roll (b)"
    }, 
    {
        "text": [], 
        "dish_name": "Combination Roll (a)"
    }, 
    {
        "text": [
            "all-you-can-eat sushi...what a concept!! this place was awesome. went there for the first time last week. other than the long wait for seats yama sushi is great. do the all-you-can-eat (roughly $25/person dinner)...the sushi is freshly made when you order. a lot of custom sushi rolls with creative names like \"<mark>One Minute Man</mark>\" and \"man whore.\" go in a group and order as many rolls as you want because you can all share. they say they'll charge you if you don't finish everything but i don't think they really do. \n\nhighly recommend this place!", 
            "went here around 9:30pm on a sunday night and the place was pretty empty.  the all-you-can-eat sushi ends at 10:30, so we got there just in time to enjoy the sushi before they cut it off. \n\nwe sat at the bar, so we always had super fast service with sushi. the sushi chef was funny and made great rolls.  between my friend and i, we pretty much tried most of what was on the menu, and most of it was really good.  the rolls are on the smaller side, which was kind of nice because you dont have to eat a ton if you dont like it, and you get to try more rolls.  the rolls are creative and have funny names like \"wet dream\" roll and \"<mark>One Minute Man</mark>\" roll.  the fish quality is pretty good, and all seemed fresh. \n\nanother plus, is that you can order anything on the menu.  soup, salad, tempura, gyoza, you name it...you can order it.  mochi ice cream is even included! bonus points!! \n\nid have to say that this isnt the best sushi i've had, but for an all-you-can-eat place, its definitely on my list of places to go again.", 
            "i contemplated punching my sister out when we rolled up to yama, which looks like a run of the mill sushi joint placed in a nondescript shopping center off the beaten track of the strip. she's a nyc transplant so i trusted her judgment of good, quality sushi but i was a little apprehensive when we drove up and saw degenerate/hobo looking types wearing cowboy hats and smoking cigarettes, standing outside of sally's (or something or other) gaming spot, next to yama. she swore it was delicious and convinced me to ignore everything else from the outside. the area is a little run down but don't be fooled, yama is a total gem. the sushi is...just...so freakin' good! super attentive waitstaff who are constantly running around to see what you need. loved the salaciously named rolls like \"<mark>One Minute Man</mark>\" or \"sex on the beach\" - so vegas! my personal favorite is the firecracker. i must admit, many rolls are slathered in sauces but that's how i like it. and, how on earth do you beat $23.99 for all you can eat sushi??!! total yum. and rumor has it, yama purchases their fish from the same wholesalers that strip sushi restaurants use, and yama is a fraction of what you would pay elsewhere. if you're in vegas, and you love sushi, you must go (just ignore the cheesy, mismatched d\\u00e9cor!).", 
            "ayce sushi only. sashimi not included. the place is packed even on a weekday. there is a wait for a table lucky for me there is a slot for me at the bar.started off with the seafood salad which is made up of sashimi slices of tuna and salmon. this was so good thati wanted to get another one but then i had to control myself since there are a whole lot more creations i gotta try! i had the superman,one night in yama and <mark>One Minute Man</mark>. every serving was unique and very tasty.\nthey got a clause underneath the menu that everything you ordered has to be eaten or else......", 
            "my new hubby and i like to try and venture out of the strip when we stay in vegas.  with the help of fellow yelpers, we discovered yama sushi which is on flamingo, about 3 miles east of the strip.  as we sat down at the the sushi bar, the lady who was sitting next to us said, \"this place is awesome!\"  for the price of $22.95, you get all you can sushi, rolls, appetizers, soups, salads, ice cream, and mochi ice cream.  the names some of the rolls are hilarious, such as:  <mark>Happy Ending</mark>, man whore, the <mark>Strip Tease</mark>, wet dream, <mark>One Minute Man</mark>!  we tried the <mark>Strip Tease</mark>, which has shrimp tempura, crab meat, cream cheese, eel, avocado and crunch on top.  it was delicious!  what is nice about this place is that you can order any roll whole or half or in a hand roll, which helps to minimize waste.  i would also recommend sitting at the bar, for faster service.  i recommend this place to my fellow yelpers who want good sushi, at an affordable price.  :)", 
            "how much do you get for $23 dollas? \nany-ting you want. \nanything? \na n y t i n g. \noh, so hungry, oh oh so hungry, oh so hungry, me love you long time!\n\nfor a minute, you might think you're in a whore house in disguise. i sure as hell did. this is vegas after all. but no worry, this place is legit.\n\nthey just know that sex sells. especially when it's associated with fish. raw fish. or not so raw fish. they don't even try to be subtle about the sexual themed specialty rolls. it's just like \"<mark>One Minute Man</mark>.\" \"hand job.\" \"wet dreams.\" those dirty minded sushi chefs must be hard at work. (wait for it...) \"that's what she said!!\"\n\nall kidding aside, yama is perfect to eat at with a group. order one of each of the in-yo-face sexually themed rolls to share between you. everything's part of the all you can eat price. starters, appetizers, standard rolls, special sex-themed rolls, soup, entrees, desserts! \n\nthe sexy time rolls are good, but super rich and lubed up in creamy sauce and mayo. which is ironically appropriate. you definitely have to share these. the real sushi rolls (as in raw) are fresh and light. seaweed salad was a good starter, and the green tea ice cream topped off a climactic lunch. \n\nyama-zing. it's definitely worth more than just a one night stand. i'll be back for more next time i'm in town. see you soon, yama baby. lol.", 
            "one of the best reasonably priced sushi places i've been to in vegas! a couple college buddies of mine brought me here for the first time several months ago, and ever since i've been hooked!\n\nthe quality of the sushi is excellent! while many of the meal item names are a little cheesy and racy (<mark>One Minute Man</mark>, hand job, wet dream!), there are some very interesting dishes that not only taste delicious, but also yama sushi goes to the length to make their dishes look like you're eating at a high scale sushi bar. \n\nthe times they have went have been very busy, but typically we wait no longer than 15 minutes each time to be sat. service is friendly, quick, and the best part is that the service is organized and the waitresses are very sharp with remembering bulk orders.\n\nlove, love, love! this has to be my new bread and butter sushi bar to go on a regular basis. :)", 
            "ate at yama sushi today. they were wonderful in accommodating our large party. i had their lunch ayce. it was a little pricey for lunch, but they had sashimi (seafood salad). it came with pieces of tuna, salmon, hamachi, and octopus + sauce on the side. their rolls were pretty good. a little too saucey for my taste. their \"no name\" roll was good as well as the man whore and <mark>One Minute Man</mark>. \n\ni would definitely eat there again. it gets a little busy around noon so i would suggest going after 1 for lunch.", 
            "no name & <mark>One Minute Man</mark> = heaven.", 
            "be warned, this place is busier than a church on christmas.  a whore house on new years.  a vd clinic on the day after valentine's day... it doesn't matter.  the service is pretty spot on.  if you order half rolls (4 pieces), 4 types at a time, you can constantly have food on your table.  \n\ni totally fell is love with a few of these rolls.  the firecracker and the '<mark>One Minute Man</mark>' are the best.  the 'snow in vegas' is pretty legit too.  it was a little disheartening to find out that the sapporros are $6.50 a pop.  we had two, in addition to the sodas, so that's a nice surprise when the bill comes.  other than that, the $50 for all you can eat goodness is worth the price... and the wait.", 
            "i've been here a couple of times and have enjoyed both the food and ambience.  the sushi is pretty decent, nothing \"wow,\" but fair for a joint so close to the university.  i like the high energy of the place: it's pretty small, but yama packs in a lot of people into that small space....like sardines, <mark>One Minute Man</mark> say.  on my last visit, my friends and i ordered the manwhore, the spicy salmon roll (forget the name), chicken teriyaki, and a few maki rolls.  all were served fairly quickly and the rolls looked fairly fresh, not too much rice and a decent amount of fish.  \n\nthe ayce deal is probably a great one for those with bottomless pits for stomachs.  i'd love to do that, but alas!, i have a limited capacity in my tummy.  \n\na solid place for one's sushi craving.", 
            "the no name roll & sun of the beach!\n\nthat is all you need to know, just kidding. i love this place so much that i will even wait in line for an hour just so i can come in and grub at this ayce sushi joint. out of all the places that i have been to in las vegas, this place has definitely been the best. it is on a first come first serve basis so if you are planning to come as a big group for dinner time then make sure someone shows up first to put their name on the list. wait times range from 30 minutes to an hour and a half when they are really busy. more if you have a large party. i wish that they would expand so that more people are able to come feast on their delightful, heavenly sushi! so.. beware of you are claustrophobic because everyone is packed in there like sardines in a can. i fell in love with the no name roll! it is my favorite roll and the sun of the beach is second. the have quirky names for their rolls like the who's your daddy roll, <mark>One Minute Man</mark>, and the <mark>Strip Tease</mark>. there is also a harry potter roll! i always do ayce because i feel like if you don't then it's not worth it! haha. ayce at dinner time is a wonderful price at $25.95 compared to other places. you even get unlimited desserts. try asking for an orange and see what they give you, it's very cute. a really good hand roll for fans of a little kick of spice is the palm job! i love those! if you want to be more of a sampler then you can even order half rolls the whole time. i love this place. i cannot say it enough. the servers are always very attentive and come back to get your orders for the next round as well as clearing your plates immediately after you have picked off the last piece. how much appetizers, rolls, and just food in general you can order for the price you are paying is phenomenal.\n\ncome to yama sushi, i swear you won't hit up any other sushi joint after!", 
            "spring break! i think it would be packed but surprisingly we only had to wait about ten minutes to get seated.  the seating seats at least four people per table.  immediately before we sat our waiter got our order of drinks and got to our table before we ordered.  yes, finally water service! \n\none of their famous rolls: sun of the beach it came out hot and fresh. it was a new sensation for me. if you look on the menu the names are only what you will find in vegas.  \"<mark>One Minute Man</mark>\"  \"wet dreams\"   all in which, made me laugh with my friends.  it was definitely a great conversation to start with.   especially when deciding what rolls we like to try.  hahahhahah.\n\none good thing!!  the rolls are not overpowered by fillers such as crabmeat and philadelphia cheese.  in this case maintains their five star rating with me.  also, i love how attentive the waiters were with keeping our glasses full with water and our table with sushi orders.  i know i have sushi back in cali but if i am in vegas this i will make an exception.\n\n***fresh rolls: double salmon roll.", 
            "this place deserves more than 5 stars. the best ayce sushi restaurant in vegas. the fish is consistently fresh and they have good cooked food too. sushi names are very funny...<mark>One Minute Man</mark>, sun of the beach, <mark>Strip Tease</mark>, <mark>Happy Ending</mark>, etc. good rice-to-fish ratio.\n\nthis place is always busy nomatter what time you come here. i'm partially to blame because whenever i have people from out-of-town come to vegas, i always take them/ tell them about this place. some servers do seem to get impatient with noobs so know what you want and pick 2 rolls to start of with.", 
            "as soon as i'm told a sushi place is \"all you can eat,\" i don't know whether i should be scared or excited. this place, however, is great! i recommend getting half rolls and trying a wider variety. the \"<mark>One Minute Man</mark>\" is delicious. this place is always busy, so be prepared to wait.", 
            "okay so walking in, i expected so much out of this place. i've heard amazing things, and i'm sorry to say this is my first negative review on yelp because of how disappointed i am with yama sushi. when we got there the appetizers were amazing.  my boyfriend usually orders about 10 orders of sushi, no problem anywhere else we go. at yama, he could only manage to order 5 because the service was so bad. our sushi chef was rude, and very blunt. not once did he greet us or smile, and he made us feel like we were just another number. he made the guys next to us feel welcome and smiled but when he would turn to us, he gave us another face. i just feel like you should make everyone feel welcome and appreciated, not just your regulars. then when it came to dessert, i ordered a chocolate mochi. i received a mochi, that seemed like it had been cut with a knife someone else used prior to cut something spicy. so my mochi tasted like it had hot sauce on it. it was gross. that al<mark>One Minute Man</mark> me question how unsanitary that place must be. all in all, the sushi was below mediocre. i've tasted better sushi almost anywhere else. sorry to say, i won't be back. :/", 
            "this is my go to sushi spot when at work or near unlv. they have an awesome assortment of rolls and sauces are very good. my favorite things to order are the seafood salad at mild spiciness, wet dream roll, <mark>One Minute Man</mark> stuffed shrimp and harry potter roll. everything has great flavor and the fish if fresh.\n\nonly downside is the servers and if you are with someone who is not doing all you can eat the staff glares at you to make sure you are not sharing. come on don't make me feel like i am a child... we won't share!!!!", 
            "i was trying to come here last year with some of my colleagues from out of country but they were too impatient to wait and went to the place next door which we regretted big time.  anyways we came here sunday may 4th around lunch time ending the weekend for my cousin's 21st birthday bash.  it happened that he found this restaurant using the yelp app and i remembered that i tried coming here before.  i knew it must have been a good sushi spot since there was a line outside the door when we tried coming during dinner last time.  there were 6 of us and the hostess was quick to get us seated even though the place looked pretty packed but no line outside the door this time.  they ended up seating us on the left side near the front.  it kinda looked like a mini room and there were 2 sets of tables in that little area enough to sit the 6 of us and these cute korean ladies on the next table.  there was 1 small tv in there..it was playing inception and i remember another tv in the larger dining area airing the basketball game.  i didn't get to see the other room since this is our first time being in there.  our waitress' name was ellen i believe.  she was quite the comedian.  she was quick to give us the popular rolls and side orders.  the name of the <mark>New Special Roll</mark> are hilarious...<mark>One Minute Man</mark>, man whore, wet dream, son of the beach, <mark>Happy Ending</mark>,   i freakin love the names.  we decided to do a.y.c.e. just as the ladies did next to us....my brother asked them that's how we knew.  we ordered the sashimi salad for an appetizer.  i would recommend that to anyone.  there was almost 0 greens in that salad.  it was mostly just the sashimi and the special yama sauce that they wouldn't sell to us even if we begged them to.  we ended up ordering 4 more orders later on of that deliciousness.  we also had the <mark>New Special Roll</mark> i mentioned above and some nigiri as well.  uni was nice and fresh.  we'll definitely hit this spot up again and again when we come to vegas.  only thing i regret is not opening my mouth when the ladies next to us talked about visiting san diego soon...lol.", 
            "this is our favorite restaurant in las vegas!\nme and my boyfriend dine in here every time we come to vegas and it is always good!\nwith only $22 you can try a variety of food which are very tasty, definitely worth it ! rolls are really good! \"<mark>One Minute Man</mark>\" is our favorite! service is good too the waiters are friendly they never keep you waiting too long.\nwe went to the top rated buffet in caesar palace later the day, and still thought this place has better sushi rolls. will definitely come back again!", 
            "boy was i a <mark>One Minute Man</mark> while having my <mark>Happy Ending</mark> after the <mark>Strip Tease</mark>. nooooo! i'm not talking about crazy horse iii. sheeesh, thats another review. haha.\n\nwhat i'm talking about are the signature sushi rolls @ one of my fave ayce sushi restaurants, yama. that's just 3 of many different style of sushi rolls offered here. love this place, and yes they are always busy, so when you come know your stuff. learned the hard way 5 years ago when ordering taco thinking it was a japanese style <mark>Yama Crunch Roll</mark>, and it ended up being an octapus salad, so yes know your stuff. \n\ncustomer service is always good, friendly staff, but because of it being so busy, they tend to forget about you at times, so maybe more friendly staff to move things along more smoothly may work. \nambience is just right, with their expansion it evens it out a lil.  if you do happen to have a large group, they do have an area with lcd tv that can seat up to about 10-15 people. in there you get your own server, but i believe you may have to call to reserve this room.\n\nat only $22, you can get your hands on all your favorite sashimi style, hand rolled, cut rolls and appetizers. all your favorite assortments of fish including yellow tail, salmon, tuna, uni, albacore, and white tuna. always fresh here with a good rice to fish ratio. you are limited to some of their rolls or sashimi to 2 per person, like the sweet shrimp with fried heads or seafood salad, but when ordered with a group, well satisfying. \n\noverall, a great experience for that sushi craving without having to dig deep in your pockets. come hungry, and for those busy days, come patient. otherwise, get your sushi on at yama.", 
            "i would have given five stars but the service was terrible.  very slow, it really was not that busy. ayce is a great deal, the rolls were great. i'm from out of town. i just wish the waiter was a bit more attentive. it's very annoying to get up and ask for more tea and ask to order more. but other than that the food was good. we got the no name roll, <mark>One Minute Man</mark>, baby one more time, crazy roll, and man whore.", 
            "great sushi place! \n\nto be honest its not worth going to unless you get all you can eat because it ends up being cheaper in the long run.\ntry the seafood salad, and you cannot go wrong with any of their specialty rolls. \ni absolutely love this place, even though its pretty small. \nworth absolutely trying nonetheless.\n\nbringing someone who never tried sushi? take them here and make them try any of the specialty rolls.\n\npersonally i like the wet dream, man whore (yes thats the actual name), no name roll, double dragon, <mark>One Minute Man</mark>. (these would be great for novice sushi eaters to try! believe me i was one of them!!)\n\nhowever, there is this one waitress i dislike, she needs to smile more and needs to be more alive. she doesn't constitute my definition of \"welcoming\" and she was a bit rude one of the other times i went here.\n\noverall, great place so try it.", 
            "food:\nwe did the ayce during lunch for about $20/person. \nwe tried a good chunk of the menu, especially the specialty sushi.. and everything was hit or miss. a lot of the rolls seemed kind of dry or had bad quality?... i'm not sure, but it was off. \nsome highlights: wet dream, <mark>One Minute Man</mark>, yellowtail, halibut, and green mussel\n\nambiance: \nthe restaurant kind of had a weird layout where there were two rooms. it also felt a little cramped. \n\nservice:\nservers were very nice and attentive but they kept messing up our order. they would give us plates we didn't order and would forget about plates we did order. i also don't like that they don't give you the paper to mark your order.. you have to tell them what you want every time. \n\ntips:\ndefinitely do the ayce so you can try a variety of dishes."
        ], 
        "dish_name": "One Minute Man"
    }, 
    {
        "text": [
            "decent value, but with their all you can eat program, (lunch 11-3:$19.95, dinner 3-1030: $22.95) this place wins.  i had the sun of the beach, <mark>Happy Ending</mark>, you the man too, and the soft shell crab roll, normal price at about $40, but clocked in at $22.95 pretip and tax!  great way to beat the pricey tourist trap sushi on the strip.  better if you take the bus along flamingo way from bellagio... highly recommended for poker players trying to recover between bouts.", 
            "my new hubby and i like to try and venture out of the strip when we stay in vegas.  with the help of fellow yelpers, we discovered yama sushi which is on flamingo, about 3 miles east of the strip.  as we sat down at the the sushi bar, the lady who was sitting next to us said, \"this place is awesome!\"  for the price of $22.95, you get all you can sushi, rolls, appetizers, soups, salads, ice cream, and mochi ice cream.  the names some of the rolls are hilarious, such as:  <mark>Happy Ending</mark>, man whore, the <mark>Strip Tease</mark>, wet dream, <mark>One Minute Man</mark>!  we tried the <mark>Strip Tease</mark>, which has shrimp tempura, crab meat, cream cheese, eel, avocado and crunch on top.  it was delicious!  what is nice about this place is that you can order any roll whole or half or in a hand roll, which helps to minimize waste.  i would also recommend sitting at the bar, for faster service.  i recommend this place to my fellow yelpers who want good sushi, at an affordable price.  :)", 
            "come here every time i'm in vegas. made to order all you can eat sushi. one of the things i like most about this place is that it is not a buffet type of place, all the sushi is made when you order it. also they have a lot of crazy type of rolls, like <mark>Happy Ending</mark>.", 
            "whoever thought the idea of all you can eat sushi would be a good idea was an idiot. a group of 18 and i went to yama at 2pm for ayce sushi. at least half of us were hungover, so the thought of scarfing down roll after roll didn't sound that appealing to me. but i'm never one to turn down a buffet opportunity so i gave in.\n\ni was so confused about the ordering process of the place. i totally imagined a bar with tons of different types of sushi that we can pick up ourselves. instead, we filled out the menus, which were then sent to the sushi chefs ... i think there were at least 3, to be made. for a sushi buffet, i was impressed that they still made their food fresh. there were so many different types of rolls, as well as their own concocted ones, which had really interesting, yet inappropriate names to it. \n\none of my friends ordered the wet dream (that was really sweet), and other rolls donned names like who's yo daddy and <mark>Happy Ending</mark> and more nasty names that i wish i remembered. i had the harry potter, which had tuna on top and was a cucumber roll. \n\nthe buffet also extended to appetizers and desserts. the seafood salad was awesome and our table was filled with different flavors of mochi (vanilla, strawberry, mango, and like 3 more flavors) and ice cream (green tea, red bean, plum!!!) by the end of the meal. also, everyone lost track of what they ordered, so we all ended up taking a roll or two and passing it down the table. so i had no idea what i was eating most of the meal. eventually all the rolls began to look and taste the same. some had different names but was identical in ingredients. \n\nit got really bad by the end because all the rolls came first and then the sushi. we ended up with like 6 full plates of salmon and the same amount of tuna that everyone claims they didn't order. the rule was that we had to finish everything, or else we had to pay for everything we ordered at individual prices, which would have cost a fortune. thankfully my table had some eaters and we were able to demolish most of the sushi and rolls. \n\nconsidering how the sushi is intended for buffet use, with lesser quality of ingredients, everything was still really good. definitely worth the $22.99 for ayce sushi.\n\nand major props to our two or three waitresses accommodating a 19 person group. :)\n\nwould i do it again? yes! but give me a few months to recover :)", 
            "this place is awesome!!\n\nall you can eat sushi for $23 dollars!! that's such a steal in an expensive city like las vegas. the restaurant is located just right off the strip in a plaza with a huge parking lot, so the location and parking is a super plus. the wait time isn't that bad, but when i went, it was super hot inside. \n\nfor the actual food, they have all the usual rolls, but they also have a bunch of specialty rolls that they created themselves. all these specialty rolls also have these hilarious names that are all very sexual (like wet dream, <mark>Happy Ending</mark>, and manwhore). i recommend not touching any of the ordinary rolls and just try one order of everything and share with your friends. they are all delicious and its also hilarious listening to the waitress repeat your order to you. there is also unlimited ice cream and mochi included in your dinner! i would definitely come back in the future. great food, great price, great location!", 
            "i freaking love this place. i am pretty sure i've never eaten sushi for more than my money's worth til i got here. it's ayce sushi for $23 and you can order 3 rolls at a time (which is more than enough after about 2 rounds... especially if you go with a huge group and share everything). this restaurant seems to love me because it has nearly all of its roll with my favorite, spicy tuna. many of the rolls kind of tasted the same, but i loved the mad dragon, <mark>Happy Ending</mark>, snow in vegas (or something like that).. and basically everything with spicy tuna, crab (not artificial crab!), eel, and/or avocado... yum. i would go back again and again if i could :(. please go to yama sushi! they even include dessert in the flat price, with varieties of mochi and ice cream.. drooooooollllll....\n\nneedless to say, everything was fresh and incredibly delicious.", 
            "this use to be one of my favorite sushi places when i was stationed at nellis. the best rolls were the firecracker, snow in vegas and (my absolute favorite) <mark>Happy Ending</mark>. there is always great service and fresh fish. on the weekends there is always a wait, but it is totally worth it.", 
            "i read the review about getting sick here but i haven't gotten ill.  when i in vegas for business i usually try to stop here a few times.  been coming here for years and it's getting crowded. they now have these <mark>New Special Roll</mark> with silly names like man whore and <mark>Happy Ending</mark>. when they first introduced it i had an older waitress that asked with a heavy accent 'would you like to try man whore or <mark>Happy Ending</mark>\" i almost did a spit take \"excuse me??!!\"  i like that there is a lot more than sushi on the ayce menu like tempura (you can order shrimp only) but my favs are soft shell crab and hamachi kama - onolicious.  one dish i would never order again is the yakitori - it was nasty. i was expecting grilled pieces of skewered chicken but their korean interpretation is baked flat pieces of chicken that they cut into little squares and stick them on a skewer with muchrooms, green onion and white onion and it is baked just a little more and brought out luke warm, drenched in teri sauce. mushroom tasted more raw than cooked. update aug 2011 i'm going to downgrade my review to a 3 soon.  last 3 visits which have been at lunch or early dinner they have not had hamachi kama which is disappointing since i also brought others with me and told them about that dish. i can see them running out if late during dinner but 3 times in a row is more a sign of them cutting corners. quality of some items are going downhill too like the uni and dried pre made unagi that was inda dry.", 
            "never have been a fan of ayce but this place changed my mind!  the choices of specialty rolls are amazing!  \n\ni went with a group of three people, and with a few beers and three ayce sushis, our bill was only around 85 bucks.  and that even includes any and all appetizers, salads, typical rolls, specialty rolls and dessert!  i was floored.\n\nthe quality of the food and the service were spot on as well.  i had heard there is sometimes a long wait, but our group was seated right away at 6:45pm on a saturday night, that's pretty good.  if you go later than this, expect a long wait.  but i can confirm,  it's totally worth it.\n\nrecommended rolls:  no name was the bomb, yama crunch was super tasty...they were by far my favorites.  i also enjoyed the harry potter and the <mark>Happy Ending</mark>.  the firecracker was ok.  you can even order half rolls which i love!  allows you to try so many things.  the seafood salad was fresh and lots of spice!  edamame and tempura were as you would expect them to be, but nothing spectacular.  for dessert, try the mochi ice cream...soo good!  chocolate and mango were my faves.\n\nmmmm, craving sushi now.", 
            "love the innovative rolls!!! my favorites: sun of the beach and <mark>Happy Ending</mark>.  all you can eat and i will definitely eat here every time i'm in vegas.  just missed the line...", 
            "i'm from the east coast where there's not such thing as all you can eat sushi so i was ecstatic to go to this place. i went on a friday night and there was a 50 minute wait to get seated. they do not take reservations so i could not have called in advance.\n\nwhen we finally got seated, the ordering began. our waiter was very helpful and knowledgeable about the menu. i quickly ordered all the rolls i've scoped down on the internet based on reviews here. the rolls looked delectable and the taste was good for the first few bites. after i wharfed down a roll though, the fun wore off and i realized the sushi was good but not that good. what i did not like was every roll was drizzled with a sweet mayonnaise or eel sauce. there was hardly a roll we ordered that did not contain some form of cloying rich sauce. for our final roll (as we were reaching our intake limit), we asked our waiter if there was a roll that was lighter and not drenched in sauces. he recommended the <mark>Happy Ending</mark> roll. this was a light salmon roll topped with sliced lemons and scallions..pretty light and refreshing.\n\nthere were plenty of other options on the all you can eat menu other than sushi. one dish i thoroughly enjoyed and got seconds and thirds of were the green shell mussels. i forgot what it was called but there were only 2 mussel dishes and one was battered. i'm talking about the non-battered cheaper mussel item. the desserts were also very good. i especially recommend the red bean ice cream!\n\ni'm giving this place 4 stars because i'm sure there are better all you can eat sushi places out there that do not load their rolls with so much sauce, i couldn't even taste the fish in the rolls anymore.", 
            "waiter: so what would you like? \nme: i want a <mark>Happy Ending</mark> with harry potter. \nwaiter: (straight face) would you also like a man whore with that? \n\nat any other place, i would probably get some weird look or a slap in the face; however, at yama sushi, i just get a big smile. so one of my friends recommended this ayce sushi place to me in vegas. at first i was extremely skeptical, considering the closest ocean to vegas is about 6 or 7 hours away. however, when i came in and saw the huge menu, i was completely caught off guard at the quality and the selection. addtionally, i love the back side to the menu where they have yama's rolls which all have the most interesting names.\n\nnormal sushi: \ntuna/ yellowtail/ albacore sashimi- awesome\noctopus/ squid sashimi- not so much, too chewy for my taste \nsea urchin- tastes very fishy, not my taste, but some of our group loved it. \n\nyama's specialty rolls:  \nharry potter- it's like a garlic tempura roll- pretty awesome \n<mark>Happy Ending</mark>- it's a tuna roll with lemon- really tangy \nman whore- it's like a philly cheese roll- no one should ever mix cream cheese with sushi. \nhot night- very spicy- but pretty good as well\nwho's your daddy- it's okay. \n\ndessert: \ngreen tea ice cream- awesome \nmango mochi- awesome \nred bean ice cream- tastes like candy \n\nall of this only cost me $27 with tip. freaking amazing, talk about having a <mark>Happy Ending</mark>. even though we had to wait for an hour it was worth it! my only gripe is the sushi isn't the most fresh and most of the rolls are hit or miss, but the selection makes up for it. best ayce sushi in vegas hands down. \n\nunfortunately, since it's an ayce i can't ask for a <mark>Happy Ending</mark> to go ;d.", 
            "this place deserves more than 5 stars. the best ayce sushi restaurant in vegas. the fish is consistently fresh and they have good cooked food too. sushi names are very funny...<mark>One Minute Man</mark>, sun of the beach, <mark>Strip Tease</mark>, <mark>Happy Ending</mark>, etc. good rice-to-fish ratio.\n\nthis place is always busy nomatter what time you come here. i'm partially to blame because whenever i have people from out-of-town come to vegas, i always take them/ tell them about this place. some servers do seem to get impatient with noobs so know what you want and pick 2 rolls to start of with.", 
            "2 words: sea urchin. it tasted so gooooood!\n\ni've been to other ayce sushi places, and this is probably the best i've had so far. the texture of the uni is soft and creamy and the portion of the sea urchin is much larger than those in other restaurants.\n\nthe specialty rolls had hilarious names such as \"<mark>Happy Ending</mark>\" and \"man whore,\" and they all tasted good. depending on your preferences in rolls, there will always be something in the menu that will suit your palate.\n\nanother highlight of this place is the dessert. come on now, who doesn't not like mochi ice cream? \n\nfor those of you who are acting adventurous, i highly recommend the plum ice cream. although the ice cream comes in different flavors such as green tea...nothing beats plum ice cream. it may seem different at first, but once you try it -- you are going to want another serving. it's sweet and leaves a better aftertaste in your mouth that far surpasses that of green tea ice cream, imo. :)\n\nthe next time i go to vegas, i am definitely coming here again.", 
            "try the palm job and the <mark>Happy Ending</mark>....they're amazing!", 
            "i have been going here for years now and not once has it ever disappointed me! i always get all you can eat because not only is it fairly priced but you can do 1/2 rolls as well. i haven't had a bad thing on their menu. i highly recommend yama and i also recommend the \"<mark>Happy Ending</mark>\" roll. you can thank me later...  i hope they will eventually make their spot bigger!", 
            "alright but not great. do not get the \"whose your daddy\" roll!  it tasted like ammonia. it was the worst sushi i have ever had. try <mark>Happy Ending</mark> or something else.", 
            "the sushi and other oceanic creatures were very fresh and for the price, you can't complain! i loved the soft shell crab and the <mark>Happy Ending</mark>...no really, its a roll. lol the service was a little crazy but all in all a great experience!  we try to go there everytime we are in town.", 
            "a couple of friends told me about this spot... i read the yelp reviews and finally came to try it out. \nthe reviews were right about the seafood salad! it's delish! lots of fresh sashimi and i opted for the spicy sauce. it was mmmm good! \ni tried the salmon, tuna, yellow tail, sweet shrimp and scallop sushi. all of it was great except for the scallop sushi - it was super fishy and not good at all. def don't recommend that. everything else was great though. also tried a rainbow roll, spicy tuna and the <mark>Happy Ending</mark> roll. \nthere are many servers floating around always asking you if you want to order anything else so service is pretty much on point there as well. \nas i was reading the reviews a lot of them said the tables were all too close together, but apparently they have expanded the restaurant. there are two sushi bars, some awkwardly placed tables as well, but for the most part it was all good!", 
            "i've been going to yama for a few years. i've tried every sushi place that has been highly recommended and i always go back to yama. they're rolls are amazing. my favorite is the <mark>Happy Ending</mark>. it's a salmon roll with a slice of lemon on top and it's heaven in your mouth. sometimes we have a wait but it's need been too long. the all you can eat price is super cheap for the quality of food. i love this place. do it!", 
            "i love sushi and this place is a hidden gem in the ghetto. my coworkers and i love to go after a long day at work and stuff our faces until we look like we are 9 months pregnant with twins. plus, it's all you can eat! \n\nthe sashimi is excellent. big, fresh pieces of fish, not the small pieces you get at other places. the white tuna and the garlic tuna are my favorite. the white tuna literally melts in your mouth. i could eat only that and be satisfied. it's like butter baby! \n\nnow the rolls, where i even start they are all amazing, and i've tried almost all of them. my favorite is the be mine roll. it's lightly fried with a crab meat/cream cheese mixture in the middle, and it has a sweet taste to it. very tasty. some of my other favorites are <mark>Happy Ending</mark>, baby one more time, sun of the beach, and no name just to name a few. \n\nthe only down fall to this place (but i still wouldn't take a star off for it) is it is alway busy. it doesn't matter what time of day, it's busy. they did just expand the restaurant, but it's still packed. so prepare to have to wait, but i promise it's worth it! \n\ndon't forget the mochi, mango is my favorite.", 
            "i was trying to come here last year with some of my colleagues from out of country but they were too impatient to wait and went to the place next door which we regretted big time.  anyways we came here sunday may 4th around lunch time ending the weekend for my cousin's 21st birthday bash.  it happened that he found this restaurant using the yelp app and i remembered that i tried coming here before.  i knew it must have been a good sushi spot since there was a line outside the door when we tried coming during dinner last time.  there were 6 of us and the hostess was quick to get us seated even though the place looked pretty packed but no line outside the door this time.  they ended up seating us on the left side near the front.  it kinda looked like a mini room and there were 2 sets of tables in that little area enough to sit the 6 of us and these cute korean ladies on the next table.  there was 1 small tv in there..it was playing inception and i remember another tv in the larger dining area airing the basketball game.  i didn't get to see the other room since this is our first time being in there.  our waitress' name was ellen i believe.  she was quite the comedian.  she was quick to give us the popular rolls and side orders.  the name of the <mark>New Special Roll</mark> are hilarious...<mark>One Minute Man</mark>, man whore, wet dream, son of the beach, <mark>Happy Ending</mark>,   i freakin love the names.  we decided to do a.y.c.e. just as the ladies did next to us....my brother asked them that's how we knew.  we ordered the sashimi salad for an appetizer.  i would recommend that to anyone.  there was almost 0 greens in that salad.  it was mostly just the sashimi and the special yama sauce that they wouldn't sell to us even if we begged them to.  we ended up ordering 4 more orders later on of that deliciousness.  we also had the <mark>New Special Roll</mark> i mentioned above and some nigiri as well.  uni was nice and fresh.  we'll definitely hit this spot up again and again when we come to vegas.  only thing i regret is not opening my mouth when the ladies next to us talked about visiting san diego soon...lol.", 
            "boy was i a <mark>One Minute Man</mark> while having my <mark>Happy Ending</mark> after the <mark>Strip Tease</mark>. nooooo! i'm not talking about crazy horse iii. sheeesh, thats another review. haha.\n\nwhat i'm talking about are the signature sushi rolls @ one of my fave ayce sushi restaurants, yama. that's just 3 of many different style of sushi rolls offered here. love this place, and yes they are always busy, so when you come know your stuff. learned the hard way 5 years ago when ordering taco thinking it was a japanese style <mark>Yama Crunch Roll</mark>, and it ended up being an octapus salad, so yes know your stuff. \n\ncustomer service is always good, friendly staff, but because of it being so busy, they tend to forget about you at times, so maybe more friendly staff to move things along more smoothly may work. \nambience is just right, with their expansion it evens it out a lil.  if you do happen to have a large group, they do have an area with lcd tv that can seat up to about 10-15 people. in there you get your own server, but i believe you may have to call to reserve this room.\n\nat only $22, you can get your hands on all your favorite sashimi style, hand rolled, cut rolls and appetizers. all your favorite assortments of fish including yellow tail, salmon, tuna, uni, albacore, and white tuna. always fresh here with a good rice to fish ratio. you are limited to some of their rolls or sashimi to 2 per person, like the sweet shrimp with fried heads or seafood salad, but when ordered with a group, well satisfying. \n\noverall, a great experience for that sushi craving without having to dig deep in your pockets. come hungry, and for those busy days, come patient. otherwise, get your sushi on at yama.", 
            "the last time i left a review for yama i had only been there twice. i've probably been to yama now, 10 - 15 times and i am never disappointed. the service is great. even on a busy night, i get my sushi in a reasonable time. my favorite rolls are the spicy sexy role, <mark>Happy Ending</mark> and wet dream. there are so many options at yama. i would definitely recommend.", 
            "great ayce sushi place that is close to the strip. yama has great selection of rolls, nigiri, hand rolls, specialty rolls, side dishes, you name it!\n\nthe price really can't be beat; only $23.95 for dinner and $20.95 for lunch! that's right folks, pretty sweet deal alert here!\n\ncame here on a friday evening around 630pm and the wait was.. horrible. really bad. we ended up waiting about 50 minutes for a table for 3. just be prepared.. really prepared. if you have a big party, they do take reservations so call in advance! the restaurant is very small and cramped but once you sit down, just sit back and prepare your stomachs. \n\nthe names of the specialty rolls are super full and suggestive. some of our favorite rolls of the night included sun on the beach, who's your daddy, <mark>Happy Ending</mark> and well, you get it. very amusing names and there are just soooo many different rolls to choose from. tip: you can get half rolls if you and your table just want to try a roll and see how you like it! nigiri was also tasty and each order comes with 2 pieces. \n\nthe sides are also plentiful and delicious. i really enjoyed the agedashi tofu and the tempura was really fresh and crispy! our table also shared the bbq ribs (kalbi) and gyoza which were good as well. \n\ndessert was a choice of ice cream (green tea, red bean, etc) and mochi ice cream (vanilla, strawberry, mango and chocolate)!\n\nall in all, great meal for a wonderful price. everything was good quality and seriously, the price can't be beat for vegas ayce sushi!", 
            "went here for the all-you-can-eat sushi and it's generally not a bad ayce sushi, but there are better options in las vegas.\n\ni walked in on a wednesday night and was surprised that it was crowded.  sat at the bar and it really took forever to get an order in with the chef.  you can't ask the chef to make you things either because there are 4 other customers waiting for the same.  since it took forever for orders to be taken, my stomach had more than enough time to settle in from the first handroll and i couldn't eat much.\n\nalso a small gripe that the chef's ?friends? came in later and he made rolls for them first.  \"hola chicas\"\n\nthe handrolls were disappointing.  compressed rice (or hard rice?) with a sliver of yellowtail.  probably the worst i've seen in nevada sushi places.  the other rolls have too much sauce on them.\n\nif i have to recommend, get the \"seafood salad\" and i liked \"<mark>Happy Ending</mark>\"\n\ntea cups went empty.  went to a cvs store next door to buy water after the meal.\n\nlike i said, it's not a bad place.  just after going to goyemon, jjanga, sushi pier... i don't see a reason to come here.", 
            "finally come back after 6 months.everything still the same taste great service great.happy to comeback again!! yama always has the best service in town.\nthe only think i hate tonight was sitting next to group of jerk people that make trouble to our waitress, our waitress was so nice and kind i feel sorry for her .group of people order a lotttsss of sushi but they throw all rice on tissue instead of eating it .( ayce rice part of it ) i heard the waitress explain nicely about the rice is part of it but after all we heard that they complain to manager ( they blame the waitress for bad service which is bulls**t ) ,we hope she didn't get trouble because of jerk people.\nanyway i'm happy to come back again .eating all my favorites rolls no name,<mark>Happy Ending</mark>,seafood salad and don't forget the mochi after that.."
        ], 
        "dish_name": "Happy Ending"
    }, 
    {
        "text": [
            "delish! i had an awesome experience here at this all you can eat sushi restaurant. i enjoyed myself here and ate a gazillion rolls. the service was great.. they kept checking on us to see if we wanted more to eat. i had to hide the menu because they kept coming over thinking we wanted more! \n\nthe sushi roll names were catchy: man whore, superman, wet dream, <mark>Strip Tease</mark>. you get the idea. only in vegas! \n\ni especially liked the wet dream. ca roll baked with cream cheese and topped with shrimp. \n\ni also liked the tnt. oh gawd! delicious. spicy tuna. jalapeno.. could have used more cream cheese but it was good. because it was fried, the tuna had a new texture.. but it was awesome!!!\n\ngo here with a big appetite!! i'm serious. don't eat the whole day. oh.. and bring your strechy pants because i wore skinny jeans.. and well, you get the picture! lol. \n\nlas vegas, you've done well with your all you can eat sushi joints. the one here in san jose, ca has nothing on you!", 
            "thank you yelp! this place is one of the best ayce i ever had. \n\nlike other posts, its premium sushi unlike todais. i am glad we walked two miles from the strip. the walk was brutal so heres a tip...take bus 202 from the westin behind harrahs. its two dollars a person.\n\nfor 23 dollars a person, 1 person gets to pick two selection. for the first round, my fiance and i got 4 custom rolls, wet dreams, superman, one night stand & <mark>Strip Tease</mark>. yes the names are funny but they are hella good.\n\nafter the first round, we ordered some entree items with nigris.  we got full after that and ordered half rolls (awesome)\n\nto finish our night off, we got 3 orders of mochi, mango, strawberry and vanilla. \n\nthe service was excellent, they kept taking our orders and fill up our water. \n\ndefinitely coming back here in the future!!!!", 
            "after hearing raging reviews about this place both from yelpers and coworkers alike, i have been wanting to try this place for sometime now, and last night i had that chance!\n\nwhen i first arrived there, it was so packed that you couldn't get in and out of that door easily. thank goodness a friend of mines arrived earlier than me and reserved a table, because if she hadn't we would've been waiting for a while like those at the door. :) yay for my friend! hopefully they can expand to a bigger restaurant soon, they have the business, so i don't see why not. \n\nfor how busy it was the service was decent. servers and cleaners were busy all night, didn't look like they could have a break but they were on their a-game for sure. once i was seated at the table she was ready to take our orders. right on!!! \n\nmy friend and i took part in the ayce special here, and i must say the most memorable dishes for me were the wet dream, <mark>Strip Tease</mark>, and the seafood salad. i ordered these dishes more than once. they were so good. the ayce special was $22.95 i believe, which much cheaper than sushi-mon which is where i usually frequent. and for dessert, i highly suggest the mochi ice cream. my favorite is the mango. :)\n\nthis was a pleasant experience that didn't disappoint one bit :) i will be back!", 
            "my new hubby and i like to try and venture out of the strip when we stay in vegas.  with the help of fellow yelpers, we discovered yama sushi which is on flamingo, about 3 miles east of the strip.  as we sat down at the the sushi bar, the lady who was sitting next to us said, \"this place is awesome!\"  for the price of $22.95, you get all you can sushi, rolls, appetizers, soups, salads, ice cream, and mochi ice cream.  the names some of the rolls are hilarious, such as:  <mark>Happy Ending</mark>, man whore, the <mark>Strip Tease</mark>, wet dream, <mark>One Minute Man</mark>!  we tried the <mark>Strip Tease</mark>, which has shrimp tempura, crab meat, cream cheese, eel, avocado and crunch on top.  it was delicious!  what is nice about this place is that you can order any roll whole or half or in a hand roll, which helps to minimize waste.  i would also recommend sitting at the bar, for faster service.  i recommend this place to my fellow yelpers who want good sushi, at an affordable price.  :)", 
            "my fave place for all you can eat sushi. i have gone to the expensive places before and had good sushi, but who wants that price tag. it takes a lot of sushi to fill me up and frankly i could never eat till i am full at a non ayce and pay the bill. well i mean i could, but i wouldn't want to. anyway, one of my fave items is the seafood salad. the way i discovered it was one time i went alone and sat at the bar and the chef asked me if he could make me something. i said sure, and i am given the most delicious seafood salad ever. everytime i order it is different, i guess it depends on the chef who makes it. it never disappoints. \n\nthe staff is friendly and always comes back when we are almost done with our order to see if we are ready for the next round. my water glass is always full, i don't like to order soda because it fills me up too fast. \n\nthe must try rolls are <mark>Strip Tease</mark>, son of the beach and baby one more time. i also like the harry potter roll and their selection of nigiri is great. smoked salmon is so tasty. \n\nnext time you find yourself in vegas and you are craving sushi, visit yama, it is worth it.", 
            "i know it's unfair to rate a place by it's business, but when the plae can't run nicely when it's busy.. then i think it's fair.\n\ni love yama sushi! as far as rolls, it's my favorite ayce sushi in the city, kaya is second.\n\ni love their <mark>New Special Roll</mark>: <mark>Strip Tease</mark> and wet dream are my favorites.\n\nalso love the seafood salad which is raw fish slices in a spicy dressing.\n\ntheir servers always seem annoyed which is fair.\n\ni only took the star off for their limited waiting area, not having something i wanted in stock, and for their disgruntled enployeees.\n\ntip is to definitely go around opening for an early lunch! \n\nless busy with little to no wait.\n\nalso a plus is their desserts are all you can eat. at least my servers always give it to me.. hmm i'll put the star back :]", 
            "the no name roll & sun of the beach!\n\nthat is all you need to know, just kidding. i love this place so much that i will even wait in line for an hour just so i can come in and grub at this ayce sushi joint. out of all the places that i have been to in las vegas, this place has definitely been the best. it is on a first come first serve basis so if you are planning to come as a big group for dinner time then make sure someone shows up first to put their name on the list. wait times range from 30 minutes to an hour and a half when they are really busy. more if you have a large party. i wish that they would expand so that more people are able to come feast on their delightful, heavenly sushi! so.. beware of you are claustrophobic because everyone is packed in there like sardines in a can. i fell in love with the no name roll! it is my favorite roll and the sun of the beach is second. the have quirky names for their rolls like the who's your daddy roll, <mark>One Minute Man</mark>, and the <mark>Strip Tease</mark>. there is also a harry potter roll! i always do ayce because i feel like if you don't then it's not worth it! haha. ayce at dinner time is a wonderful price at $25.95 compared to other places. you even get unlimited desserts. try asking for an orange and see what they give you, it's very cute. a really good hand roll for fans of a little kick of spice is the palm job! i love those! if you want to be more of a sampler then you can even order half rolls the whole time. i love this place. i cannot say it enough. the servers are always very attentive and come back to get your orders for the next round as well as clearing your plates immediately after you have picked off the last piece. how much appetizers, rolls, and just food in general you can order for the price you are paying is phenomenal.\n\ncome to yama sushi, i swear you won't hit up any other sushi joint after!", 
            "this is a great place to eat sushi. the place is located off the strip in a parking lot which is convenient and not that much traffic. the all you can eat is the best deal.\nservice is ok although the last time we went we felt rushed out since the crowd started to come in. <mark>Strip Tease</mark>, man whore, shrimp lover and wet dream are my all time favorite dishes.  my only grip about this place is that i hope they had more bathrooms available they only have 1 bathroom for each men & women which is an inconvenience. definitely recommend coming here to eat sushi that is priced very well.", 
            "this place deserves more than 5 stars. the best ayce sushi restaurant in vegas. the fish is consistently fresh and they have good cooked food too. sushi names are very funny...<mark>One Minute Man</mark>, sun of the beach, <mark>Strip Tease</mark>, <mark>Happy Ending</mark>, etc. good rice-to-fish ratio.\n\nthis place is always busy nomatter what time you come here. i'm partially to blame because whenever i have people from out-of-town come to vegas, i always take them/ tell them about this place. some servers do seem to get impatient with noobs so know what you want and pick 2 rolls to start of with.", 
            "went in and the place was packed.  that's a good sign.  after an acceptable wait (sunday afternoon) got two places at the bar.\n\ntalk about fast service.  we would give the chef an order and bam, it was there in a few minutes.  the only things that took a bit longer were the gyoza and bbq ribs.\n\nsushi was good.  best ever?  no, but you don't go to an all you can eat joint for the best sushi ever.  above par?  definitely.\n\ngood assortment of rolls.  i like the half roll size, so you don't get stuck with something that sucks.\n\n<mark>Strip Tease</mark> roll and 007 roll were great.  there was a palm something or rather that i highly recommend as well.\n\nas a plus (and some places don't do this) but you get mochi included.  a perfect way to end the meal!", 
            "love this restaurant! stumbled upon it back in 2008 when i was waiting for a friend who was also flying in for the weekend. i try to come here when i'm in town. try: <mark>Strip Tease</mark> roll, oh dam harry roll.", 
            "very good sushi for an amazing price, roughly 25$ a person and its all you can eat!  everything is usually fresh, tasty and comes out quickly. me and the hubby come here anytime we are in vegas!\n\nso if it is your first time, you have 2 choices, either ayce or item by item. if you choose ayce, you can order anything off the menu, literally everything on there. start slow, as you do have to eat everything you order or there can be an upcharge, but i assume this is so someone doesn't order 10 rolls and pick off 1 piece of each! you can also order half rolls of most things, so great way to try them. nigri is included! also sashimi by way of an item called \"seafood salad\" .. try it spicy, and thank me later! \n\nfood -  very good stuff and high quality for the price. personal favorites \n\nseafood salad spicy ... 10 stars?!\nbe mine roll .... deliciousness \n<mark>Strip Tease</mark> without the spicy tuna \ndeep fried mussels \nsoft shell crab... save the sauce from the seafood salad and dip in there\nmiso soup ... normally dont like this at other places, but here its yum!\nsmoked salmon nigri .... dont mind if i do \n\n\nstaff ... very friendly and coming around non stop for drinks, new orders, etc. they are always smiling and fast! \n\nambiance .. so this is the only part that stinks! it is a really small area and everything is kind of cramped. i wish it was larger and more comfortable sitting area, but really if we sat on the floor, i would still go there. so while not a great date place, but amazi", 
            "prices: (ayce)\nlunch 11-3pm $20.95\ndinner 3-11pm $$23.95\n\nfor a very cheap all you can eat sushi and good quality fish, this place is the best place to go! it's a hidden gem away from the strip. i have to say this is my second favorite spot.. it would be my first if they had  all you can eat sashimi, but it toes very very close to hikari.\n\nservice can be a little better, but i don't blame them. this place is always so busy! a very, very popular local fav! \n\ni love the sushi roll names! some examples: one night at yama, yo sexy, man whore, dancing in the sheet, <mark>Strip Tease</mark>, oh dam!!!harry, kiss the ass... just to name a few! do you see their style and theme of sushi roll names? haha it's very funny when you order them out loud. it is definitely a topic starter and a fun way to entertain your group at the table!\n\ntheir sides are amazing. i can't stress enough how fresh the fish is. i loveee it! everything here is amazing! must try place in vegas!", 
            "heard about this place from the excalibur pool cocktail waitress.  she said they had great all you can eat sushi and she was right.\n\nwhen we walked in this place was crowded.  we ordered two all you can eat dishes, which came out to $51 total, tax included.  you can order rolls, sashimi, and sushi for this price.  \n\nthe sushi chef was extremely fast, making sushi rolls appear in under three minutes like david copperfield.  the baked and fried rolls took a bit longer-- probably a six minute wait.  we ate a total of five rolls, which would have been $50 if ordered separately, so bring a hearty appetite and try to kill six rolls to get your money's worth.  that's a lot of sushi, i could barely walk after crushing five rolls with my wife.\n\na word of caution, if you leave any food on your plate they charge you a surcharge, so don't go overboard.  \n\nthe rolls were extremely fresh and delicious.  a must order were the <mark>Strip Tease</mark> and the wet dream rolls.  our waitress told us the the fish is delivered daily from three different locations.  \n\nthis place is definitely on the re-visit list next time we are in vegas.", 
            "this has got to be my favorite sushi place yet!  coming from cali, this place is a must whenever we're in town.  the first time i came here was summer '11 & things haven't changed one bit!\n\nthis past weekend, my bf and i arrived from a long drive and decided to start our trip off with some delicious sushi.  although we love to eat, our tummies cannot take that much food... but this time we decided other wise.\n\nlunch buffet for $20/each -- best choice we made this whole trip!\n\nthe rolls we decided to order this time were:  spicy sexy roll (we love spicy foods and this roll in particular will leave your mouth on fiyah!!), you the man too!!, snow in vegas (this one was ehh... the sauce was too sweet for our tastebuds), <mark>Strip Tease</mark> (super yummy), philadelphia roll (x2) and a salmon skin hand-roll.  i also got two orders of miso soup for myself & he got an order of muscles and gyoza.\n\nthe food here is amazing & service is pretty good as well.  can't wait to go back!", 
            "all-you-can-eat sushi restaurants are now a staple anytime we visit las vegas. we normally hit oyshi sushi but this time we wanted to find a spot closer to the strip. once again, our fellow yelpers helped us out and didn't fail to direct us to a good place to eat! for a friday night, the wait seemed to be pretty typical - 30-45 mins. it was definitely worth it as our party of three was seated right at the sushi station. the sushi chefs in the back room (failed to get their names) gave us personalized attention and served up some awesome sushi! i recommend the my cash, double dragon, and <mark>Strip Tease</mark> of you're a big specialty roll person. the seafood salad and sexy salmon are also secret gems on the menu.  the space in the restaurant was a little cramped which is probably the only drawback. this will probably be added to the ayce list for future visits to vegas.", 
            "boy was i a <mark>One Minute Man</mark> while having my <mark>Happy Ending</mark> after the <mark>Strip Tease</mark>. nooooo! i'm not talking about crazy horse iii. sheeesh, thats another review. haha.\n\nwhat i'm talking about are the signature sushi rolls @ one of my fave ayce sushi restaurants, yama. that's just 3 of many different style of sushi rolls offered here. love this place, and yes they are always busy, so when you come know your stuff. learned the hard way 5 years ago when ordering taco thinking it was a japanese style <mark>Yama Crunch Roll</mark>, and it ended up being an octapus salad, so yes know your stuff. \n\ncustomer service is always good, friendly staff, but because of it being so busy, they tend to forget about you at times, so maybe more friendly staff to move things along more smoothly may work. \nambience is just right, with their expansion it evens it out a lil.  if you do happen to have a large group, they do have an area with lcd tv that can seat up to about 10-15 people. in there you get your own server, but i believe you may have to call to reserve this room.\n\nat only $22, you can get your hands on all your favorite sashimi style, hand rolled, cut rolls and appetizers. all your favorite assortments of fish including yellow tail, salmon, tuna, uni, albacore, and white tuna. always fresh here with a good rice to fish ratio. you are limited to some of their rolls or sashimi to 2 per person, like the sweet shrimp with fried heads or seafood salad, but when ordered with a group, well satisfying. \n\noverall, a great experience for that sushi craving without having to dig deep in your pockets. come hungry, and for those busy days, come patient. otherwise, get your sushi on at yama.", 
            "holy cow, this place is always awesome! the best rolls in my opinion \n-sun of a beach\n-no name roll\n-<mark>Strip Tease</mark>\n-wet dreams\nthey're all amazing though and for appetizers i extremely suggest \n-bbq ribs\n-spicy seafood salad\n-garlic tuna\n-shrimp tempura \nyou barely ever have to wait to order more sushi when you're already seated, the wait to be seated is a little sucky but only on weekends! totally worth the wait and the service is on top and super appreciated!", 
            "by far has to be my favorite sushi restaurant in las vegas! the <mark>Strip Tease</mark> is worth ordering twice! love the food and almost everything on the menu. i have tried other places and nothing compares to yama. any family members that come to town we have to bring them to yama to experience the best! \n\nthe staff isn't the friendliest and they aren't too happy with groups bigger than 5 but the food is worth it. trust me!", 
            "this place popped my ayce sushi cherry so it's always had a soft spot in my heart.\n\ni'm not a big fan of their nigiri because they put more rice than what i'm used to. but their rolls are good. and you can order half orders of most of them if you want! \n\nfavorite rolls:\n<mark>Strip Tease</mark>, son of the beach, man whore, dancing in the street and pretty much any of the rolls on the <mark>New Special Roll</mark> menu\n\ni also really like their seafood salad. it's basically a sashimi salad and it's just so good!", 
            "such good sushi!! tasted as fresh as the sushi we get in san diego! we did the all you can eat menu and it was well worth it!! the <mark>Strip Tease</mark> was amazing!! only complaint and the reason for a missing star is that there was a wood and cloth divider next to our table that was absolutely filthy!", 
            "went here for a dinner. we were in a rushed to get to a show and they were able to have us in and out in less than 40 min. best sushi i have had. very busy place ... i recommend making reservations ahead so you don't have to deal with a long wait. i recommend <mark>Strip Tease</mark>, you the man too and the hawaii rolls."
        ], 
        "dish_name": "Strip Tease"
    }
]