[
    {
        "text": [], 
        "dish_name": "Double Stuffed Potato Spring Rolls"
    }, 
    {
        "text": [], 
        "dish_name": "Buffalo Chicken Rolls"
    }, 
    {
        "text": [
            "although i've only gone a couple of times, my experience at the grand lux cafe has been enjoyable.during my recent trip to vegas, we stayed at the venetian and ate at the grand lux everyday.  i like the one in the palazzo, we didn't have to wait in line, it was quieter and seemed much nicer. \nthe service was great, our waiters were really friendly, and would check up on us every so often to make sure our glasses were filled.\nthe food comes in big portions. i can never finish it. \nthe grand appetizer platter is good for big groups, the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were delicious!\ni forgot what its called but they had some sort of asian soup there, it was surprising really good for an american place (the soup is great after a night of drinking) \nthe kick up chili was a little to salty.\nfried chicken and waffles was too sweet.\nmy favorite was the warm homemade chocolate chip pecan cookies. yummm\nchicken royale was good also.\n\nthe only down side is the wait, i think we waited 30 -40 mins for our food. (we did have a big group though) \nprices can be high.\ntheir menu is huge! i had a hard time deciding on what to get. they have a little bit of everything. \n\ni can't wait till my next vegas trip so that i can try something new.", 
            "i think we ate here 3 times while staying at the palazzo!.  it was good and the portions were big. so worht the money.  i've been to other more \"big name\" resturants and the food and service didnt come close to this place.  \ni do agree with the other osters, the mashed potatoes <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> are awesome!! we had them the first night there after a long flight and painful shuttle ride.  the and teh calamari/vegtables.  it was all soo good and enought to share.\n\nbreakfast was also great. 2eggs, bacon, toast and hasbrowns for 9.99! very good and too much to finish.\ni aslo went there for my bday dinner with my 8 friends and had a great time, our waiter(tim) was so sweet and funny.  the birthday decorations they did on my dessert was really nice and the recommendations he gave were right on. loved the snitzel!  \nand its a plust that they are open late, or 24 hours right next door.", 
            "stumbled into this place while playin the slots! by the way, the indiana jones slotmachine is awesome! the food here is good and they have a alot of selections. it's not too expensive and the portions are huge. very cheesecake factoryish. these thai and vietnamese <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were delicious!! i'll come back again for some cheap, good and fast food!", 
            "it's near 3am, we've had lots of drinks, pounded some ill-advised shots, and need food.  it's open and there's no line.  already, we have a winner!\n\nbeing more objective though, this place is ok.  owned by the cheesecake factory (which explains the massive menu, representing foods of all types), grand lux has a little bit of everything, and probably does most of it in an acceptable fashion.  shared the:\n-<mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (vietnamese chicken summer rolls): pretty tasty, but poorly wrapped.  the paper kept tearing and the food spilled out all over our hands and the plate.  \nthe max burger- their \"greatest hamburger creation!\"  burger, cheese, bacon, mushrooms, onions, and short ribs. this was the husband's ideas. it was ok. the individual ingredients were hard to single out as far as taste goes.  \n\neven though the restaurant tries to be a fun, hip place, there were still the standard 3am las vegas servers.  our waiter must have been at least 65 and wanted to be anywhere else but there.  what really surprised me about this place though, was the next morning (and by morning, i mean around 11am) there was an absurdly long line!  those people should've gone to dos caminos (see review)!", 
            "if you are looking for a quick and relatively cheap meal this is the place for you. \n\nwe went after a long night of drinking to soak up the river of liquor we consumed. the menu was extremely diverse and reminiscent of their father company - the cheesecake factory. \n\nwe ended up getting a burger and their <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>. yes an odd combination! refer to the drinking heavily note above. both were fine and hit the spot.", 
            "two weekends ago, we went to las vegas for jc's birthday. for the record, best birthday celebration ever!! we stayed at the palazzo, so, partly out of convenience, partly out of curiosity, we did dinner at grand lux one night. jp got the jamaican pork tenderloin, my memory tells me jc got the reuben but i can't find it on the menu, not quite remembering what jl got, kl had the asian nachos, bt went for the chicken pot pie, and i had the madeira chicken. i only got around to trying jp's and bt's dishes in addition to mine. the jamaican pork was really good. it comes with rice, mashed sweet potatoes, and mango salsa. hearty. if there's one criticism, maybe it was a bit salty. the chicken pot pie was the biggest. pot. pie. ever. the area of the crust was as big as both my hands together. ok, so i have midget hands. but still! creamy. delish. my madeira chicken served with mashed potatoes and asparagus was perfect. i'm always a fan of any creamy wine sauce. mashed potatoes equals comfort. asparagus equals love. it's nothing super fancy, just exactly what my taste buds were asking for.\n\nfast forward to one day later. we had been up till 9am playing blackjack and were running on no sleep. slightly dejected after losing a fair amount of money, but mostly needing showers, we went back up to our room to shower and get ready for checkout, then jp, jc, jc2, bt, tc, and i had our last lunch at grand lux. not remembering what everyone had this time. i'll venture to say the delux drive-in burger, grand club, and the <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> were among the choices. definitely not remembering what jp got. she was too preoccupied with getting back to the blackjack tables. so jp is huddled in the corner struggling to stay awake, conflicted between her desire to take a nap and her significantly more urgent need to get back to the tables. i ordered the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>, which was excellent. a <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> with lettuce and tomato, kicked up with pepper jack and avocado-corn salsa. i want to say it was one giant sandwich cut into quarters, but it was really four still-giant sandwiches. before i got to my second sandwich, jp had already finished whatever she ordered, threw her credit card down on the table for us to pay with, and ran back to the casino. by herself. addict.\n\nin the past, i've also had the crispy thai shrimp & chicken <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, lemon chicken piccata, and <mark>Banana Cream Pie</mark>, all of which i would recommend. i've always had great service, the atmosphere is great, and it's just the kind of place you want to be. comfortable and consistent. unfortunately there aren't as many pictures as usual, as i was too preoccupied with my meal companion or we were too concerned with getting back to the blackjack tables, but there are a few that will hopefully suffice. in summary, it's simple, nothing absolutely crazy gourmet, but definitely hits the spot and more than satisfactory. huge portions and so good! yummers!!!!", 
            "we went to both at the venetian and the palazzo. i would say the service at the palazzo was better than the venetian. food was good and worth the money... looks just like cf but nicer.\n\ntry the  cheesesteak <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> & crispy ahi sushi rolls yum!", 
            "went here a week ago with a friend after work around 11pm. really convenient since i was looking for a good place to eat around during late nights. the decor was casual elegant, not that i'm complaining about it, i actually think it's a good thing. it makes the food taste extra good considering the nice, grand decor. my friend and i ordered the ultimate appetizers which served different types of cuisine from around the globe like <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, philadelphia steak rolls, chicken, and etc. (my memory is a bit lacking since it's been almost two weeks now) though the food is okay, the dish was served in large portion. now that's a great appetizers all for 30 bucks!", 
            "went here for a snack and grabbed the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>. they were pretty good. they were filled with cheese, sour cream and god knows what else. pretty much a baked potato in spring roll form. they were good. nom nom nom.", 
            "philly cheese-steak <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>!!!  even better at 2 in the morning.", 
            "take away:  great variety of food at reasonable prices; looks and feels like it's sibling, the cheesecake factory.\n\nrecommendations:  the <mark>B.b.q. Chicken</mark> pizza is pretty good, but it really just depends on what you're in the mood for.\n\ndetails:\n\natmosphere:\nit has the familiar cheesecake factory d\\u00e9cor.  it's not a fancy restaurant, but for what you pay, it feels like you're going to a pretty nice looking restaurant.  ambience is pretty relaxed and can be great for couples and a small family gathering.  the tables, linen, and dishes were all clean as well.\n\nservice:\nfor the several times i've been here, the service has been pretty good.  the servers have generally been pretty quick and checked in from time to time.  it does, however, feel as if they are slightly understaffed.  a few times, we needed service but couldn't find our server for over 5 minutes.  during my last visit, we had a party of 8 and our server handled our order fairly expeditiously.  she was very friendly as well.  the wait for a party of 8 was about 15 minutes, while the smaller parties (2-5) got their tables immediately (just an fyi).\n\nfood quality / selection:\nhuge variety of food from pastas to sandwiches.  take a look at their menu here: http://www.grandluxcafe.com/menu.htm.  the presentation is above average.  the look and feel of the plates is similar to most other full service restaurants (especially the chain ones).  the food is above average for the most part (see details below).\n\npricing/value/convenience:\ngreat value; above-average portions.  this place is a great place to share an entr\\u00e9e, an appetizer, and a dessert if you want.\n\ndishes that we ordered:\n<mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (eh, wouldn't recommend it; it has a little spicyness to it though); <mark>B.b.q. Chicken</mark> pizza (this thin crust pizza was pretty flavorful); pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark> (not bad, but not great); pasta carbonara (flavor was good, but it just wasn't creamy enough and felt a little bit dry); artichoke dip (was a little bit dried/overcooked - a part of it was actually burnt; wasn't creamy enough also).", 
            "my wife and i spent 3 days in vegas, staying at the palazzo. with so many restaurants to choose from, we still ate at the grand lux once everyday, which allowed us to try breakfast and lunch at the grand lux palazzo, and dinner at the grand lux venetian - it was that good! really! in fact, if you consider \"value for money\", i think it can't be beat anywhere in vegas.\n\nthe service is wonderful, attentive and friendly. the ambiance is what you would expect for a hotel as nice as the palazzo or the venetian, yet the atmosphere is very unassuming and not at all stuffy, like either batali's or lagasse's restaurants. and the prices are very reasonable for such high quality food!\n\nbetween us we tried the grand lux breakfast sandwich (served all day in case you missed breakfast, as i did), regular ol' eggs, bacon, toast (done perfectly with bacon that was crispy and not greasy, baked perhaps?) and the breakfast buffet (we both enjoyed it, but my wife thought there should have been more variety). \n\njust days before visiting vegas, i had been reminiscing about enjoying sloppy joe's as a kid, so when i saw it on the grand lux menu, i had to try it. it was made, i believe, with rib meat instead of hamburger, and served on brioche bread instead of a bun, with fries. i told my wife that it was the best sloppy joe i have ever had!\n\nmy wife ate a mushroom pasta dish which she enjoyed and i munched on some <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> that were absolutely wonderful! the pasta was delicious and she regretted being unable to take it home and put the leftovers in the fridge. portion size is always more than enough. the <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were made out of chicken breast (done perfectly), placed into spring roll covers, with cheese, then deep fried, served with wonderful buffalo dipping sauce. wow! \n\ni washed the <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> down with a couple glasses of texas tea (think long island). unlike the food, drinks will set you back some, but it was worth it for at least one celebratory evening.\n\noh, and because it is a cheesecake factory restaurant (yes, it really is!), we shared a piece of white chocolate raspberry truffle cheesecake, and you know how good that must have been - and it was. yum! \n\nbtw, the menu is definitely different from cheesecake factory, although you will still find some of your favorites there, if that is what you are looking for. \n\nso, if you are staying anywhere on the las vegas strip, do yourself a favor and take the time to eat at the grand lux restaurant in either the palazzo or venetian. you will not be sorry!", 
            "one of my fav 24 hour cafes in vegas.  my go to item on the menu: <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>.  yum.\n\nthey have a vast selection of eats on their late night menu... so you might have trouble deciding.", 
            "i love coming here, affordable tasty comfort food in vegas right in the convenient hotel location right on the gambling floor.. and a short walk from tao.. or if you are staying at the hotel, pretty much on your way back to your room from anywhere on the strip you are coming from! :)\n\nsimilar environment/setup as sister restaurant cheesecake factory, always clean, spacious, comfortable seating, air conditioned, etc but casual.  \n\nthe have a pretty eclectic and extensive menu.. idk how anyone makes up their mind.. i'm a vegetarian so it greatly reduces the menu size for me, but there are still a plethora of options. like cheesecake factory there is no signature dish that they do exceptionally well that everyone comes in for, but just a huge variety of items that are all at least fairly good, perfect for a group because there is something for everyone. \n\nsome of my favorite 4am after club snacks:\n \n<mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (i order without the bacon) - definitely something different to put basically baked potato ingredients into a fried spring roll.. but its definitely tasty & the perfect late night comfort food. \n\njalape\\u00f1o-cheese cornbread- take 3 yummy ingredients and add them together? works here :) \n\nmacaroni & cheese skillet - i make it better at home, but this is definitely good for a restaurant (i've ordered macncheese at a lot of places and i think they try to fancy it up or something.. but it usually doesn't work out so well.. this one is a decent late night snack) \n\nedamame - can't really go wrong here, but these ones do have a sauce thats pretty good. \n\nfried pickles - yum \n\nzucchini and onion haystack- never a bad choice. \n\ncrispy sesame tofu - savory but still on the healthier side of things. \n\nwhipped sweet potatoes - sweet n savory\n\n*most importantly (in by book anyway!) the desserts: \n\ngrand lux is a sweet tooth's paradise!  \n\nit's a late night/early morning tradition of ours to get the box of fresh homemade chocolate chip pecan cookies & milk.. soo so warm gooey & good!! perfect comfort food! \n\nmolten chocolate cake, new orleans beignets, <mark>Peach Cobbler</mark>, butterscotch caramel pudding, pineapple upside-down cake, apple pie, <mark>Fresh Strawberry Shortcake</mark>,  cr\\u00e9me brulee duo, <mark>Warm Sticky Bun Bread Pudding</mark>,  cupcakes, banana vanilla wafer pudding, key lime, red velvet, carrot cake.. all sooo good! \n\nwith a list like that i have no idea how anyone chooses! \n\nthey have two of my favorite cheesecake factory cheesecakes:\ndulce de leche caramel \nwhite chocolate raspberry truffle\n\nmmm... \n\ni haven't tried the \"cupcake collision,\" sounds pretty fun: \"rich chocolate cupcakes collide with vanilla ice cream, hot fudge and whipped cream.\"", 
            "if you like cheesecake factory you will love this place. from what were told the owners of cf also own this. it wasn't quite as expensive and the menu was great. the <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were great as an appetizer. i had the carmel chicken and my wife had <mark>Greek Salad</mark>. as you probably know cf portions are huge and this place was just the same. we sat on the \"patio\" which is really just out in the middle of the venetian. it's crazy and very loud, but what do you expect in vegas.", 
            "this one doesn't open 24/7 but the one at the venetian does.  i've been to grand lux almost every time that i'm in vegas.  the service sucks - it's worst than denny's.  but the food is so good. \n\nthis past weekend, i found out that you can order your food to-go.  so bypass all that shitty service and just order it from the side cafe!  the food comes packed up; you still get your complementary table bread; and just take it up to the room and feast in private.  \n\nanyway, the mashed <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> are a must.  and the pasta telefono is good too.", 
            "omg i love this place. whether you're in palazzo or venetian, grand lux cafe is a safe bet - open 24 hours, reasonable prices, and the food is great! my absolute favorite appetizer to order is the baked <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, combining two of the best possible appetizers together. crispy skin on the outside, cheese and potato on the inside, and lathered in sour cream and green onion. simply delicious!\n\ntip: if you're ordering to-go, they have a cafe adjacent to the restaurant. you have to order through them, the hostess in the restaurant won't take to-go orders. try to phone-in your order because the wait is pretty long.", 
            "a chain, but far better than cheesecake factory. i wish they had one closer to me in nova. you can never go wrong with the chicken and avocado salad and the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>. yum. :)", 
            "this place is way over priced for what you get, but the food is decent. i have had better at many other places in and out of vegas. the breakfast is way too overpriced to even attempt to get something. i ordered a bagel and cream cheese and that was $4.50!! get over yourself palazzo, you are supposed to be a high class establishment, but the service we had in the morning was terrible. she was a middle aged blonde, who just was overwhelmed and not polite. we had a large party and had spent a lot of money this weekend. the service we had in the private room for dinner was much better and friendly, she should take some tips from them on how to act.\n\ni give the higher rating for the night service only. the veggie burger was the worse thing i've had in a long time. the salad was disappointing and <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark> were not great. i wouldn't go back! i would say the decor and ambiance is nice especially in the private room.", 
            "we routinely stay at the venetian and have eaten at the grand lux at both casinos.  we have always enjoyed our meals there.  \n\nwe often order the <mark>Short Rib Sliders</mark> and <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> as entrees.  the chopped beef steak and kobe burger are great.  \n\nwe tried the breakfast buffet and were very pleasantly surprised.  there is not a huge selection but what was there was excellent.  choices include made to order omelets.  the weekend brunch is more elaborate but probably costs more than the $17.95 per person we paid.", 
            "this is our 3rd time here and experience is consistent. fast seating,  ordering and delivery.   price is fair and good food selection.  i was not that unary so ordered the <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark> and <mark>Chicken Lettuce Wraps</mark> appetizers and they were delicious.  portion is big and thought i can finish the but i did.  will definitely come back.", 
            "i had the twice baked <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> from the appetizer menu. they weren't what i was expecting (as i probably should have read the description a little more closely), but were really tasty and not like anything i've ever had before.", 
            "excellent place for lunch with a little bit of everything. my favorite happens to be the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> so tasty. but you want some kind of asian or even italian they have it. service could be a bit better happens to be slow but for what they offer it is pretty good especially late night.", 
            "i'm a little torn about this place now. had i reviewed it a couple years ago, it would have been all positive, however, so much has changed. i've been dining at grand lux cafe consistently since they opened until a couple years ago (i had previously frequented the venetian location). granted, i didn't frequent as often in the last 2-3 years since las vegas' local restaurant scene has stepped up and i found new, better spots to obsess. but, it was my visit in september 2013 that turned me away. the quality has diminished significantly and dishes that were once favorites, are now very disappointing! also, food portions have gotten smaller and prices have remained the same (or increased). where's the money going?\n\none of my favorite sections of their menu is the gr<mark>Chili-lime Chicken And Mango Salad</mark>. large portions for around $13-17. my favorites are the southwestern salad and the manhattan salad. they've changed the manhattan salad a bit since i first had it a few years ago, but it's still good. i like the fresh beets and the large assortment of fresh vegetables and legumes; plus, the house vinaigrette is great. the last time i had this salad, however, it was oddly not chopped. maybe someone got lazy that day? i'd hate to think that it's just served like that now. view photos below:\n\nexhibit a: manhattan salad in august 2014 (what a chopped salad should look like). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=n_rprbjxzdz2hnz-25bkfg#n_rprbjxzdz2hnz-25bkfg\n\nexhibit b: manhattan salad in october 2014 (this is what i was served just two months later). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=acnz4-xjihtb6koh7ktcma#acnz4-xjihtb6koh7ktcma\n\ni haven't tried a lot of their newer small salads, but they used to serve a really nice <mark>Spicy Calamari Salad</mark>. delicious and crispy calamari and fresh greens with these two wonderful sauces/dressing. it's a shame that it's no longer on the menu. \n\nother dishes that i've enjoyed: empanadas, buffalo chicken bites, <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, crispy thai shrimp & <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, pasta pomodoro, cajun shrimp & chicken jambalaya, and indochine shrimp & chicken.\n\noh, their new orleans beignets are fantastic! they're made to order, so you'll need to order in the beginning of your meal. they have a great batter and i love the sauces: jack daniels creme anglaise, raspberry, and chocolate. the creme anglaise is magic and i love mixing it with the tart raspberry sauce. it's divine.\n\ntheir burgers are good (or at least they were good the last time i had them). thick, juicy angus burgers that are cooked to order (medium rare, yay!). i've also enjoyed their sandwiches. my go-to sandwich used to be the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>. i ordered this staple again during my visit in december and it was terrible. i just don't understand what's going on! i've had this sandwich multiple times and there have never been any issues. the sandwich was messily assembled and there was no flavor. i think they may changed the mayo (website shows black bean mayo?) because i'm pretty sure it used to have a spicy element that gave it zing. they should probably rename the sandwich and take out the word 'spicy' because now the only \"spicy\" ingredient is the pepper jack cheese.\n\nmore disappointment: their fries used to be so great and now they're horrible! also, i recently tried another one of my go-to favorites, chicken pot pie, and it has strayed so far from what it used to be. such a shame.\n\ni just had the kale and avocado salad (fresh kale, avocado, spicy roasted poblano chiles, black beans, feta cheese, onions, toasted pumpkin seeds, and citrus vinaigrette) on my most recent visit last month and it was fantastic! i couldn't believe how great it was after so many disappointments recently. it has restored a little faith.\n\ni doubt i'll attempt any of my old favorites again in fear of more disappointment, but i do still like glc's salad selection. i'm just hoping the next time i order a manhattan salad, that it is indeed chopped.", 
            "came here a few time's during my trip to las vegas. once for breakfast, did the buffet loved the waffles. came here  another time for dinner had the <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> for an appetizer, house favorite b.b.q chicken & ribs combo. overall the food was excellent, service was great and both times where affordable. loved it.", 
            "owned by cheesecake factory. steady paced service. food is great! love the appetizers like the buffalo <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>. only problem i have with them is that they don't split the bills.. and they can't do partial transactions from card to cash in a total bill.. at this location", 
            "i am always in search of a good happy hour deal, and a friend has raved about the grand lux caf\\u00e9 for years, so i when i decided to finally try it out, i was pleasantly surprised to find that they offered a happy hour--and a pretty decent one at that. but while the prices were great, the food was just ok.\n\ndraft beers were $4 (regularly $7), and there were a myriad of appetizers for $5.50 each. because the normal app prices are in the $9-$11 range, i thought these would be smaller portions. nope. they were huge! i ordered the asian nachos (my friend's favorite), and my husband ordered the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>. both items were visually appealing but sadly lacked flavor. the nachos had a tasty peanut sauce, but the fried wontons tasted a little like styrofoam and there wasn't much chicken to speak of. and while the <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were topped with cheese and crispy bacon, the mashed potato filling was pretty bland. i'll give them points for creativity, and i can't complain much at $5.50 a pop, but i wouldn't pay full price for either item.\n\ngrand lux has a pretty extensive full menu, so if you choose to eat in the restaurant (happy hour is at the bar only), you might have better luck. but if you're on this part of the strip and you're looking for a great happy hour, walk a few blocks down to the yard house at the linq. beer is a little more expensive, but the food is better and the view is killer!"
        ], 
        "dish_name": "Crispy Thai Shrimp & Chicken Spring Rolls"
    }, 
    {
        "text": [
            "considering that most of the restaurants on the strip are overpriced and overhyped, i was very pleased with grand lux.\n\ni had the max burger which was huge.  it came with a generous helping of fries on the side.  i couldn't finish it at all, especially since it was lunchtime and i was saving my stomach for dinner at bouchon (http://www.yelp.com/biz/bouchon-las-vegas#hrid:iw8qqvb5dsebkxc1l1qkmw).  the burger was loaded with lettuce, tomato, cheese, bacon, and shortrib meat.  there may have been sauce, but who knows.  there was so much flavor and juice and ohhhh yummm i'm drooling a little on my keyboard.  sorry for the vivid description, but seriously, get this burger.  and to top it off, all of that for 14 bucks!  \n\nmy mom had the <mark>Chicken Lettuce Wraps</mark> which were great, well seasoned with chicken and veggies and some light sauce.\n\nthe only complaint i really have is that the service was pretty slow and the waiter didn't even bring us bread until we asked for it.  i know it was really busy, but come on!  bread is not that hard to remember, especially when every table has some except us.\n\nof course, the fact that it's open 24 hours is also great, especially since there is pretty limited real dining 24 hours in vegas (ironic, right?)", 
            "my wife and i ate here last night, before seeing jersey boys. i don't understand why all the high ratings. this place has mediocre food at outrageous prices.\n\nwe arrived @ 5 pm and was quickly seated. the place is pretty large, and the 20 or so groups in the restaurant only occupied perhaps 20% of the tables. at first, i thought our waiter was very attentive. however, as the evening wore on, he became more of a pest... this place has a large menu. my wife is recently from japan and does not read english that fast, and are unfamiliar with many of the dishes, so i have to explain many of them to her. despite the fact that i told our waiter i will need about 10 minutes before we're ready to order, he kept coming back every minute or two to ask if i was ready to order... what's his hurry?\n\nwe ordered alcoholic drinks. funny, prices for alcoholic drinks are not on the menu... this should have given me a clue, but.... my wife and i both ordered mohitos. they were $11 a pop.... this is nightclub bar prices... outrageous.\n\nthen we shared <mark>Chicken Lettuce Wraps</mark> $10, and a short rib sandwich w/fries $13\n\nthe lettuce wrap had good flavor but too much.  the taste was too thick, and after 2 bites, it quickly became too salty.\n\nthe short rib sandwich w/caramelized onion and melted cheese was very bland.\n\ni would not go back here again.", 
            "confession: i'm in love with grand lux cafe. in one trip to vegas, i ate at grand lux four times. oh the shaaaame!!! the shame of eating at and liking a chain restaurant, the shame!!\n\ni kinda hate cheesecake factory's food. i feel like it's gone down over the years and the novelty's worn off. but grand lux's food..everything amuses me. especially their <mark>Chicken Lettuce Wraps</mark>. i don't like chicken much, definitely not lettuce, but man.\n\nreasons to jump on the grand lux bandwagon:\n\n-<mark>Chicken Lettuce Wraps</mark>\n-never a wait\n-they make me grilled cheese's when i'm drunk even though it's not on the menu\n-the one actual restaurant on the strip with good food that doesn't cost a paycheck\n-unlimited bread\n- short rib grilled cheese sandwich\n\nconfession #2: one tme, when i was so hungover (still drunk) and alone in my room at the palazzo i called down for takeout and ordered for myself fried calamari, salad, 1/2 sandwich and soup combo, and <mark>Chicken Lettuce Wraps</mark>, all for less than $30. if there's a cure for the morning-after depression it's laying out a helluva lot of food on my hotel bed and lying down and resting whatever i'm eating on my tummy while i watch tv. boom. sexiness reincarnated.", 
            "i come here probably once every trip home to vegas. i don't know why..it's just a solid place to go. the last two trips home i've really enjoyed this particular location. \n\nwhy? ....drumroll....\n\nbecause they have beignets! it is the only grand lux in vegas to have beignets. my bff ame and i absolutely love them here. \n\nit's a generous serving with about 8-9 beignets and three sauces: raspberry, chocolate, and creme fraiche. \n\name and i always end up mixing the raspberry with the creme fraiche each time. i recommend you do the same. it will change your life. \n\nas for their regular food, everything here is average to delicious, so you really can't go wrong. \n\ntheir salads are divine, as these are serious salads with great combos of ingredients. i particularly recommend the asian <mark>Chili-lime Chicken And Mango Salad</mark> and polynesian salad (the jicama and macadamia nuts with mango..yum). \n\n<mark>Chicken Lettuce Wraps</mark> are yummy as well, and their volcano shrimp is delicious. \n\nover the years it seems like they've changed the coating to their grand fried calamari.. it used to be rock shrimp, zuccini, and onions fried in a thin coating of batter, but now the coating is a lot thicker and more tempuralike. ame and i are not fans of the new formulation. still tasty, but not the same. \n\nlove the place for a quick bite. service is always fantastic 100% of the time. ame and i typically come here to catch up on girl time, and the servers are always gracious to keep pouring us water and refilling my tea/coffee when they don't have to (we always take care of them, of course for their kindness :). seriously - they're always the nicest servers i've seen in town. \n\nprices may seem a dollar or two higher than your average diner, but this isn't your average diner, and plus it's at the palazzo. duh. \n\ncome. get the beignets. be happy. and mix the creme fraiche and raspberry sauces.", 
            "after entering the palazzo and passing by its festive red flying parasol and dragon decorations already in place for the chinese new year, diane and i were seated in a comfortable booth on the patio adjacent to the casino floor.  then we were presented with good, springy wheat bread that had an excellent crusty crust.  the bread basket was set down on our table one second after we sat down.\n\nwhile diane enjoyed a hot appetizer of small bites of creamy macaroni and cheese served in a black skillet, i savored a huge amount of nicely seasoned and sauteed minced chicken breasts, diced water chestnuts, and carrot filling in cool fresh <mark>Chicken Lettuce Wraps</mark> with an asian dipping sauce and hot mustard..  the order was so large i took half of it home, and it served as a full lunch by itself the next day.  \n\npiping hot mushroom barley soup with beef stock, carrot bits, and identically sliced chewy white mushrooms was a satisfying soup of the day.  our server reported that he was told that the mushrooms were shitake mushrooms but they were not of that variety.\n\nthen i enjoyed excellent melt apart braised pot roast with al dente carrots and broccolini served with a splendid brown pan gravy and yummy yukon gold mashed potatoes.  extra gravy was quickly provided on request.  there was scarcely any fat on the tender meat.  \n\ni also liked the very good asian slaw supplied with an order of crispy fish & chips.  only the six very large, elongated hunks of fish were not that crispy, and neither were the french fries.\n\nservice was swift and friendly by proficient servers clad in black and white.  we passed on dessert because we had already eaten free chocolate cake at johnny fortunato's tribute to elvis presley inside the club at the cannery to commemorate the king of rock 'n roll's birthday before we left to drive to the palazzo to have a late dinner at the grand lux.  but i was intrigued by the restaurant's listed baked to order desserts, and look forward to enjoying one the next time we dine at this fine all-purpose eating establishment, which is a couple of notches above a fine coffee shop.  along with its sister property at the venetian, to me the grand lux cafe ranks as the pre-eminent cafe in las vegas.", 
            "2 stars for some halfassed service.\nit was 5am and the place was empty.... the server seemed a bit off too... dragged his feet as if he was half a zombie.\nfood took foreverrrrrrrrr, asked for straws 3 times, needed napkins, bill took forever, omg. \n\non a brighter note, the <mark>Chicken Lettuce Wraps</mark> were good and filling. didn't feel so guilty for eating at 5am :)", 
            "holy chicken parm!!!  this thing is outstanding and huge!   we all snagged bites of it when it showed up at the table. i'd go back just to attempt to tackle this thing!\n\nwe went for appies and drinks before hitting the tables. our waiter was very nice but kept messing things up.  but we weren't' in a rush so it was no big deal.\n\nmy friend got the reuben and didn't like hers. i got the <mark>Chicken Lettuce Wraps</mark> they were just ok in my book, i didn't even eat half of 'em. sliders looked pretty good.\n\ndrinks were good.  shots were better.", 
            "here's an interesting fact:  grand lux cafe is owned by the cheesecake factory!  this makes sense as the menu is very expansive and they have a large dessert case in the quick serve station up front.\n\nthe food quality here is very good, i had <mark>Chicken Lettuce Wraps</mark> and a side salad, both which were very good!  prices are a little more expensive than cheesecake factory, which is understandable considering its resort location.\n\ni can't say i'd go out of my way to come here (hence no 5 star) but it is a very plausible option on the north end of the strip.  careful though, a lot of times there is a wait here.", 
            "it was back to the grand lux for dinner.  this time, after once again enjoying an abundant order of very good <mark>Chicken Lettuce Wraps</mark> and crusty sourdough bread, i tried the soup du jour, cream of chicken soup with mushrooms, which contained giant chunks of fresh chicken but not many mushrooms.  i did not find it as much to my liking as the mushroom barley soup that i had previously enjoyed here.\n\ni almost ordered the kobe salisbury steak for my entree, but ultimately decided to get more adventurous, and try shaking beef.  i was not to be disappointed.  large lean pieces of beef tenderloin merged with red, white, and green onions; a mildly spicy clear marinade; and an imposing mound of steamed white rice to create a very tasty dish.  all elements were hot and delicious.  an individual house-baked <mark>Peach Cobbler</mark> ala mode provided a sweet ending to another fine meal here.\n\nit was a 4-1/2-star dining experience!", 
            "this is our 3rd time here and experience is consistent. fast seating,  ordering and delivery.   price is fair and good food selection.  i was not that unary so ordered the <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark> and <mark>Chicken Lettuce Wraps</mark> appetizers and they were delicious.  portion is big and thought i can finish the but i did.  will definitely come back.", 
            "i can't understand how this place could be considered good by anyone. i at the <mark>Chicken Lettuce Wraps</mark> and was sick a couple ours later. bad ambiance, unhealthy choices, trans fat and more!", 
            "this restaurant is basically the cheesecake factory just with a different name.  it was decent for a \"chain\" and pretty much dead on a tuesday night around 7:30pm.  i was expecting it to be a lot busier.  we were a party of 6, 4 adults and 2 kids.  the bread basket was good, i think i prefer it to cf.  a rustic sourdough, although the butter wasn't softened.  they also carry coke products \n\ni don't eat beef and my most favorite turkey burger is the turkey burger from the cheesecake factory.  so, i ordered it here, and it didn't disappoint.  the bread they serve it on isn't really conducive to the burger( its long and rustic), so i just removed it and enjoyed the burger.  very moist, tasty turkey burger.  served with fries and not that many of them too. \n\nwe had <mark>Chicken Lettuce Wraps</mark> and ceviche as an appetizer.  i didn't taste the latter, but the <mark>Chicken Lettuce Wraps</mark> are similar to the wraps at pf changs.  not the same <mark>Chicken Lettuce Wraps</mark> as cf. \n\nmy friend had the kobe meatballs and she raved about it.  her son had a filet mignon and not one morsel was left on the plate.  another son had a kids cheese pizza.  not much to say about that.  friends husband had the caramel chicken and he seemed to enjoy it.  they liked their alcoholic drinks. \n\nservice was pleasant and not too overbearing.  a good solid choice for a hotel, especially if you don't want to taxi it someplace else.", 
            "tip: sit @ the bar!  it's faster and you get better service i think.  the food is excellent here!  \ni always get the same thing, buffalo chicken bites as an app. & the <mark>Chicken Lettuce Wraps</mark> for an entr\\u00e9e even though they are on the app menu they are a meal in them self!  if you're an adult beverage consumer like myself, try the blanco sangria!! it's delish!  the atmosphere is super chill and it is a nice place to get away from the las vegas heat in the summertime!"
        ], 
        "dish_name": "Chicken Lettuce Wraps"
    }, 
    {
        "text": [
            "we routinely stay at the venetian and have eaten at the grand lux at both casinos.  we have always enjoyed our meals there.  \n\nwe often order the <mark>Short Rib Sliders</mark> and <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> as entrees.  the chopped beef steak and kobe burger are great.  \n\nwe tried the breakfast buffet and were very pleasantly surprised.  there is not a huge selection but what was there was excellent.  choices include made to order omelets.  the weekend brunch is more elaborate but probably costs more than the $17.95 per person we paid."
        ], 
        "dish_name": "Short Rib Sliders"
    }, 
    {
        "text": [], 
        "dish_name": "Blue Cheese Salad"
    }, 
    {
        "text": [
            "if you like cheesecake factory you will love this place. from what were told the owners of cf also own this. it wasn't quite as expensive and the menu was great. the <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> were great as an appetizer. i had the carmel chicken and my wife had <mark>Greek Salad</mark>. as you probably know cf portions are huge and this place was just the same. we sat on the \"patio\" which is really just out in the middle of the venetian. it's crazy and very loud, but what do you expect in vegas.", 
            "came here 10 minutes prior to closing. orders an <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> and <mark>Greek Salad</mark>. both were great! fairly priced, liked it so much that we decided on it for breakfast before heading out. i opted for a belgian waffle with strawberries was so good sweet crunch and just a great waffle!"
        ], 
        "dish_name": "Greek Salad"
    }, 
    {
        "text": [
            "went there for lunch 6/27/2008. ordered half sandwich and soup lunch special. the <mark>Chili-lime Chicken And Mango Salad</mark> sandwich was very good. the clam chowder was also good. the portions are big and very satisfying. if you're looking for a reasonably priced restaurant to eat i suggest trying the grand lux cafe at the palazzo.", 
            "i came to this place on my lunch break and arrived around 11:15. there was an akward crowd waiting and staring at the hostess while she proceeded to jack around with one of the waiters. we waited until 11:23 to be seated... for no reason.. it was empty. \n\nnext, we wait over 10 minutse for a waiter to stop by... any waiter at all. when the waiter finally showed up he asked \"sooo anyone stop by yet?\" \"no\".. \"oh ok\".... how about an apology jerkoff since youve passed our table for 10 minutes now and could see we were the only table in an empty section! geez\n\ni ordered the chinese <mark>Chili-lime Chicken And Mango Salad</mark>. i guess it's ok if you really like rice noodles. basically i had  a salad that was 65% edible styrofoam. yum. not. nothing good or redeeming about this salad.. yuck\n\nwith so many amazing places to eat in vegas it disgusts me how many tourists waste their money at this chain crap hole. seriously walk 10 minutes and you'll find 50 better options.", 
            "holy crap. i dunno why, but i really liked the grand lux cafe.\n\ni was expecting nothing special after seeing that it was essentially just a fancy version of a cheesecake factory. and our waitress seemed a little odd at first... well, she was a little odd, but maybe that was just cause she was psychic. she was really on the ball and knew what we needed before we did.\n\nthe bread they bring you at the beginning was really crusty. which i am all over, but if you are not a fan of crunchy things, you may want to just go for the moist center and leave the crust.\n\nthe food was excellent. i had the pizza margherita <mark>Chili-lime Chicken And Mango Salad</mark> lunch special, and my wife had the pasta telephono <mark>Chili-lime Chicken And Mango Salad</mark> lunch special. the bleu cheese and vinaigrette dressings were fabulous. good bleu cheese is hard to come by, but this place nailed it.\n\nthe pasta was cheesy and delicious. came in a pink sauce (tomato + cream). if you are a fan of mac and cheese, you will probably like the pasta telephono.\n\nthe pizza margherita was really fantastic. i'm the kind of person to be disappointed by pizza since we make it at home from scratch, but this pizza lived up to my standards.\n\nand, did i mention the entire meal was vegetarian? we didn't even notice until afterward. i love that! vegetarian without being in your face about it.\n\nand, did i mentions the portions are generous? more than enough food!\n\nso color me a fan. i really didn't expect it to be that good. i'm tempted to go again, so maybe i should try the venetian location next time.", 
            "the grand lux cafe is by the same creator of the cheesecake factory, but my experience at this location in the palazzo was better than any cheesecake factory that i have been to.  yum!  \n\nfrom eating at the wynn buffet, lavo, suger & ice, to mcdonalds, table 10, and other eating adventures in vegas, this place was a nice happy medium.  although the service was a bit slow, the food was noteworthy!  i personally had the sandwich lunch special for about $10 which included half a <mark>Chili-lime Chicken And Mango Salad</mark> sandwich, soup, and a salad with their amazing ranch dressing.  the bf had steak and shrimp scampi, which was mmmmmm and omg mmmmmm!  the steak literally melts in your mouth with tender juiciness while the shrimp scampi was breaded with loads of wonderful flavor.  \n\nthumbs up to grand lux cafe!  i shall return! =)", 
            "cheesecake factory like menu, but much better quality! apparently it's like banana republic to old navy but for restaurants. i know it's a chain restaurant so sue me for giving them a 5 star review! there were 7 of us here for dinner so you know the service charge was in effect! those lucky servers! lol! i usually stick to a handful of menu items, but you can't really go wrong with anything on the menu. i usually order the crispy caramel chicken, indochine chicken and shrimp, fish n chips, jambalaya or any of their salads. their prices are really reasonable too!\n\ni happened to order the southwestern <mark>Chili-lime Chicken And Mango Salad</mark> which included chicken, lettuce, avocado, black bean, corn, crispy tortilla strips, tomatoes, a few other goodies along with a lime vinaigrette. the salad was super fresh and was really tasty! \n\ni always ate here before and will keep doing so as long as the quality of service and food are at this high of a level! i hope that they don't drop in quality like the cheesecake factory has in the last few years.", 
            "having to spend this much on food made me kinda squirm. i'd rather be blowing it on roulette somewhere. oh well, it was the only thing open this late without risking a dui. \n\nasian <mark>Chili-lime Chicken And Mango Salad</mark> was the best i've ever had! the watercress, fried won tons, cilantro and nutty dressing combined to make an awesome tasty salad. i must replicate this one at home. \n\ncorned beef and hash was great also. it was made with homemade corned beef, not the one in the can. (sorry, you filipinos). i can't find homemade corned beef and hash anywhere in the bay so having this lux at grand lux was wonderful.\n\nmixed berries were extremely fresh and plentiful. beautiful presentation as well. \n\nthe servings were surprisingly huge! i expected a big price for a small plate, but everything that came out was stacked heap high! we were oooohing and aaahhhhing everything that came out the kitchen. i wanted to order it all! too bad we lost almost all our spending money on the stupid slot machines.", 
            "this place is definitely on the top of my list when dining in vegas.  during a previous trip, we came here three times.  this time we only came here once since we were staying at the mirage and didn't want to walk in the hot, sunny weather.\n\nwe ordered the lunch special - half sandwich, soup <mark>Chili-lime Chicken And Mango Salad</mark> for $13ish to share.  enough for two people if you're not hungry but just need a quick bite.\n\ngreat service although it might be slower if it's during peak hours.  we went around 12-1pm so service was fast.\n\ntry the pastas!", 
            "we do a lot of work in vegas, often with a focus on conventions. when we're working at the sands convention center, the grand lux is our standard choice for meals. the food quality is always good, the meals are a good size, the prices are very reasonable and the service is typically fair. the menu is huge so there's always something you'll find to eat and you can eat 2 meals a day at this restaurant for a week without having to get the same thing twice.\n\nwe find this to be an easy choice when in vegas and eat there several times during every trip. we've had many large parties there (never with a reservation) and many business meetings as well as quick lunches for two, all with equal success. their lunch pizza <mark>Chili-lime Chicken And Mango Salad</mark> are yummy!", 
            "a little oasis of sanity in the surreal world of vegas. offers a full takeoit menu, a real plus in this town - sometimes you just don't want to sit in a cliche casino restaurant. service was quick, cheerful and i got 15 minutes of peace, waiting on my soup <mark>Chili-lime Chicken And Mango Salad</mark>. food is always good at grand lux (my personal favorite is just off the magnificent mile in chicago). prices are very reasonable - normal entree pricing ranging from 10 to 25+. skip the \"name\" joints, go to grand lux for good food that's not going to break the budget", 
            "landed.  got to the hotel.  first restaurant i saw.  it is glorified good diner.  i got the southwest <mark>Chili-lime Chicken And Mango Salad</mark>.  it is big and filling and it was fresh.   it was prechopped and the dressing was added so it was easy to eat with no chopping.   ingredients were fresh and you can get healthier food here and the menu is big...just like a dinner.   you can eat here all day and night.", 
            "i always want to come here whenever i come to vegas. food is great and in huge portions. i think this is probably opened by the same corp as cheesecake factory because the menu looks similar.\n\nhighly recommend:\n- miso salmon (salmon is very tender with just the right amount of miso)\n- chinese <mark>Chili-lime Chicken And Mango Salad</mark>\n- berry fizz (blended with 3 different berries w/ sprite)\n\ni'd give this place 5 stars but the waitress we had was really not attentive. she was really slow and forgot to bring our food.", 
            "note: this is cheesecake factory's sister chain.\n\nthis was a definite turn from all the fast food and buffets in vegas. after the club, early in the wee morning.. we stumbled drunk into the grand lux in the palazzo since it was closer than walking to the venetian. the waiters seemed more than happy to assist our drunken selves which was good.. hah. the group had burgers <mark>Chili-lime Chicken And Mango Salad</mark> and it was delicious.. or it could have been because we were all tired and drunk and any food was good food. nonetheless this was the place to be at after a long night of drinking and dancing in viva las vegas.", 
            "hmmm..............free food? yes please! well, technically i lost more on the table then what i was actually comped, but still it was free. \n\nstarter dish was a huge plate of chicken spring roll which was loosely wrapped, but the texture of the rice wrapper they used kept everything together. moving onto entrees we ordered the chicken and braised short rib combination, spaghettini with clams, house <mark>Chili-lime Chicken And Mango Salad</mark> and the lasagna. \n\n#1 chicken was good, but braised short rib was a little too salty to my liking! (surprisingly)\n#2 spaghettini with clams was best bang for the bucks! little bit of noodles and crap load of clams\n#3 house <mark>Chili-lime Chicken And Mango Salad</mark> was drenched in dressing, not a big fan. \n#4 lasagna........?????? must of been good because my boy ate every last bite of it without sharing! \n\ni would say it's above average as far as cafe food would go.", 
            "headline: avoid breakfast.\n\nwhile i was attending a conference at the sands conference center, i came here twice - once for a quick lunch and once for breakfast.  \n\nlet's start by saying that the food is the same as every other grand lux i've been to - it's good, but not spectacular, and they have options for everyone.  what makes things stand out (or not) is the service.\n\nlunch - we had good service - our waiter was very attentive.  i opted for a soup <mark>Chili-lime Chicken And Mango Salad</mark> plate -the salad, as normal, is reasonable.  the soup was a nice creamy chicken soup - overall pleasing.\n\nbreakfast the next day - seriously? a queue?  and thats just to get sat - expect a 20 minute wait once you get sat.  service sucked the big one.  however, they do have a buffet, so at least you can skip the waiting for your food as well.  we went in for a quick breakfast and ended up being late to the show.\n\nprices - good, even in comparison to non-las vegas places.  if you are looking for cheap eats in the hotel, this is the place for you.\n\nsorry - i can only give this an average grade - it's good but not spectacular, and breakfast service drags it down.", 
            "i come here probably once every trip home to vegas. i don't know why..it's just a solid place to go. the last two trips home i've really enjoyed this particular location. \n\nwhy? ....drumroll....\n\nbecause they have beignets! it is the only grand lux in vegas to have beignets. my bff ame and i absolutely love them here. \n\nit's a generous serving with about 8-9 beignets and three sauces: raspberry, chocolate, and creme fraiche. \n\name and i always end up mixing the raspberry with the creme fraiche each time. i recommend you do the same. it will change your life. \n\nas for their regular food, everything here is average to delicious, so you really can't go wrong. \n\ntheir salads are divine, as these are serious salads with great combos of ingredients. i particularly recommend the asian <mark>Chili-lime Chicken And Mango Salad</mark> and polynesian salad (the jicama and macadamia nuts with mango..yum). \n\n<mark>Chicken Lettuce Wraps</mark> are yummy as well, and their volcano shrimp is delicious. \n\nover the years it seems like they've changed the coating to their grand fried calamari.. it used to be rock shrimp, zuccini, and onions fried in a thin coating of batter, but now the coating is a lot thicker and more tempuralike. ame and i are not fans of the new formulation. still tasty, but not the same. \n\nlove the place for a quick bite. service is always fantastic 100% of the time. ame and i typically come here to catch up on girl time, and the servers are always gracious to keep pouring us water and refilling my tea/coffee when they don't have to (we always take care of them, of course for their kindness :). seriously - they're always the nicest servers i've seen in town. \n\nprices may seem a dollar or two higher than your average diner, but this isn't your average diner, and plus it's at the palazzo. duh. \n\ncome. get the beignets. be happy. and mix the creme fraiche and raspberry sauces.", 
            "more impressed than i thought i would be. the food <mark>Chili-lime Chicken And Mango Salad</mark> are great, nothing fancy. i also did the buffet for breakfast one morning, and it was good. no complaints about this place overall.", 
            "this was the start to a day of grazing las vegas with our foodie tour guide. i wanted to get some breakfast/brunch and everyone kept mentioning bouchon. unfortunately, they did not make it clear if it was the bistro or the bakery, so we tried to check out both. i'm not familiar with the venetian, so thinking that their own workers know where thing are located we asked several people. out of 4 people that we asked only 1 gave us correct directions. we zigged zagged the hotel until we found the elevator to the bistro.\n\ni wanted a light breakfast, but the prices at the bouchon bistro were a bit steep for such a meal. then we went to check out the bouchon bakery, which offered pastries which was not quite what my tummy wanted. then when all hope was lost and i was ready to give up and just eat at the food court the glowing red lights of the grand lux cafe drew us in.\n\nwe just missed the breakfast menu so lunch was it. i ordered the lunch soup <mark>Chili-lime Chicken And Mango Salad</mark>, which consisted of my choice of cream of chicken soup and a house salad. the soup was creamy with large pieces of chicken, peas, carrots and more. we also got the chicken pot pit, which looked a lot like my cream of chicken soup with a crust that was laid on top. the difference with the pot pie and the soup was that it appears as if they grilled the large pieces of chicken found in the pie.", 
            "yep, this became a staple during my last trip to vegas. we were staying at the palazzo and couldn't figure out where to eat, so we stopped here after reading the reviews. \n\nit's beautiful. it feels like you're walking into a very modern, well designed restaurant with bar. the finishes are great and i expected it to be dressy, but it was casual. whew, not having a suit didn't ruin me this trip.\n\nour wait staff was all amazing, which really helps. since i ate here quite a bit, i'm going to review each dish.\n\nsmoked salmon platter with tomato ($13.95) onion, cream cheese and a toasted bagel. very tasty. we didn't feel like a huge breakfast, so it was a good size. maybe not the best value on the menu, but the quality was quite good.\n\nduck triangles ($4.95) crispy wrappers filled with minced duck, onions, garlic, ginger, soy and sesame. amazing. this was wonderful. the duck was perfect as there was enough to get the taste and it melded quite well with the dipping sauce. must try in my humble opinion. \n\nmini pizza's ($5.95)\ntomato and fresh mozzarella: cherry tomatoes, garlic, mozzarella, fontina and parmesan cheese. a great little pizza. so nice to share with another appetizer or if you're not super hungry, just the right size. thin crust style that was very tasty and not greasy or oily. \n\nroasted chicken and potato:roasted garlic, fresh rosemary, mozzarella and parmesan cheese. one of my favorite type of pizzas. i don't miss the tomato sauce at all and wow the flavors really pop on this one. \n\n\n<mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark> $(9.95) organic greens tossed with blue cheese dressing and topped with bacon, tomato, croutons and maytag blue cheese crumbles. good salad. i liked it but i wanted to try something else. it went really well with the mini pizza though.\n\n<mark>Chili-lime Chicken And Mango Salad</mark> ($10.95) grilled chicken, sweet mango, avocado, jicama, sweet corn, onions, cilantro and romaine, tossed with chili-lime vinaigrette and crispy tortillas.i ended up ordering this salad twice because it was so tasty. it was fresh, the mango added a little citrus, the avocado was creamy, the corn was awesome for adding texture with flavor, and there was a wonderful crunch from the tortillas. \n\npotato gnocchi with vodka sauce ($13.95) delicious housemade gnocchi tossed in creamy vodka sauce and fresh basil. wow. wow. it may have been the best gnocchi i've had. ever. amazing texture and consistency that is lacking at most places. the vodka sauce was perfect for this. paired really well with the previous salad i reviewed.\n\nif you want a great place to eat with darn good prices, this is definitely the place.", 
            "my husband and i heard this restaurant was the cheesecake factory's sister restaurant, which is one of our favorite places to eat, and were very excited to eat here. boy was our thinking way off from the truth! we sat down in the bar area and our booth was right next to a glass wall. you are sitting on the other side of other diners and it was very uncomfortable having them stare at your food and you while you ate. of course it was hard for us to not look and stare as well. the set up was very poor. we both decided to order the same meal, the lunch portion of pasta telephono <mark>Chili-lime Chicken And Mango Salad</mark>. everyone around us received fresh bread (as we saw everyone next to us through the glass wall) i guess our waitress decided we didn't need it. our salads arrived and i got the house salad with ranch, which was pretty good. my husband order the caesar salad. it came with whole leaves and spicy caesar dressing, so spicy my husband couldn't even eat it. and who wants to cut their salad with a knife and fork? when we got our pasta it was completely dried out on the top and the pasta sauce was runny. the noodles wouldn't even hold the pasta sauce. in the middle of my husband eating, he immediately said he didn't feel well, went to the bathroom and got sick. for the rest of the day he was so sick to his stomach! this place is awful and the food is really poor quality. if you're looking for an extensive and creative menu you might as well hit the real thing and go to the cheesecake factory.", 
            "not everything in vegas is overpriced. case in point- grand lux caf\\u00e9. it's from the owner of the cheesecake factory. the restaurant is casual but elegant. it's also great for groups. \n\nthe menu is extensive and it takes some time to peruse it. i went with a small salad: <mark>Chili-lime Chicken And Mango Salad</mark>. a small salad could feed 2- generous portions! i had enough left over to take back and eat when i was starving during the middle of the night. it was very satisfying. the mangos were sweet and the chili-lime vinaigrette went well with it.\n\nif you're on a budget, then i definitely recommend this place. actually, this place is worth checking out regardless. come hungry!", 
            "i'm a little torn about this place now. had i reviewed it a couple years ago, it would have been all positive, however, so much has changed. i've been dining at grand lux cafe consistently since they opened until a couple years ago (i had previously frequented the venetian location). granted, i didn't frequent as often in the last 2-3 years since las vegas' local restaurant scene has stepped up and i found new, better spots to obsess. but, it was my visit in september 2013 that turned me away. the quality has diminished significantly and dishes that were once favorites, are now very disappointing! also, food portions have gotten smaller and prices have remained the same (or increased). where's the money going?\n\none of my favorite sections of their menu is the gr<mark>Chili-lime Chicken And Mango Salad</mark>. large portions for around $13-17. my favorites are the southwestern salad and the manhattan salad. they've changed the manhattan salad a bit since i first had it a few years ago, but it's still good. i like the fresh beets and the large assortment of fresh vegetables and legumes; plus, the house vinaigrette is great. the last time i had this salad, however, it was oddly not chopped. maybe someone got lazy that day? i'd hate to think that it's just served like that now. view photos below:\n\nexhibit a: manhattan salad in august 2014 (what a chopped salad should look like). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=n_rprbjxzdz2hnz-25bkfg#n_rprbjxzdz2hnz-25bkfg\n\nexhibit b: manhattan salad in october 2014 (this is what i was served just two months later). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=acnz4-xjihtb6koh7ktcma#acnz4-xjihtb6koh7ktcma\n\ni haven't tried a lot of their newer small salads, but they used to serve a really nice <mark>Spicy Calamari Salad</mark>. delicious and crispy calamari and fresh greens with these two wonderful sauces/dressing. it's a shame that it's no longer on the menu. \n\nother dishes that i've enjoyed: empanadas, buffalo chicken bites, <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, crispy thai shrimp & <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, pasta pomodoro, cajun shrimp & chicken jambalaya, and indochine shrimp & chicken.\n\noh, their new orleans beignets are fantastic! they're made to order, so you'll need to order in the beginning of your meal. they have a great batter and i love the sauces: jack daniels creme anglaise, raspberry, and chocolate. the creme anglaise is magic and i love mixing it with the tart raspberry sauce. it's divine.\n\ntheir burgers are good (or at least they were good the last time i had them). thick, juicy angus burgers that are cooked to order (medium rare, yay!). i've also enjoyed their sandwiches. my go-to sandwich used to be the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>. i ordered this staple again during my visit in december and it was terrible. i just don't understand what's going on! i've had this sandwich multiple times and there have never been any issues. the sandwich was messily assembled and there was no flavor. i think they may changed the mayo (website shows black bean mayo?) because i'm pretty sure it used to have a spicy element that gave it zing. they should probably rename the sandwich and take out the word 'spicy' because now the only \"spicy\" ingredient is the pepper jack cheese.\n\nmore disappointment: their fries used to be so great and now they're horrible! also, i recently tried another one of my go-to favorites, chicken pot pie, and it has strayed so far from what it used to be. such a shame.\n\ni just had the kale and avocado salad (fresh kale, avocado, spicy roasted poblano chiles, black beans, feta cheese, onions, toasted pumpkin seeds, and citrus vinaigrette) on my most recent visit last month and it was fantastic! i couldn't believe how great it was after so many disappointments recently. it has restored a little faith.\n\ni doubt i'll attempt any of my old favorites again in fear of more disappointment, but i do still like glc's salad selection. i'm just hoping the next time i order a manhattan salad, that it is indeed chopped.", 
            "crowded at lunch time on a monday, we had to wait about five minutes before being seated.  but, as usual, what followed was worth the wait.\n\na bowl of steaming mushroom barley soup, with mushrooms, carrots, celery, and barley (although not much of it), and a kicky spicy broth was a good opener.  this was  quickly followed by a very tasty asian <mark>Chili-lime Chicken And Mango Salad</mark> which, when deconstructed, contained sliced white meat chicken, crisp wontons, rice noodles, lettuce, napa cabbage, edamame, sugar snap peas, carrots, green onion, almonds, cilantro, and a homemade light asian dressing.\n\nseating was comfortable.  service was friendly and quick.  in short, another satisfying meal at grand lux cafe!\n\nxxxx-1/2 stars overall!", 
            "food was decent, i had the <mark>B.b.q. Chicken</mark> pizza <mark>Chili-lime Chicken And Mango Salad</mark> for their lunch special. everything i expected.\n\nservice was seriously lacking though. for some reason, one which i assume to be descrimitory in nature, we were the only table not given any bread. our food also took twice as long. our appetizer didn't even come out by the time the table next to us got all their food. we arrived about the same time as them."
        ], 
        "dish_name": "Chili-lime Chicken And Mango Salad"
    }, 
    {
        "text": [
            "one of my family's favorites!  consistently excellent.\ntonight, the boy had sloppy joe made w/ beef short rib!  outstanding texture and flavor.  its served in a new england roll (like a lobster roll bread) that is soft, tasty, toasted to a nice crisp on the outside and buttery.  served w/ diced white onions.  awesome.\ni had the chicken parm / shrimp scampi combo w/ angel hair pasta w/ marinara.  outstanding and for $19.80.\nmy wife had the <mark>Spicy Calamari Salad</mark>.  the calamari was fried to perfection with a puffy, crisp batter that enhanced the flavor of the calamari.\nbe warned that the serving sizes are large!  we will be back!", 
            "deliciously delicious!\n\ni love their spinach and artichoke dip, drive in burger, egg white omelet, <mark>Spicy Calamari Salad</mark>, edamame, chicken and waffles, and the bread. \n\nbest place to eat brunch, lunch, dinner, and very late night dinner. service is awesome! \n\nbut they close at 3 a.m. the one at the venetian is 24 hours.\n\nit's like cheesecake factory but i like grand lux more.", 
            "i'm a little torn about this place now. had i reviewed it a couple years ago, it would have been all positive, however, so much has changed. i've been dining at grand lux cafe consistently since they opened until a couple years ago (i had previously frequented the venetian location). granted, i didn't frequent as often in the last 2-3 years since las vegas' local restaurant scene has stepped up and i found new, better spots to obsess. but, it was my visit in september 2013 that turned me away. the quality has diminished significantly and dishes that were once favorites, are now very disappointing! also, food portions have gotten smaller and prices have remained the same (or increased). where's the money going?\n\none of my favorite sections of their menu is the gr<mark>Chili-lime Chicken And Mango Salad</mark>. large portions for around $13-17. my favorites are the southwestern salad and the manhattan salad. they've changed the manhattan salad a bit since i first had it a few years ago, but it's still good. i like the fresh beets and the large assortment of fresh vegetables and legumes; plus, the house vinaigrette is great. the last time i had this salad, however, it was oddly not chopped. maybe someone got lazy that day? i'd hate to think that it's just served like that now. view photos below:\n\nexhibit a: manhattan salad in august 2014 (what a chopped salad should look like). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=n_rprbjxzdz2hnz-25bkfg#n_rprbjxzdz2hnz-25bkfg\n\nexhibit b: manhattan salad in october 2014 (this is what i was served just two months later). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=acnz4-xjihtb6koh7ktcma#acnz4-xjihtb6koh7ktcma\n\ni haven't tried a lot of their newer small salads, but they used to serve a really nice <mark>Spicy Calamari Salad</mark>. delicious and crispy calamari and fresh greens with these two wonderful sauces/dressing. it's a shame that it's no longer on the menu. \n\nother dishes that i've enjoyed: empanadas, buffalo chicken bites, <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, crispy thai shrimp & <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, pasta pomodoro, cajun shrimp & chicken jambalaya, and indochine shrimp & chicken.\n\noh, their new orleans beignets are fantastic! they're made to order, so you'll need to order in the beginning of your meal. they have a great batter and i love the sauces: jack daniels creme anglaise, raspberry, and chocolate. the creme anglaise is magic and i love mixing it with the tart raspberry sauce. it's divine.\n\ntheir burgers are good (or at least they were good the last time i had them). thick, juicy angus burgers that are cooked to order (medium rare, yay!). i've also enjoyed their sandwiches. my go-to sandwich used to be the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>. i ordered this staple again during my visit in december and it was terrible. i just don't understand what's going on! i've had this sandwich multiple times and there have never been any issues. the sandwich was messily assembled and there was no flavor. i think they may changed the mayo (website shows black bean mayo?) because i'm pretty sure it used to have a spicy element that gave it zing. they should probably rename the sandwich and take out the word 'spicy' because now the only \"spicy\" ingredient is the pepper jack cheese.\n\nmore disappointment: their fries used to be so great and now they're horrible! also, i recently tried another one of my go-to favorites, chicken pot pie, and it has strayed so far from what it used to be. such a shame.\n\ni just had the kale and avocado salad (fresh kale, avocado, spicy roasted poblano chiles, black beans, feta cheese, onions, toasted pumpkin seeds, and citrus vinaigrette) on my most recent visit last month and it was fantastic! i couldn't believe how great it was after so many disappointments recently. it has restored a little faith.\n\ni doubt i'll attempt any of my old favorites again in fear of more disappointment, but i do still like glc's salad selection. i'm just hoping the next time i order a manhattan salad, that it is indeed chopped."
        ], 
        "dish_name": "Spicy Calamari Salad"
    }, 
    {
        "text": [
            "grand lux cafe at the palazzo has over 200 items on the menu, but everything tastes great and is made fresh daily. their drinks come with mouthwatering garnishes and taste great. i have had the luxury of trying almost everything on the menu and will attempt to describe everything i have tried.\n\nnew orleans beignets: this is a bake-to-order dessert that is available for breakfast as well as throughout the day. the beignet is a french-style fried doughnut that is light and fluffy and comes with four sauces on the side: jack daniel's creme anglaise sauce, raspberry sauce, chocolate sauce, and cinnamon sugar. \n\njamaican pork tenderloin: this dish comes out with two fried wonton chips looking like pig's ears to identify the dish and comes with the pork in the middle (chili-rubbed) over sweet mashed potatoes with white rice and black beans sitting over a black pepper sauce. the black pepper sauce is the only thing spicy in the dish, although not too spicy for my taste. bring on the spicy!\n\npasta telephono: penne with melted cheese that creates a telephone cord (who has landline phones with curly cords these days?) when you pick it up with a fork, yum!\n\nsunday night pasta: short rib, chunks of beef, and ground beef go into the mix of spaghettini. although surely inspired by leftovers, this dish doesn't taste like leftovers at all. it is truly yummy and especially when it came out piping hot! it is served all nights of the week.\n\nroasted beet and goat <mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark>: this dish has pistacchios in it but i love it for that and the goat cheese as well. the beets are seasonally different in colors, so they may come purple or yellow. it's served with a hazelnut-citrus vinaigrette.\n\nbelgian waffle: the waffle comes sprinkled with powdered sugar and hot maple syrup on the side. it's simple and delicious, almost purist.\n\nexpress breakfast bar: a selection of yogurt, granola, wheat or white bread (there's a toaster for people to toast their own bread), english muffin, or bagels (ask for the cream cheese, it's not at the bar...boo), fresh fruit, a made-to-order omelette bar, bacon, scrambled eggs (probably made from powder), hashbrowns, and some small breakfast pastries like scones/croissants/cheese danishes/streuseled pastries. it includes juices and coffee and some other drinks, possibly milk and fountain drinks.\n\nhot chocolate: probably the best hot chocolate i have ever had in my life, with no sediments, made with whipped foam on top and some rich whipped cream and a swirl of hot chocolate, but the drink is not too sweet and not too bland. \n\nwild mushroom burger: not a burger with mushrooms as i first thought, but a patty made of mushrooms and tasting so good that i almost would turn vegetarian (almost!). sesame seeds come on the bun and there's a side of bibb lettuce, tomatoes, and onions with an avocado cream sauce, or was it basil aioli? anyway, it was good!\n\nvietnamese chicken summer rolls: eight pieces comes with thai bbq sauce and peanut sauce with the chicken, slivers of carrots and lettuce throughout the summer roll (rice flour wrap) and ready to be dipped! i would ask for some hot sauce, but that's just me.\n\nisland cooler: non-alcoholic, made with pineapple, mango, and some other juice, tastes really yummy and comes with an edible garnish of strawberry, pineapple, and lime. \n\nwarning: portions are gargantuan!~ share share share!\n\ni gave this place a five because i feel that it is a very caring place with the servers not upselling anything and being honest about portion sizes. i also think that the atmosphere is very grand but still casual and the food is of great value. you get more than what you paid for.", 
            "the prices are decent (especially taking into consideration this place is located inside the palazzo), and the selection is huge.  plus, it's open 24 hours.  it feels a lot like cheesecake factory, and they even have cheesecake factory desserts here.  i'm guessing they're sister companies, but i digress.  i figured i had to eat light, since i had loaded up on beer (guiness at that), so i went with the roasted beet and goat <mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark>.  the hazelnuts were a nice touch!  high five chef guy!  and the goat cheese was quality.  it didn't taste at all like the cheap stuff that tastes like dirty barn animal smell.  i am a happy camper", 
            "grand lux cafe reminds me a bit of the cheesecake factory in it's decor and food options. i was pleasently surprised at the prices though. for vegas, this restaurant was one of the lesser expensive options. for $13.95 ordered the alfredo noodles - which were excellent. simple, but the sauce was creamy and delicious as though they made it from scratch. also got a warm goat <mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark>. the 'fried' goat cheese balls were delish but did not enjoy the dressing as much....it had apple chunks drizzled with honey which made the salad just a but too sweet. not bad though. \n\n\neveryone else at my table received their meals - all looked great and large portions. i would definitely come back!", 
            "after having terrible experiences at several \"fine dining\" restaurants on our vegas trip, we were thrilled to have wonderful service and great food at grand lux cafe.  we wanted a convenient and relatively inexpensive meal before our red eye flight home.  we had a wonderful, attentive, friendly waiter.   \n\nmy husband and i each order the cream of chicken soup and a salad - the wedge for me, which is considered a \"small\" salad though it is literally half of a head of lettuce, and my husband had the <mark>Roasted Beet And Goat Cheese Salad</mark>.  everything was very good and came out quickly.  \n\nthe waiter had alerted us to their made-to-order desserts when we first arrived, so we order the beignets.  the were amazing!  the came out super hot with three dipping sauces - raspberry, chocolate, and creme anglaise (maybe with bourbon in it?).  there were so many beignets!  i ended up over eating because they were so good i just couldn't help myself.  the server (also friendly) who delivered our dessert recommended mixing the sauces and boy was she right - the raspberry and chocolate together were to die for.  \n\nthis was also the only time on our entire trip that a manger stopped by our table to see how things were.  we made sure to tell him what a wonderful job our waiter had done and how happy we were after having bad service at so many \"fine dining\" restaurants previously in the week.  he was also very nice. \n\nthe entire meal (with drinks) ended up being $70 (with an almost 30% tip), money well spent!", 
            "yep, this became a staple during my last trip to vegas. we were staying at the palazzo and couldn't figure out where to eat, so we stopped here after reading the reviews. \n\nit's beautiful. it feels like you're walking into a very modern, well designed restaurant with bar. the finishes are great and i expected it to be dressy, but it was casual. whew, not having a suit didn't ruin me this trip.\n\nour wait staff was all amazing, which really helps. since i ate here quite a bit, i'm going to review each dish.\n\nsmoked salmon platter with tomato ($13.95) onion, cream cheese and a toasted bagel. very tasty. we didn't feel like a huge breakfast, so it was a good size. maybe not the best value on the menu, but the quality was quite good.\n\nduck triangles ($4.95) crispy wrappers filled with minced duck, onions, garlic, ginger, soy and sesame. amazing. this was wonderful. the duck was perfect as there was enough to get the taste and it melded quite well with the dipping sauce. must try in my humble opinion. \n\nmini pizza's ($5.95)\ntomato and fresh mozzarella: cherry tomatoes, garlic, mozzarella, fontina and parmesan cheese. a great little pizza. so nice to share with another appetizer or if you're not super hungry, just the right size. thin crust style that was very tasty and not greasy or oily. \n\nroasted chicken and potato:roasted garlic, fresh rosemary, mozzarella and parmesan cheese. one of my favorite type of pizzas. i don't miss the tomato sauce at all and wow the flavors really pop on this one. \n\n\n<mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark> $(9.95) organic greens tossed with blue cheese dressing and topped with bacon, tomato, croutons and maytag blue cheese crumbles. good salad. i liked it but i wanted to try something else. it went really well with the mini pizza though.\n\n<mark>Chili-lime Chicken And Mango Salad</mark> ($10.95) grilled chicken, sweet mango, avocado, jicama, sweet corn, onions, cilantro and romaine, tossed with chili-lime vinaigrette and crispy tortillas.i ended up ordering this salad twice because it was so tasty. it was fresh, the mango added a little citrus, the avocado was creamy, the corn was awesome for adding texture with flavor, and there was a wonderful crunch from the tortillas. \n\npotato gnocchi with vodka sauce ($13.95) delicious housemade gnocchi tossed in creamy vodka sauce and fresh basil. wow. wow. it may have been the best gnocchi i've had. ever. amazing texture and consistency that is lacking at most places. the vodka sauce was perfect for this. paired really well with the previous salad i reviewed.\n\nif you want a great place to eat with darn good prices, this is definitely the place.", 
            "third time since 2009 and always leave full and happy. even the bleu <mark>Blue <mark>Roasted Beet And Goat Cheese Salad</mark></mark> leaves you wanting more because it's so good."
        ], 
        "dish_name": "Roasted Beet And Goat Cheese Salad"
    }, 
    {
        "text": [
            "we tried their shrimp and chicken jambalaya, pasta with chicken, mushroom & sun dried tomatoes, spaghetti pomodoro and <mark>Four Cheese</mark> pizza. good food, reasonable price and good service. we love this place and will definitely come back again!!"
        ], 
        "dish_name": "Four Cheese"
    }, 
    {
        "text": [], 
        "dish_name": "Margherita"
    }, 
    {
        "text": [
            "i ordered some burger with bacon and short ribs and onions <mark>Sausage, Pepperoni And Mushrooms</mark>. there were no short ribs on it at all. but even without it, the burger was awesome.", 
            "food here is great. i eat here at least once ever vegas trip (usually 2-3 times) and i've never been disappointed. i've had the crispy flautas, chicken pasta w/ sun-dried tomatoes <mark>Sausage, Pepperoni And Mushrooms</mark>, pasta carbonara, pasta molino, and others and loved them all. the portions are huge too--perfect to split with your friend or to have leftovers for more munchies when you're drunk again 4 hrs later. and if you go during lunch, they have lunch-sized portions (which are still big) of the pastas for a few bucks cheaper. \n\nmy only complaint is the service. just as i've never been disappointed by the food, i've never been happy with the service. the bread often comes out after the food and a few pointed requests for it, the food always takes forever to be served, and the waitresses rarely come by to check on our table to refill our drinks or see how we're doing. i understand their desire to give us a wide berth when our party is a group of 12 drunkasses, but it's been like that even when i've gone with 2 other girls completely sober and composed in the middle of the afternoon.", 
            "take away:  great variety of food at reasonable prices; looks and feels like it's sibling, the cheesecake factory.\n\nrecommendations:  the <mark>B.b.q. Chicken</mark> pizza is pretty good, but it really just depends on what you're in the mood for.\n\ndetails:\n\natmosphere:\nit has the familiar cheesecake factory d\\u00e9cor.  it's not a fancy restaurant, but for what you pay, it feels like you're going to a pretty nice looking restaurant.  ambience is pretty relaxed and can be great for couples and a small family gathering.  the tables, linen, and dishes were all clean as well.\n\nservice:\nfor the several times i've been here, the service has been pretty good.  the servers have generally been pretty quick and checked in from time to time.  it does, however, feel as if they are slightly understaffed.  a few times, we needed service but couldn't find our server for over 5 minutes.  during my last visit, we had a party of 8 and our server handled our order fairly expeditiously.  she was very friendly as well.  the wait for a party of 8 was about 15 minutes, while the smaller parties (2-5) got their tables immediately (just an fyi).\n\nfood quality / selection:\nhuge variety of food from pastas to sandwiches.  take a look at their menu here: http://www.grandluxcafe.com/menu.htm.  the presentation is above average.  the look and feel of the plates is similar to most other full service restaurants (especially the chain ones).  the food is above average for the most part (see details below).\n\npricing/value/convenience:\ngreat value; above-average portions.  this place is a great place to share an entr\\u00e9e, an appetizer, and a dessert if you want.\n\ndishes that we ordered:\n<mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (eh, wouldn't recommend it; it has a little spicyness to it though); <mark>B.b.q. Chicken</mark> pizza (this thin crust pizza was pretty flavorful); pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark> (not bad, but not great); pasta carbonara (flavor was good, but it just wasn't creamy enough and felt a little bit dry); artichoke dip (was a little bit dried/overcooked - a part of it was actually burnt; wasn't creamy enough also).", 
            "like almost all of the other reviewers said, this place definitely is a sibling of cheesecake factory. you can tell by its decor as well as the menu (there were a lot of dishes that were the same from cheesecake factory). \n\nservice: once i walked in, there was a nice ambiance around me, and we were seated immediately. our waiter was very helpful and made sure we were comfortable with our food and kept checking up on us every so often.\n\nfood: for appetizers, i ordered the spinach dip -- pretty good. i ordered the pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark>, hoping that since this restaurant is from cheesecake factory, it would taste the same as the dish i usually order at cf. i was somewhat wrong. the cream sauce grand lux uses for that dish has a rather distinct/weird taste, and i didn't like it enough to finish the plate.\n\ni definitely would come here again to try the other dishes. the pricing is pretty decent too. also, i hear it's open late (although the grand lux at the venetian opens 24 hrs), so that's definitely a plus for people who are dancing the night away and get a little rumble in their stomach. (=", 
            "where do i begin... i've been to grand lux so many times in my 8 years in vegas. i prefer the newer palazzo location to the venetian mainly because of convenience. parking and walking from the venetian is such a hassle, while if you know where to park at palazzo it'll take you up right by grand lux. \nthe restaurant is appropriately named - the decor is both grand and lux especially for what is basically a casino coffee shop. high open ceilings with lots of mirrors and other shinies, comfy seats and always very clean w great service every time. \ni don't think i've ever had anything i didn't like, but i usually stick to my favs. its hard for me to resist my sunday night pasta - its spaghetti with a meat sauce made up of a lot of different things. meant to be like a dish where you throw all of the week's leftovers together (but made fresh) its packed with short ribs, hamburger, <mark>Sausage, Pepperoni And Mushrooms</mark> and i'm sure other things i forgot about. the portion's huge, easily 2 maybe 3 meals especially if you fill up on their warm crusty bread and butter. i'm embarrassed to admit that our basket always needs a refill :)\nother things worth mentioning - duck pot stickers, shrimp w pasta, short rib grilled cheese, their burger w short ribs on top. we're usually too stuffed to get dessert but i finally remembered this time to plan ahead and order the warm rustic apple pie. it's baked to order so takes 20 minutes, i'd suggest putting it in with your dinner order. even if you forget to order ahead of time, it's well worth the wait. as you can see in the picture its really more of an apple tart. warm flaky pastry crust, sweet but slightly tart apple slices, topped with vanilla ice cream and finished with powdered sugar. i'd go back just for that pie. \ngive grand lux a try if you've never been. their massive menu is guaranteed to have something that everyone will like.", 
            "pros:\n\n1. fast and quality service. we were seated immediately, and our waiter was freaking awesome. he was attentive, friendly and even packed up all our food when we decided we wanted to finish it in our room in our pjs. the sunday night pasta wasn't on the late night menu, but when he realized how much my friend had been looking forward to it, he asked the chef to make it. that's great service. \n\n2. food. i ordered the sunday night pasta to share with a friend. short rib meat with a delish marina <mark>Sausage, Pepperoni And Mushrooms</mark>. pasta was perfect and short rib meat was phenomenal.", 
            "everyone makes fun of my boyfriend and i for eating here for every meal while we're in vegas. \n\nreasons we love it:\n1. asian nachos- most amazing creation known to man\n2. open late, so if you're up late drinking or gambling, it's a great place to fulfill a midnight snack/munchie\n3. everything on the menu is delicious\n4. open for all meals.  breakfast is great here.\n5. something for everyone- every food genre you can think of, many different portion sizes (they have a small bites/tapas menu).\n6. affordable and casual. don't feel like you have to dress up and get all schmoozy for every meal while you're in vegas.  this is a good \"normal people\" place.  while it's pricier than, say, chili's, it's good for the portions you get.  which leads me to....\n7. big portions\n\ni'm not joking. everything really is good here.  let's talk about the asian nachos first.  big, round wontons with melted cheese, chicken, green onions, peanut sauce, wasabi cream sauce, and banging rice.  i dont know wtf they put in it but it's so freaking good.  i dream about asian nachos and crave them constantly.  i've forced all of my friends to try them and now they're all just as addicted.\n\nfor the reset of the food:  all of their soups are delicious, even if they sound boring, each one packs a punch of flavor.  i like ordering a lot of little things off the tapas menu.  buffalo chicken bites? hell yes.  pastas are delicious, my boyfriend loves their pepperoni pizza- they give you tiny, perfectly crispy <mark>Pepperoni</mark>.  burgers are great.... literally everything is good.  for breakfast i had the chilaquiles and they were awesome.\n\nthis location in the palazzo is better than the one in the venetian because it's less known about and less crowded.\n\nthe one bad thing i can say is that service can be hit or miss.  i feel like i get bad service more often than good, but i don't care because it's so damn good.", 
            "the day before christmas 2013, @ the palazzo in las vegas.\n\nback at the grand  lux cafe for lunch before driving home.  ordered the lunch size, chicken pot pie.  this is one of my all time favorite items.\n\nthe service was good, with the waiter bringing us bread without us having to remind him.  the bread was warm, with a crunchy crust but soft and fluffy inside.\n\nas always the food is very tasty and quite filling. even the lunch size chicken pot pie. the crust was flaky, the filling had large chunks of chicken, peas, carrots, potatoes, <mark>Sausage, Pepperoni And Mushrooms</mark>.\n\nwill have too spend some time in the casino to digest before the drive home.\n\n5 stars.", 
            "so i remember going to this place a long time ago and thought it was only okay, but my friend convinced me that it was yummy and that i should return.\n\nthis location had no wait on a sunday afternoon and we were seated right away in the corner of the restaurant. although we were tucked away in the back corner, the server did not forget about us and attended to us immediately. warning: portions are big! the three of us ordered three appetizers and three entrees... lets just say we were extremely full and food coma-ing for awhile.. \n\nappetizers:\nasian nachos- who even thinks of this stuff! crispy wonton chips with chicken, wasabi cream, cheese, and sweet hot peanut sauce with fried rice in the middle. i don't know if these were made for asians or something but damn were these good! the slight hint of wasabi cream really added to the nachos, and adding the fried rice on top of the chip was super asian and delicious.\n\nbrie wonton with creamy brie cheese, fresh pineapple, and caramelized onion marmalade- this was okay, i expected better. i didn't taste the pineapple in the wonton, and they left the rind on the brie so the taste was kind of bitter. sauce was good.\n\ncrispy pepperoni mini pizza- they added parmesan slices on top which really added to the pizza in terms of texture and and flavor. other than that, regular pepperoni pizza.\n\nentrees:\nlunch special salad and pasta carbonara- the pasta was bomb. yeah you can make pasta at home but the bacon bits, chicken and cheese was super flavorful and tasty. the noodles were also cooked well. \n\nhousemade pierogies- pierogies are basically potato dumplings which they made by hand, and they added roasted short rib with mushrooms and onions. yum. yeah pierogies are plain and heavy and basic, but it's good comfort food and perfect after a long night. \n\navocado chipotle cheeseburger- this thing was giant. i asked for medium rare <mark>Sausage, Pepperoni And Mushrooms</mark> instead of peppers, and it was a giant stacked burger. the cheese was melted all over the place (perfectly) and the meat was cooked the way i wanted it. the avocados were chopped (i expected it to be in slices) and it kept falling all over the place. really messy dish, but good burger and good fries. \n\noverall this restaurant is perfect as a heavy lunch or dinner. definitely exceeded my expectations from what i had last time (which i don't really remember). total came out to be $71, which is pretty fair as we did order a lot of food.. would definitely come if staying at palazzo or venetian after a long night.", 
            "this place is on the pricey end but my friends and i wanted to eat on the strip on a sunday morning.  the dishes are pretty big and heavy on calories.  \n\nwhat we ordered:\n1) pasta with chicken, sun-dried tomato <mark>Sausage, Pepperoni And Mushrooms</mark> (tossed with sun-dried tomato, fresh mushrooms, garlic, cream and parmesan cheese)\n\n2) spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> (grilled chicken breast topped with avocado, pepper-jack cheese, corn, lettuce, tomato and black bean-mayo on our grilled flatbread)\n\n3) thai fried chicken (crispy breast of chicken in a spicy thai b.b.q. sauce. served over steamed white rice and sauteed vegetables)\n\nall the dishes were pretty good.  we were happy with our orders and the fact that this place carried sriracha; i guess it's becoming more popular.\n\nour waitress was nice.  she did everything that was expected.  only thing she had forgotten was the bread.  she never would have brought it out if we didn't ask for it."
        ], 
        "dish_name": "Pepperoni"
    }, 
    {
        "text": [
            "i ordered some burger with bacon and short ribs and onions <mark>Sausage, Pepperoni And Mushrooms</mark>. there were no short ribs on it at all. but even without it, the burger was awesome.", 
            "food here is great. i eat here at least once ever vegas trip (usually 2-3 times) and i've never been disappointed. i've had the crispy flautas, chicken pasta w/ sun-dried tomatoes <mark>Sausage, Pepperoni And Mushrooms</mark>, pasta carbonara, pasta molino, and others and loved them all. the portions are huge too--perfect to split with your friend or to have leftovers for more munchies when you're drunk again 4 hrs later. and if you go during lunch, they have lunch-sized portions (which are still big) of the pastas for a few bucks cheaper. \n\nmy only complaint is the service. just as i've never been disappointed by the food, i've never been happy with the service. the bread often comes out after the food and a few pointed requests for it, the food always takes forever to be served, and the waitresses rarely come by to check on our table to refill our drinks or see how we're doing. i understand their desire to give us a wide berth when our party is a group of 12 drunkasses, but it's been like that even when i've gone with 2 other girls completely sober and composed in the middle of the afternoon.", 
            "take away:  great variety of food at reasonable prices; looks and feels like it's sibling, the cheesecake factory.\n\nrecommendations:  the <mark>B.b.q. Chicken</mark> pizza is pretty good, but it really just depends on what you're in the mood for.\n\ndetails:\n\natmosphere:\nit has the familiar cheesecake factory d\\u00e9cor.  it's not a fancy restaurant, but for what you pay, it feels like you're going to a pretty nice looking restaurant.  ambience is pretty relaxed and can be great for couples and a small family gathering.  the tables, linen, and dishes were all clean as well.\n\nservice:\nfor the several times i've been here, the service has been pretty good.  the servers have generally been pretty quick and checked in from time to time.  it does, however, feel as if they are slightly understaffed.  a few times, we needed service but couldn't find our server for over 5 minutes.  during my last visit, we had a party of 8 and our server handled our order fairly expeditiously.  she was very friendly as well.  the wait for a party of 8 was about 15 minutes, while the smaller parties (2-5) got their tables immediately (just an fyi).\n\nfood quality / selection:\nhuge variety of food from pastas to sandwiches.  take a look at their menu here: http://www.grandluxcafe.com/menu.htm.  the presentation is above average.  the look and feel of the plates is similar to most other full service restaurants (especially the chain ones).  the food is above average for the most part (see details below).\n\npricing/value/convenience:\ngreat value; above-average portions.  this place is a great place to share an entr\\u00e9e, an appetizer, and a dessert if you want.\n\ndishes that we ordered:\n<mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (eh, wouldn't recommend it; it has a little spicyness to it though); <mark>B.b.q. Chicken</mark> pizza (this thin crust pizza was pretty flavorful); pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark> (not bad, but not great); pasta carbonara (flavor was good, but it just wasn't creamy enough and felt a little bit dry); artichoke dip (was a little bit dried/overcooked - a part of it was actually burnt; wasn't creamy enough also).", 
            "like almost all of the other reviewers said, this place definitely is a sibling of cheesecake factory. you can tell by its decor as well as the menu (there were a lot of dishes that were the same from cheesecake factory). \n\nservice: once i walked in, there was a nice ambiance around me, and we were seated immediately. our waiter was very helpful and made sure we were comfortable with our food and kept checking up on us every so often.\n\nfood: for appetizers, i ordered the spinach dip -- pretty good. i ordered the pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark>, hoping that since this restaurant is from cheesecake factory, it would taste the same as the dish i usually order at cf. i was somewhat wrong. the cream sauce grand lux uses for that dish has a rather distinct/weird taste, and i didn't like it enough to finish the plate.\n\ni definitely would come here again to try the other dishes. the pricing is pretty decent too. also, i hear it's open late (although the grand lux at the venetian opens 24 hrs), so that's definitely a plus for people who are dancing the night away and get a little rumble in their stomach. (=", 
            "where do i begin... i've been to grand lux so many times in my 8 years in vegas. i prefer the newer palazzo location to the venetian mainly because of convenience. parking and walking from the venetian is such a hassle, while if you know where to park at palazzo it'll take you up right by grand lux. \nthe restaurant is appropriately named - the decor is both grand and lux especially for what is basically a casino coffee shop. high open ceilings with lots of mirrors and other shinies, comfy seats and always very clean w great service every time. \ni don't think i've ever had anything i didn't like, but i usually stick to my favs. its hard for me to resist my sunday night pasta - its spaghetti with a meat sauce made up of a lot of different things. meant to be like a dish where you throw all of the week's leftovers together (but made fresh) its packed with short ribs, hamburger, <mark>Sausage, Pepperoni And Mushrooms</mark> and i'm sure other things i forgot about. the portion's huge, easily 2 maybe 3 meals especially if you fill up on their warm crusty bread and butter. i'm embarrassed to admit that our basket always needs a refill :)\nother things worth mentioning - duck pot stickers, shrimp w pasta, short rib grilled cheese, their burger w short ribs on top. we're usually too stuffed to get dessert but i finally remembered this time to plan ahead and order the warm rustic apple pie. it's baked to order so takes 20 minutes, i'd suggest putting it in with your dinner order. even if you forget to order ahead of time, it's well worth the wait. as you can see in the picture its really more of an apple tart. warm flaky pastry crust, sweet but slightly tart apple slices, topped with vanilla ice cream and finished with powdered sugar. i'd go back just for that pie. \ngive grand lux a try if you've never been. their massive menu is guaranteed to have something that everyone will like.", 
            "pros:\n\n1. fast and quality service. we were seated immediately, and our waiter was freaking awesome. he was attentive, friendly and even packed up all our food when we decided we wanted to finish it in our room in our pjs. the sunday night pasta wasn't on the late night menu, but when he realized how much my friend had been looking forward to it, he asked the chef to make it. that's great service. \n\n2. food. i ordered the sunday night pasta to share with a friend. short rib meat with a delish marina <mark>Sausage, Pepperoni And Mushrooms</mark>. pasta was perfect and short rib meat was phenomenal.", 
            "the day before christmas 2013, @ the palazzo in las vegas.\n\nback at the grand  lux cafe for lunch before driving home.  ordered the lunch size, chicken pot pie.  this is one of my all time favorite items.\n\nthe service was good, with the waiter bringing us bread without us having to remind him.  the bread was warm, with a crunchy crust but soft and fluffy inside.\n\nas always the food is very tasty and quite filling. even the lunch size chicken pot pie. the crust was flaky, the filling had large chunks of chicken, peas, carrots, potatoes, <mark>Sausage, Pepperoni And Mushrooms</mark>.\n\nwill have too spend some time in the casino to digest before the drive home.\n\n5 stars.", 
            "so i remember going to this place a long time ago and thought it was only okay, but my friend convinced me that it was yummy and that i should return.\n\nthis location had no wait on a sunday afternoon and we were seated right away in the corner of the restaurant. although we were tucked away in the back corner, the server did not forget about us and attended to us immediately. warning: portions are big! the three of us ordered three appetizers and three entrees... lets just say we were extremely full and food coma-ing for awhile.. \n\nappetizers:\nasian nachos- who even thinks of this stuff! crispy wonton chips with chicken, wasabi cream, cheese, and sweet hot peanut sauce with fried rice in the middle. i don't know if these were made for asians or something but damn were these good! the slight hint of wasabi cream really added to the nachos, and adding the fried rice on top of the chip was super asian and delicious.\n\nbrie wonton with creamy brie cheese, fresh pineapple, and caramelized onion marmalade- this was okay, i expected better. i didn't taste the pineapple in the wonton, and they left the rind on the brie so the taste was kind of bitter. sauce was good.\n\ncrispy pepperoni mini pizza- they added parmesan slices on top which really added to the pizza in terms of texture and and flavor. other than that, regular pepperoni pizza.\n\nentrees:\nlunch special salad and pasta carbonara- the pasta was bomb. yeah you can make pasta at home but the bacon bits, chicken and cheese was super flavorful and tasty. the noodles were also cooked well. \n\nhousemade pierogies- pierogies are basically potato dumplings which they made by hand, and they added roasted short rib with mushrooms and onions. yum. yeah pierogies are plain and heavy and basic, but it's good comfort food and perfect after a long night. \n\navocado chipotle cheeseburger- this thing was giant. i asked for medium rare <mark>Sausage, Pepperoni And Mushrooms</mark> instead of peppers, and it was a giant stacked burger. the cheese was melted all over the place (perfectly) and the meat was cooked the way i wanted it. the avocados were chopped (i expected it to be in slices) and it kept falling all over the place. really messy dish, but good burger and good fries. \n\noverall this restaurant is perfect as a heavy lunch or dinner. definitely exceeded my expectations from what i had last time (which i don't really remember). total came out to be $71, which is pretty fair as we did order a lot of food.. would definitely come if staying at palazzo or venetian after a long night.", 
            "this place is on the pricey end but my friends and i wanted to eat on the strip on a sunday morning.  the dishes are pretty big and heavy on calories.  \n\nwhat we ordered:\n1) pasta with chicken, sun-dried tomato <mark>Sausage, Pepperoni And Mushrooms</mark> (tossed with sun-dried tomato, fresh mushrooms, garlic, cream and parmesan cheese)\n\n2) spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> (grilled chicken breast topped with avocado, pepper-jack cheese, corn, lettuce, tomato and black bean-mayo on our grilled flatbread)\n\n3) thai fried chicken (crispy breast of chicken in a spicy thai b.b.q. sauce. served over steamed white rice and sauteed vegetables)\n\nall the dishes were pretty good.  we were happy with our orders and the fact that this place carried sriracha; i guess it's becoming more popular.\n\nour waitress was nice.  she did everything that was expected.  only thing she had forgotten was the bread.  she never would have brought it out if we didn't ask for it."
        ], 
        "dish_name": "Sausage, Pepperoni And Mushrooms"
    }, 
    {
        "text": [
            "take away:  great variety of food at reasonable prices; looks and feels like it's sibling, the cheesecake factory.\n\nrecommendations:  the <mark>B.b.q. Chicken</mark> pizza is pretty good, but it really just depends on what you're in the mood for.\n\ndetails:\n\natmosphere:\nit has the familiar cheesecake factory d\\u00e9cor.  it's not a fancy restaurant, but for what you pay, it feels like you're going to a pretty nice looking restaurant.  ambience is pretty relaxed and can be great for couples and a small family gathering.  the tables, linen, and dishes were all clean as well.\n\nservice:\nfor the several times i've been here, the service has been pretty good.  the servers have generally been pretty quick and checked in from time to time.  it does, however, feel as if they are slightly understaffed.  a few times, we needed service but couldn't find our server for over 5 minutes.  during my last visit, we had a party of 8 and our server handled our order fairly expeditiously.  she was very friendly as well.  the wait for a party of 8 was about 15 minutes, while the smaller parties (2-5) got their tables immediately (just an fyi).\n\nfood quality / selection:\nhuge variety of food from pastas to sandwiches.  take a look at their menu here: http://www.grandluxcafe.com/menu.htm.  the presentation is above average.  the look and feel of the plates is similar to most other full service restaurants (especially the chain ones).  the food is above average for the most part (see details below).\n\npricing/value/convenience:\ngreat value; above-average portions.  this place is a great place to share an entr\\u00e9e, an appetizer, and a dessert if you want.\n\ndishes that we ordered:\n<mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (eh, wouldn't recommend it; it has a little spicyness to it though); <mark>B.b.q. Chicken</mark> pizza (this thin crust pizza was pretty flavorful); pasta with chicken, sun-dried tomatoes, <mark>Sausage, Pepperoni And Mushrooms</mark> (not bad, but not great); pasta carbonara (flavor was good, but it just wasn't creamy enough and felt a little bit dry); artichoke dip (was a little bit dried/overcooked - a part of it was actually burnt; wasn't creamy enough also).", 
            "i haven't been to grand lux caf\\u00e9 before, and since i like going to the cheesecake factory when i'm in seattle, i thought i'd drop in here for dinner on saturday night around 6pm. the wait was only about 5 minutes to be seated and we were greeted right away and asked what we would like to drink and if we would like to order any appetizers. i ordered the edamame which were delicious. the edamame here are cooked in a sauce, not just steamed and sprinkled with sea salt. they were different, but really good. for dinner i had the <mark>B.b.q. Chicken</mark> which was cooked perfectly. my friend had the fish and chips which she said she liked as well. the food is of course very similar to the food at cheesecake factory, but i would definitely come back again.", 
            "food was decent, i had the <mark>B.b.q. Chicken</mark> pizza <mark>Chili-lime Chicken And Mango Salad</mark> for their lunch special. everything i expected.\n\nservice was seriously lacking though. for some reason, one which i assume to be descrimitory in nature, we were the only table not given any bread. our food also took twice as long. our appetizer didn't even come out by the time the table next to us got all their food. we arrived about the same time as them.", 
            "i always go to this grand lux at the palazzo because i work here, usually here during my lunch breaks, or if i need a quick bite to eat. \n\nthe reason i'm writing a review on them is because my most recent visit was not so pleasant. i usually sit at the bar because it's fast and convenient for me, i'm usually in and i'm out within 40 minutes. this time around wasn't the case. although their food is amazing, always so filling, their customer service was not all that great today. maybe our server christopher (filipino, with glasses) is new that's why he wasn't so attentive, but regardless, you're working at a casino on the strip.\n\nanyways, as soon as we ordered i let him know we work at the casino and he asked for our id cards. which is weird because they never really ask us, because we have our casino badges on. \n\ngot our food, we ordered the lunch special of a small pizza and a side of salad. mine was perfect, i had the <mark>B.b.q. Chicken</mark> pizza and my coworker ordered the margarita pizza, which was a little burnt. oh well, it happens. \n\nsoon as we got the check, we left. i normally like going when my regular server john is working. he's always so helpful and even suggests new things on the menu. i hope christopher improves his services, that way it won't matter which server i get."
        ], 
        "dish_name": "B.b.q. Chicken"
    }, 
    {
        "text": [], 
        "dish_name": "Santa Barbara Chicken Sandwich"
    }, 
    {
        "text": [], 
        "dish_name": "Spicy Buffalo Chicken Sandwich"
    }, 
    {
        "text": [
            "one of my favorite restaurants in las vegas. while it is a chain, it is quite good. the food was excellent. breakfast (a great omelet), lunch (soup <mark>Roast Turkey And Brie Sandwich</mark> combo), dinner (asian noodles), and late night  (one of the best hamburgers ever). the service is also very good. be warned that the portions are giant, but this adds to the economy of the place: if you share, it's even cheaper. desserts are also excellent.", 
            "it's nice to have a restaurant like this in your hotel, which is close enough to drop by anytime, but not too expensive to poach your already near-empty wallet. they have all different types of food to satisfy your tastes and the portions are large enough to keep you full for most of the day. we came here for sunday lunch and the staff here were quick to accommodate a large hungry party. the waitress was very nice and even made sure to bring out my friend's order first because she wasn't feeling very well. a few downers included items that weren't available because they ran out by mid-day, which is pretty inexcusable. the nice thing is that lunch prices are very cheap compared to dinner. a lot of people opted to get the salad, soup, <mark>Roast Turkey And Brie Sandwich</mark> combo, which gets you a lot for cheap. i got the chicken jambalaya, expecting pasta, but got white rice instead. it was still good, but tasted more asian than anything else despite the spiciness.  i had my eyes set of some beignets that i saw go to another table, but like i said, the portions are enough to keep you full so i passed when it came time for dessert.", 
            "okay my review is a little biased because of the awful service we received. first let me say i have been to grand lux in houston several times, the food is delicious, low prices and the portions are huge. it was also highly convenient, open 24 hrs and in my hotel the venetian right next to the casino tables, whats there not to love right...the service it was awful during the day, we waited over an hr for a <mark>Roast Turkey And Brie Sandwich</mark>, no apologies from the manager it was like this was a normal thing i am very dissapointed at this level of service....i will only order to go next time.", 
            "update: i did go back and had the sandwich again! it is just fabulous! food and service was awesome again.  also tried the <mark>Key Lime Pie</mark>, which was delicious.  great cafe.  \n\nmust try the <mark>Roast Turkey And Brie Sandwich</mark>! fabulous! also had mashed potatoes and mac & cheese. i know carb heaven. food was delicious and the service was outstanding! would definitely come back.", 
            "this is a nice place to come for a meal.  i gave it four stars because it still feels like a big, well executed chain, like cheesecake factory (its owners), and the menu is so big that there are apparently several very average things you can order.  i was able to order well by reading previous reviews, so here are the menu items i experienced (below).  it is big, opulent, and modern, with mildly attentive service.\n\nasian nachos: 5 stars, my favorite part of the meal.  peanut ginger glaze, fried wontons, wasabi cream and mozzarella.  full of delicious flavor, we nearly licked the plate.\n\nshort rib grilled cheese: 4 stars, moist meat with horseradish cream sauce.  the bread was toasted pretty crispy, the cheese was good.  included was a house salad; the blue cheese dressing i ordered was good.\n\n<mark>Roast Turkey And Brie Sandwich</mark>: 3 stars, my friend got it and the thick baguette it was served on was too thick and too toasted, making it hard to bite into.", 
            "i was pretty satisfied with the food. i got the <mark>Roast Turkey And Brie Sandwich</mark>--bread was nice and crispy, and loved the mix of turkey, cranberry, brie, and arugula. they could've skimped less on the brie though.... love me some cheese... the fries were ok. they had good flavor but were on the soggy side. filling meal, good flavors, b+ overall.", 
            "i was relieved to have a simple yet good place to eat on the strip. the menu was decently priced. \n\ni ordered the <mark>Roast Turkey And Brie Sandwich</mark> with apples. it was a satisfying sandwich. i loved their made to order desert options, which you order at the same time as the entree so that they have enough time to prepare it. we ordered a dozen chocolate chip pecan cookies, ate 2 each, and saved the rest for our flight home :)", 
            "the food here is amazing. impeccably amazing. the first time i had cerviche was here and i love it. it's the best appetizer i've had in such a long time. the pasta <mark>Roast Turkey And Brie Sandwich</mark> are so good here. the staff is super friendly. the only exception is the host or maybe she was just having a bad day. i don't know. she had a bit of an attitude but the good outweighs that.", 
            "there used to be a grand lux in beverly hills but they closed down so i have to hit up the ones vegas to get my fix. my family and i were wandering around looking for a place to eat when we came upon the grand lux.  they are a sister restaurant to the cheesecake factory so you know the menu is extensive. \n\nafter the old folks poured over the menu we all decided on something. we ordered a variety of items including soups, salads <mark>Roast Turkey And Brie Sandwich</mark>. i ordered their quesadilla which was excellent and a cucumber lemonade which was over the top delicious.  everyone enjoyed their food and we ordered beignets for dessert...which in my opinion is reason enough to come here. they were absolutely delicious and came with three dipping sauces.  \n\nthe service was good and i would definitely come back again."
        ], 
        "dish_name": "Roast Turkey And Brie Sandwich"
    }, 
    {
        "text": [
            "newer than the first, better than the first?  well it was definitely good and a great spot with the full on glamour and all located right in the new spankin new palazzo resort casino and hotel.  \n\ni had two meals there while staying at the palazzo because something as simple as their burgers/sandwiches were amazingly good.  it's a little on the pricey side, but you get what you pay for.  \n\n-regular burger with 3 toppings ($14) - they cooked it medium rare just the way i had asked, and the burger was insanely big.  it came with fries and everyhing which made it hard to even finish such a giant burger.  i had asked for cheese, avocado, and mushroom...now how can that not be an amazing burger just already.\n\n-short rib sandwich ($16?) - there's a reason why there were two of us ordered the same exact thing.  it looked damn good on the menu and we didn't want to share.  and just as suspected, it was great.  greasy, yes, but the toasty <mark>Spicy Flat Bread Chicken Sandwich</mark> short rib meat was phenomenal.  \n\n-knowing this type of food exists around the strip, i'm glad to say i'll be looking forward to staying somewhere nearby next time i'm in vegas too.  btw, no to imperial palace", 
            "two weekends ago, we went to las vegas for jc's birthday. for the record, best birthday celebration ever!! we stayed at the palazzo, so, partly out of convenience, partly out of curiosity, we did dinner at grand lux one night. jp got the jamaican pork tenderloin, my memory tells me jc got the reuben but i can't find it on the menu, not quite remembering what jl got, kl had the asian nachos, bt went for the chicken pot pie, and i had the madeira chicken. i only got around to trying jp's and bt's dishes in addition to mine. the jamaican pork was really good. it comes with rice, mashed sweet potatoes, and mango salsa. hearty. if there's one criticism, maybe it was a bit salty. the chicken pot pie was the biggest. pot. pie. ever. the area of the crust was as big as both my hands together. ok, so i have midget hands. but still! creamy. delish. my madeira chicken served with mashed potatoes and asparagus was perfect. i'm always a fan of any creamy wine sauce. mashed potatoes equals comfort. asparagus equals love. it's nothing super fancy, just exactly what my taste buds were asking for.\n\nfast forward to one day later. we had been up till 9am playing blackjack and were running on no sleep. slightly dejected after losing a fair amount of money, but mostly needing showers, we went back up to our room to shower and get ready for checkout, then jp, jc, jc2, bt, tc, and i had our last lunch at grand lux. not remembering what everyone had this time. i'll venture to say the delux drive-in burger, grand club, and the <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> were among the choices. definitely not remembering what jp got. she was too preoccupied with getting back to the blackjack tables. so jp is huddled in the corner struggling to stay awake, conflicted between her desire to take a nap and her significantly more urgent need to get back to the tables. i ordered the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>, which was excellent. a <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> with lettuce and tomato, kicked up with pepper jack and avocado-corn salsa. i want to say it was one giant sandwich cut into quarters, but it was really four still-giant sandwiches. before i got to my second sandwich, jp had already finished whatever she ordered, threw her credit card down on the table for us to pay with, and ran back to the casino. by herself. addict.\n\nin the past, i've also had the crispy thai shrimp & chicken <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, lemon chicken piccata, and <mark>Banana Cream Pie</mark>, all of which i would recommend. i've always had great service, the atmosphere is great, and it's just the kind of place you want to be. comfortable and consistent. unfortunately there aren't as many pictures as usual, as i was too preoccupied with my meal companion or we were too concerned with getting back to the blackjack tables, but there are a few that will hopefully suffice. in summary, it's simple, nothing absolutely crazy gourmet, but definitely hits the spot and more than satisfactory. huge portions and so good! yummers!!!!", 
            "first off let me say that i had a to-go order. the 3 stars may be a little on the harsh side for their overall service since i've never experienced the regular dining areas.\n\ni had two simple orders. 1 <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> (bun), 1 <mark>Spicy Flat Bread Chicken Sandwich</mark>. both orders came with fries. as i was told the wait would be 20 minutes, i ventured back out into the casino and signed up for palazzo's players card. i came back in 15 minutes on the dot to ensure i'd be receiving my food nice and hot (or so i thought). \n\nmy <mark>Spicy Flat Bread Chicken Sandwich</mark> was pretty good. it had nice flavor and a generous size. i was told the other sandwich was good, however the fries for both were not only cold, but chewy and dry. whether they typically don't take much consideration for take out orders, or because their organization in the kitchen needs work: i'm not certain because i've only eaten here this one time. for such a basic order, i can't see myself rating them any higher. i might eat there again one day because of convenience, but if that experience doesn't turn out better, you can bet this place will never get my money again. plenty of other options in vegas.", 
            "it's the retarded half brother of the cheesecake factory.\n\ntons of food options, but i can't believe they don't have regular old standard nachos. asian nachos yes, mexican nachos no. baffling. seriously, i don't get it. the person who created the menu was like... hey, let's put everything in the world you can think of on this bar food menu except for nachos! that will be a great trick, we'll show those fatass americans!\n\nbut enough about the asshole who thought it was a good idea to make nachos with an asian flair, because it wasn't, and that guy is just a douchecanoe.\n\nthe only thing i get here is the flatbread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> with no cheese. i had it the first time i went and there were no major post-dinner disasters. i'm afraid that if i eat anything else, the disaster in my bathroom will make the bp oil spill seem like a leaky faucet. \n\nbig plus for sam adams on draft, but not because that's rare, only because it's my favorite. 3 stars for being completely normal, the menu has enough options to please every single person that walks through the restaurant door.", 
            "whenever i'm in vegas, i live here. if you ever lose me i'm probably at the grand lux eating their <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> or ordering a box of their delicious chocolate chip cookies. same thing as cheesecake factory, but better. there's something for everyone. one day you can eat a burger, and the next day mongolian bbq. such a great restaurant with amazing service. they just seriously need to fix their slippery floors. i always feel like i'm going to slip and fall.", 
            "how could you not be a fan of grand lux? the menu is a collection of restaurant favorites with a gourmet twist and is basically 10 pages of crazily portioned goodness. \n\nmy friends ordered the mega appetizer platter which was basically 3 different plates filled with gourmet apps. the few i tried were equally delicious. every time i have gone here i always get the buffalo <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> mainly because of its sheer size and deliciousness. if you are looking for an inexpensive meal that is way too big to finish definitely try the <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>.\n\nall in all this place is just a classy establishment with friendly, quick service and delicious food(if you can get through the gigantic menu). if you are staying at the venetian or you just want a semi-inexpensive lunch/dinner that is on par with gourmet food make your way to grand lux.", 
            "have any of you ever had the feeling where you just can't stand another buffet in vegas?  or just simply sick and tired of looking at all the food stations with endless possibilities for a potential food coma? (well i never had that problem but people in my party certainly had that predicament)  so i guess i will just have to follow suit and take in a regular dining facility instead of the glamorous world of buffet heaven.\n\ni've been to a grand lux before so it wasn't anything new to me.   it is the sister restaurant of cheesecake factory's therefore i have no complaints here at all.  just like any cheesecake's you've been to it's got lavish decor, dim lighting, and of course, endless options on their menu.\n\nit's a typical california (cheesecake factory) fare where you can pretty much get anything and everything.. so here are the dishes that our party have ordered!\n\npolynesian salad!  citrusy flavored dressing with a hint of sweetness all rolled into one drizzled upon a pyramid like salad concoction.  the veggie temple was build with a foundation of mixed greens and tiered off by giant wonton crisps!  it's pretty much the sister version of the luau salad at the cheesecake factory... one of the most delicious salads for a nice sit down restaurant!\n\ngrand cobb salad:  it's grand but actually not as large portioned as the polynesian salad.  it's got all your typical culprits in a cobb (avocado, bacon, turkey, egg whites, etc..) all dressed in bleu cheese!  (i thought it was ranch..  yuck!  i hate blue cheese!!!  however, when i actually gave it a try, the dressing as actually tasty and bearable!  (i simply cannot handle bleu cheese) so that's actually tasty as well!\n\nmadeira chicken:  didn't get to try this out but according to our friends, it was tasty!  (i'm not a big chicken breast dish kind of guy so i never order these things)  i'll just take their word for it!\n\nspicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>:  same as above as i didn't get to try the sammy, but it was gone from my buddy's plate so that's a good sign!  gotta try that next time!\n\nslow roasted short ribs of beef:  great bbq flavor!  it's your typical bbq flavor dish but definitely tasty!  (with bbq you really cannot go wrong unless you overcook it which will make it super dry and gross)  but it was nicely flavored, juicy, and delicious overall!  (huge portion too! as it was served with veggies and mash potato!)\n\nfried calamari:  highlight alert!  this is one of the best calamari that i've ever had in many different places!  they fried their calamari along with veggies and rock shrimp to create the most heavenly dish (one of my all time favorites!) served with ranch and spicy aioli dressing!  i'm telling you, if you were to pick one dish to get at grand lux, this one is highly highly recommended!  oh... did i mention the portion for this is huge?  well you bet it is!  totally worth every penny!\n\nlastly, service was awesome as it comes to expected being affiliated with cheesecake factory.  they brought out wrong salad dressing for me and when i asked for it, 2 different wait staff came out with the dressing!  (now i got 3!)  great attention to customer's needs is definitely a plus!\n\nso there you have it, grand lux cafe, opens 24 hrs, in venetian or palazzo, and will serve your morning, noon, dinner, or late night dining needs in case you are totally turned off by the buffets of  vegas!  a terrific alternative yet decently priced!", 
            "i've been here more times than i can count, and i also like to get take out. the portions are huge. some of the yummy highlights: mongolian steak, <mark>Spicy Flat Bread Chicken Sandwich</mark>, shrimp scampi, and the beignets. not a huge fan of the shaking beef (i don't like cilantro) or the chicken pot pie (looks better than it tastes - too watery). service can be a little slow, as it is usually pretty busy.", 
            "3 1/2 \ni went here for lunch and breakfast.  the prices are very reasonable for las vegas.  it is owned by cheesecake factory so very similar.  food took awhile to come out.\n\ni was disappointed with the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>.  it was boring.  however, everyone i was with seemed to be happy with their lunch food. breakfast was quite impressive menu.   people that like mexican style breakfast would enjoy the chilaquiles (eggs scrambled with tortilla chips, red and yellow peppers, chiles, onion and tomato covered with ranchero sauce, corn, black beans, avocado, cilantro and pepper-jack cheese).", 
            "one of my favorite places to go to when visiting las vegas. i like going here late night for a great burger or the buffalo <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> which is a delight. the service has always been good and the taste is good too. they are open 24/7 so you can enjoy them anytime... the breakfast buffet is nothing special so you are better off just ordering an item from the menu in my opinion", 
            "i'm a little torn about this place now. had i reviewed it a couple years ago, it would have been all positive, however, so much has changed. i've been dining at grand lux cafe consistently since they opened until a couple years ago (i had previously frequented the venetian location). granted, i didn't frequent as often in the last 2-3 years since las vegas' local restaurant scene has stepped up and i found new, better spots to obsess. but, it was my visit in september 2013 that turned me away. the quality has diminished significantly and dishes that were once favorites, are now very disappointing! also, food portions have gotten smaller and prices have remained the same (or increased). where's the money going?\n\none of my favorite sections of their menu is the gr<mark>Chili-lime Chicken And Mango Salad</mark>. large portions for around $13-17. my favorites are the southwestern salad and the manhattan salad. they've changed the manhattan salad a bit since i first had it a few years ago, but it's still good. i like the fresh beets and the large assortment of fresh vegetables and legumes; plus, the house vinaigrette is great. the last time i had this salad, however, it was oddly not chopped. maybe someone got lazy that day? i'd hate to think that it's just served like that now. view photos below:\n\nexhibit a: manhattan salad in august 2014 (what a chopped salad should look like). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=n_rprbjxzdz2hnz-25bkfg#n_rprbjxzdz2hnz-25bkfg\n\nexhibit b: manhattan salad in october 2014 (this is what i was served just two months later). http://www.yelp.com/biz_photos/grand-lux-cafe-las-vegas-5?select=acnz4-xjihtb6koh7ktcma#acnz4-xjihtb6koh7ktcma\n\ni haven't tried a lot of their newer small salads, but they used to serve a really nice <mark>Spicy Calamari Salad</mark>. delicious and crispy calamari and fresh greens with these two wonderful sauces/dressing. it's a shame that it's no longer on the menu. \n\nother dishes that i've enjoyed: empanadas, buffalo chicken bites, <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, crispy thai shrimp & <mark>Buffalo <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, pasta pomodoro, cajun shrimp & chicken jambalaya, and indochine shrimp & chicken.\n\noh, their new orleans beignets are fantastic! they're made to order, so you'll need to order in the beginning of your meal. they have a great batter and i love the sauces: jack daniels creme anglaise, raspberry, and chocolate. the creme anglaise is magic and i love mixing it with the tart raspberry sauce. it's divine.\n\ntheir burgers are good (or at least they were good the last time i had them). thick, juicy angus burgers that are cooked to order (medium rare, yay!). i've also enjoyed their sandwiches. my go-to sandwich used to be the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>. i ordered this staple again during my visit in december and it was terrible. i just don't understand what's going on! i've had this sandwich multiple times and there have never been any issues. the sandwich was messily assembled and there was no flavor. i think they may changed the mayo (website shows black bean mayo?) because i'm pretty sure it used to have a spicy element that gave it zing. they should probably rename the sandwich and take out the word 'spicy' because now the only \"spicy\" ingredient is the pepper jack cheese.\n\nmore disappointment: their fries used to be so great and now they're horrible! also, i recently tried another one of my go-to favorites, chicken pot pie, and it has strayed so far from what it used to be. such a shame.\n\ni just had the kale and avocado salad (fresh kale, avocado, spicy roasted poblano chiles, black beans, feta cheese, onions, toasted pumpkin seeds, and citrus vinaigrette) on my most recent visit last month and it was fantastic! i couldn't believe how great it was after so many disappointments recently. it has restored a little faith.\n\ni doubt i'll attempt any of my old favorites again in fear of more disappointment, but i do still like glc's salad selection. i'm just hoping the next time i order a manhattan salad, that it is indeed chopped.", 
            "i heard this was a sister store to the cheesecake factory so i decided to give it a try . the menu was quite extensive and affordable . we got the lunch sandwich special that comes with soup and a salad and the <mark>Spicy Flat Bread Chicken Sandwich</mark>. i would visit again.", 
            "this place is on the pricey end but my friends and i wanted to eat on the strip on a sunday morning.  the dishes are pretty big and heavy on calories.  \n\nwhat we ordered:\n1) pasta with chicken, sun-dried tomato <mark>Sausage, Pepperoni And Mushrooms</mark> (tossed with sun-dried tomato, fresh mushrooms, garlic, cream and parmesan cheese)\n\n2) spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> (grilled chicken breast topped with avocado, pepper-jack cheese, corn, lettuce, tomato and black bean-mayo on our grilled flatbread)\n\n3) thai fried chicken (crispy breast of chicken in a spicy thai b.b.q. sauce. served over steamed white rice and sauteed vegetables)\n\nall the dishes were pretty good.  we were happy with our orders and the fact that this place carried sriracha; i guess it's becoming more popular.\n\nour waitress was nice.  she did everything that was expected.  only thing she had forgotten was the bread.  she never would have brought it out if we didn't ask for it.", 
            "came here 10 minutes prior to closing. orders an <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> and <mark>Greek Salad</mark>. both were great! fairly priced, liked it so much that we decided on it for breakfast before heading out. i opted for a belgian waffle with strawberries was so good sweet crunch and just a great waffle!"
        ], 
        "dish_name": "Spicy Flat Bread Chicken Sandwich"
    }, 
    {
        "text": [
            "went to the grand lux cafe while at the palazzo. it's owned by the cheesecake factory - so the decor and menu are similar. \n\nordered the <mark>Grand Club Sandwich</mark> - it was good. fries were good too. but our waiter was slow and forgetful. he couldn't keep our drinks full, and we asked the dude for bread at least four times.\n\nwas a cool spot for lunch, food was a four, service a 2.5. overall grade - 3.5 stars.", 
            "i seriously hate chain restaurants. i hate cheesecake factory the most. i knew this was an affiliate...but my friend (who is a very picky/simple eater) wouldn't go with us to any restuarant unless he recognized the name--note to self: don't let plain/picky eaters choose the restaurant... i knew it was going to be bad but i endulged him. yuck! i couldn't finish a quarter of what i ordered. \n\nmy friend (the plain eater)ordered a <mark>Grand Club Sandwich</mark> and fries. \nmy other friend (she shares my sentiments) ordered the steak with sweet potatoes. \ni ordered the chicken and waffles (per a fellow yelper's recommendation and the fact that i thought this is an easy meal to make). \n\nmy friend's $34 steak was so gross. dry, fatty and tough. \nmy chicken was breaded chicken tenders. i had one. gross. the waffle was average and served with sprinkled pecans but something i feel could have been cooked up at ihop. \n\nmy other friend thought it was great. he also only eats at fast food restuarants and american food only.\n\nthe only upside: our cute waiter rudy morales. really nice. he was an mma fighter and talked about his training, etc. cool guy.", 
            "grand lux cafe...what a great spot to grab lunch when you are in vegas and happen to be gambling at the palazzo.  i love their <mark>Grand Club Sandwich</mark>.  yum-o!  i get the same thing every time i go.  we just went recently with a group of friends and everyone enjoyed their meal.  i'll be sure to try another dish on our next visit.  i'm sure there are other great dishes here. \n\ni ordered their double chocolate cake for dessert and it was just eh, nothing special.  i'd pass on this next time.  it's nothing compared to cheesecake factory's linda's fudge cake.\n\nit helped that we had a very nice waiter named marcus.  he was super attentive, that's always a plus!  til next time, grand lux!", 
            "you cannot stay in palazzo or venetian without going to this place!\ni'd give this 4.5 stars if i could.\nthe workers are just fantastic, i've been here a couple of times and no matter what time i go, they're always nice and helpful.\ni've had the avocado-chipotle cheeseburger, <mark>Grand Club Sandwich</mark>, filet mignon, and chicken fettuccine alfredo... all of them we're delicious! i also like their breakfast buffet although i prefer wynn's breakfast buffet.\nbut the real reason why i love this place is because of two things:\ncookies and beignets\nholy mother of flavor explosion in your mouth!\nget these desserts. i don't care if i'm on a diet, i will get these desserts because they are worthy enough to break the rules.\n\noh, and also palazzo is only open til a certain time while venetian's is open 24 hrs! just a little fact that could save you time if you're near the areas."
        ], 
        "dish_name": "Grand Club Sandwich"
    }, 
    {
        "text": [
            "we didn't know what we were getting ourselves into until we saw the menu. yes it looks just like a upper scale cheesecake factory with fancier food on the menu.\n  but then with that low of an expectation we were surprised. the kobe mini hotdog.. pass on that defiantely lost the feel of the kobe beef. the friend chicken was a big ass plate of chicken strips. tasty? yes, meager portions? nah uh there is plenty there.\n  the highlight was the dessert, we avoided the cheesecake to try something different. the <mark>Warm Sticky Bun Bread Pudding</mark> was spectacular warm mushy sweet and chocolately. talking about it now is making me hungry.\n  the service was surprising to me, the server was awesome he let us mess around like we were high school kids. i'm sorry for all the crazy antics we pulled of snorting horseradish and gravy, to the loud outbursts we had. i hope i made it up to you though.", 
            "i love coming here, affordable tasty comfort food in vegas right in the convenient hotel location right on the gambling floor.. and a short walk from tao.. or if you are staying at the hotel, pretty much on your way back to your room from anywhere on the strip you are coming from! :)\n\nsimilar environment/setup as sister restaurant cheesecake factory, always clean, spacious, comfortable seating, air conditioned, etc but casual.  \n\nthe have a pretty eclectic and extensive menu.. idk how anyone makes up their mind.. i'm a vegetarian so it greatly reduces the menu size for me, but there are still a plethora of options. like cheesecake factory there is no signature dish that they do exceptionally well that everyone comes in for, but just a huge variety of items that are all at least fairly good, perfect for a group because there is something for everyone. \n\nsome of my favorite 4am after club snacks:\n \n<mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (i order without the bacon) - definitely something different to put basically baked potato ingredients into a fried spring roll.. but its definitely tasty & the perfect late night comfort food. \n\njalape\\u00f1o-cheese cornbread- take 3 yummy ingredients and add them together? works here :) \n\nmacaroni & cheese skillet - i make it better at home, but this is definitely good for a restaurant (i've ordered macncheese at a lot of places and i think they try to fancy it up or something.. but it usually doesn't work out so well.. this one is a decent late night snack) \n\nedamame - can't really go wrong here, but these ones do have a sauce thats pretty good. \n\nfried pickles - yum \n\nzucchini and onion haystack- never a bad choice. \n\ncrispy sesame tofu - savory but still on the healthier side of things. \n\nwhipped sweet potatoes - sweet n savory\n\n*most importantly (in by book anyway!) the desserts: \n\ngrand lux is a sweet tooth's paradise!  \n\nit's a late night/early morning tradition of ours to get the box of fresh homemade chocolate chip pecan cookies & milk.. soo so warm gooey & good!! perfect comfort food! \n\nmolten chocolate cake, new orleans beignets, <mark>Peach Cobbler</mark>, butterscotch caramel pudding, pineapple upside-down cake, apple pie, <mark>Fresh Strawberry Shortcake</mark>,  cr\\u00e9me brulee duo, <mark>Warm Sticky Bun Bread Pudding</mark>,  cupcakes, banana vanilla wafer pudding, key lime, red velvet, carrot cake.. all sooo good! \n\nwith a list like that i have no idea how anyone chooses! \n\nthey have two of my favorite cheesecake factory cheesecakes:\ndulce de leche caramel \nwhite chocolate raspberry truffle\n\nmmm... \n\ni haven't tried the \"cupcake collision,\" sounds pretty fun: \"rich chocolate cupcakes collide with vanilla ice cream, hot fudge and whipped cream.\"", 
            "came here for a late night snack after a cirque du soleil show. our server, gina, was a great and personable hostess. she even gave us traveling advice on the quickest way to get back to our hotel. the food was great, especially the <mark>Warm Sticky Bun Bread Pudding</mark> and white chocolate macadamia cheesecke.", 
            "ever since my friend and i tried this place years ago we made it a tradition to eat here each time we're in vegas.\n\neverything here is really delicious. there is no substitute for flavor.\n\nmy friend and i always order the pasta telefono.  we just love it so much, and i never like ordering pastas at restaurant because in my opinion, they're always mediocre. i gave their pasta a try just because my friend wanted to split it with me, and to my surprise it was delicious!  i don't know if it's the pasta itself, or the sauce on it, it's just delicious! and if you save it for later to eat, it just gets even better because the pasta absorbs all the sauce lol.  i really like it a lot. love their <mark>Warm Sticky Bun Bread Pudding</mark> as well, it's a must! very dreamy!"
        ], 
        "dish_name": "Warm Sticky Bun Bread Pudding"
    }, 
    {
        "text": [
            "i love coming here, affordable tasty comfort food in vegas right in the convenient hotel location right on the gambling floor.. and a short walk from tao.. or if you are staying at the hotel, pretty much on your way back to your room from anywhere on the strip you are coming from! :)\n\nsimilar environment/setup as sister restaurant cheesecake factory, always clean, spacious, comfortable seating, air conditioned, etc but casual.  \n\nthe have a pretty eclectic and extensive menu.. idk how anyone makes up their mind.. i'm a vegetarian so it greatly reduces the menu size for me, but there are still a plethora of options. like cheesecake factory there is no signature dish that they do exceptionally well that everyone comes in for, but just a huge variety of items that are all at least fairly good, perfect for a group because there is something for everyone. \n\nsome of my favorite 4am after club snacks:\n \n<mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (i order without the bacon) - definitely something different to put basically baked potato ingredients into a fried spring roll.. but its definitely tasty & the perfect late night comfort food. \n\njalape\\u00f1o-cheese cornbread- take 3 yummy ingredients and add them together? works here :) \n\nmacaroni & cheese skillet - i make it better at home, but this is definitely good for a restaurant (i've ordered macncheese at a lot of places and i think they try to fancy it up or something.. but it usually doesn't work out so well.. this one is a decent late night snack) \n\nedamame - can't really go wrong here, but these ones do have a sauce thats pretty good. \n\nfried pickles - yum \n\nzucchini and onion haystack- never a bad choice. \n\ncrispy sesame tofu - savory but still on the healthier side of things. \n\nwhipped sweet potatoes - sweet n savory\n\n*most importantly (in by book anyway!) the desserts: \n\ngrand lux is a sweet tooth's paradise!  \n\nit's a late night/early morning tradition of ours to get the box of fresh homemade chocolate chip pecan cookies & milk.. soo so warm gooey & good!! perfect comfort food! \n\nmolten chocolate cake, new orleans beignets, <mark>Peach Cobbler</mark>, butterscotch caramel pudding, pineapple upside-down cake, apple pie, <mark>Fresh Strawberry Shortcake</mark>,  cr\\u00e9me brulee duo, <mark>Warm Sticky Bun Bread Pudding</mark>,  cupcakes, banana vanilla wafer pudding, key lime, red velvet, carrot cake.. all sooo good! \n\nwith a list like that i have no idea how anyone chooses! \n\nthey have two of my favorite cheesecake factory cheesecakes:\ndulce de leche caramel \nwhite chocolate raspberry truffle\n\nmmm... \n\ni haven't tried the \"cupcake collision,\" sounds pretty fun: \"rich chocolate cupcakes collide with vanilla ice cream, hot fudge and whipped cream.\""
        ], 
        "dish_name": "Fresh Strawberry Shortcake"
    }, 
    {
        "text": [
            "two weekends ago, we went to las vegas for jc's birthday. for the record, best birthday celebration ever!! we stayed at the palazzo, so, partly out of convenience, partly out of curiosity, we did dinner at grand lux one night. jp got the jamaican pork tenderloin, my memory tells me jc got the reuben but i can't find it on the menu, not quite remembering what jl got, kl had the asian nachos, bt went for the chicken pot pie, and i had the madeira chicken. i only got around to trying jp's and bt's dishes in addition to mine. the jamaican pork was really good. it comes with rice, mashed sweet potatoes, and mango salsa. hearty. if there's one criticism, maybe it was a bit salty. the chicken pot pie was the biggest. pot. pie. ever. the area of the crust was as big as both my hands together. ok, so i have midget hands. but still! creamy. delish. my madeira chicken served with mashed potatoes and asparagus was perfect. i'm always a fan of any creamy wine sauce. mashed potatoes equals comfort. asparagus equals love. it's nothing super fancy, just exactly what my taste buds were asking for.\n\nfast forward to one day later. we had been up till 9am playing blackjack and were running on no sleep. slightly dejected after losing a fair amount of money, but mostly needing showers, we went back up to our room to shower and get ready for checkout, then jp, jc, jc2, bt, tc, and i had our last lunch at grand lux. not remembering what everyone had this time. i'll venture to say the delux drive-in burger, grand club, and the <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> were among the choices. definitely not remembering what jp got. she was too preoccupied with getting back to the blackjack tables. so jp is huddled in the corner struggling to stay awake, conflicted between her desire to take a nap and her significantly more urgent need to get back to the tables. i ordered the spicy flat bread <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark>, which was excellent. a <mark>Santa Barbara <mark>Spicy Buffalo <mark>Spicy Flat Bread Chicken Sandwich</mark></mark></mark> with lettuce and tomato, kicked up with pepper jack and avocado-corn salsa. i want to say it was one giant sandwich cut into quarters, but it was really four still-giant sandwiches. before i got to my second sandwich, jp had already finished whatever she ordered, threw her credit card down on the table for us to pay with, and ran back to the casino. by herself. addict.\n\nin the past, i've also had the crispy thai shrimp & chicken <mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark>, lemon chicken piccata, and <mark>Banana Cream Pie</mark>, all of which i would recommend. i've always had great service, the atmosphere is great, and it's just the kind of place you want to be. comfortable and consistent. unfortunately there aren't as many pictures as usual, as i was too preoccupied with my meal companion or we were too concerned with getting back to the blackjack tables, but there are a few that will hopefully suffice. in summary, it's simple, nothing absolutely crazy gourmet, but definitely hits the spot and more than satisfactory. huge portions and so good! yummers!!!!"
        ], 
        "dish_name": "Banana Cream Pie"
    }, 
    {
        "text": [
            "i love coming here, affordable tasty comfort food in vegas right in the convenient hotel location right on the gambling floor.. and a short walk from tao.. or if you are staying at the hotel, pretty much on your way back to your room from anywhere on the strip you are coming from! :)\n\nsimilar environment/setup as sister restaurant cheesecake factory, always clean, spacious, comfortable seating, air conditioned, etc but casual.  \n\nthe have a pretty eclectic and extensive menu.. idk how anyone makes up their mind.. i'm a vegetarian so it greatly reduces the menu size for me, but there are still a plethora of options. like cheesecake factory there is no signature dish that they do exceptionally well that everyone comes in for, but just a huge variety of items that are all at least fairly good, perfect for a group because there is something for everyone. \n\nsome of my favorite 4am after club snacks:\n \n<mark>Double Stuffed Potato <mark>Crispy Thai Shrimp & Chicken Spring Rolls</mark></mark> (i order without the bacon) - definitely something different to put basically baked potato ingredients into a fried spring roll.. but its definitely tasty & the perfect late night comfort food. \n\njalape\\u00f1o-cheese cornbread- take 3 yummy ingredients and add them together? works here :) \n\nmacaroni & cheese skillet - i make it better at home, but this is definitely good for a restaurant (i've ordered macncheese at a lot of places and i think they try to fancy it up or something.. but it usually doesn't work out so well.. this one is a decent late night snack) \n\nedamame - can't really go wrong here, but these ones do have a sauce thats pretty good. \n\nfried pickles - yum \n\nzucchini and onion haystack- never a bad choice. \n\ncrispy sesame tofu - savory but still on the healthier side of things. \n\nwhipped sweet potatoes - sweet n savory\n\n*most importantly (in by book anyway!) the desserts: \n\ngrand lux is a sweet tooth's paradise!  \n\nit's a late night/early morning tradition of ours to get the box of fresh homemade chocolate chip pecan cookies & milk.. soo so warm gooey & good!! perfect comfort food! \n\nmolten chocolate cake, new orleans beignets, <mark>Peach Cobbler</mark>, butterscotch caramel pudding, pineapple upside-down cake, apple pie, <mark>Fresh Strawberry Shortcake</mark>,  cr\\u00e9me brulee duo, <mark>Warm Sticky Bun Bread Pudding</mark>,  cupcakes, banana vanilla wafer pudding, key lime, red velvet, carrot cake.. all sooo good! \n\nwith a list like that i have no idea how anyone chooses! \n\nthey have two of my favorite cheesecake factory cheesecakes:\ndulce de leche caramel \nwhite chocolate raspberry truffle\n\nmmm... \n\ni haven't tried the \"cupcake collision,\" sounds pretty fun: \"rich chocolate cupcakes collide with vanilla ice cream, hot fudge and whipped cream.\"", 
            "it was back to the grand lux for dinner.  this time, after once again enjoying an abundant order of very good <mark>Chicken Lettuce Wraps</mark> and crusty sourdough bread, i tried the soup du jour, cream of chicken soup with mushrooms, which contained giant chunks of fresh chicken but not many mushrooms.  i did not find it as much to my liking as the mushroom barley soup that i had previously enjoyed here.\n\ni almost ordered the kobe salisbury steak for my entree, but ultimately decided to get more adventurous, and try shaking beef.  i was not to be disappointed.  large lean pieces of beef tenderloin merged with red, white, and green onions; a mildly spicy clear marinade; and an imposing mound of steamed white rice to create a very tasty dish.  all elements were hot and delicious.  an individual house-baked <mark>Peach Cobbler</mark> ala mode provided a sweet ending to another fine meal here.\n\nit was a 4-1/2-star dining experience!", 
            "if you are a fan of the cheesecake factory, you should definitely check out the grand lux cafe when you are at the palazzo or the venetian. \n\ni came here for dinner with my parents last week. my parents don't eat beef or pork, so it was kind of difficult to find restaurants on the strip that had more than one or two good non-beef-or-pork options. luckily, the grand lux cafe has a plethora of dishes of all sorts. the menu here has to be the longest i've ever seen. as someone who is not a picky eater, i normally hate long menus, but i was grateful for it in this case, because my parents could finally choose a dish they really wanted. if you have a large party of people with different dietary requirements or cuisine  preferences, i would highly recommend this place.\n\nour server was great. my mom ordered the jambalaya, and the server made sure that the chefs made it without the ham. she was also attentive and knowledgeable about the menu.\n\nthe food was quite good. i had the crispy caramel chicken. the caramel sauce was a good balance of sweetness and spiciness, and all of the vegetables were fresh and cooked well. the portions are gigantic though! i have a healthy appetite, yet i was only able to eat about 3/5 of my meal. unless you are really hungry, i would recommend sharing an entree with someone.\n\nwhile looking at the menu, we saw that grand lux cafe offers made-to-order desserts (which you order at the same time of your main dishes), so we decided to try the <mark>Peach Cobbler</mark>. while the cobbler was really good (not too sweet, lots of peach), it wasn't quite as spectacular as i thought it would be. however, i'm from texas so i have pretty high standards for cobbler. \n\noverall, we all enjoyed our food here. i think the value you get is good compared to most of the other restaurants on the strip too."
        ], 
        "dish_name": "Peach Cobbler"
    }, 
    {
        "text": [
            "after hitting up the death cab for cutie concert, my friend and i decided to end the night with something sweeter than ben gibbard's lyrics: dessert at the grand lux cafe. \n\nall we wanted were endless cups of water, the bread basket, and a <mark>Key Lime Pie</mark> to split. to which, our waitress happily obliged. i read somewhere that glc is operated by the cheesecake factory - evident through their delicious (and calorically dangerous) desserts. service was spot-on, courteous without being overbearing or worse, inauthentic. as for the <mark>Key Lime Pie</mark>, our love was evident in the pie's disappearance within three minutes.\n\nfor years, my friends have been memorized by glc - it seems as though every birthday, empty moment with nothing to do or strip visit ends at the grand lux. for the most part, i agree with them...to a degree. \nservice is good, the food is pretty tasty (somewhat overpriced, but hey, it's the strip).", 
            "update: i did go back and had the sandwich again! it is just fabulous! food and service was awesome again.  also tried the <mark>Key Lime Pie</mark>, which was delicious.  great cafe.  \n\nmust try the <mark>Roast Turkey And Brie Sandwich</mark>! fabulous! also had mashed potatoes and mac & cheese. i know carb heaven. food was delicious and the service was outstanding! would definitely come back.", 
            "i was so impressed with the speed, quality and size of my salad. the server and staff were very friendly. when i come back to vegas i am sure i will come back to the grand lux cafe.\n\nsmoothie, huge salad and i had to ask for a box to take 85% of my <mark>Key Lime Pie</mark> home. still tasted great in hotel room."
        ], 
        "dish_name": "Key Lime Pie"
    }
]