[
    {
        "text": [], 
        "dish_name": "Square Box Collection"
    }, 
    {
        "text": [
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Ballotin Box"
    }, 
    {
        "text": [
            "this place has the cutest little cakes.  cute enough that i was stupid enough to walk over from the palazzo at 10 in the morning on a saturday just to pick one up for a birthday girl.\n\nthey also have cute <mark>Truffle Box</mark>.  it's like a step up from godiva.  cute, cute packaging.  cute!\n\nthey had a spongebob cake on display.  i was ecstatic :)", 
            "the <mark>Truffle Box</mark>. 5, 16, or 36 pieces of chocolate perfection. while there are many good things to experience at mr. philippe's phenomenal patisserie, walking out of the bellagio with that little brown box puts a smile on my face like few things on earth have the power to do. while your experience may vary, if you love truffles buy the box! you will quickly understand that there are some things so good, the english language doesn't have words to sufficiently describe it.", 
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Truffle Box"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Cocoa Truffles"
    }, 
    {
        "text": [
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Mini Ballotin Box"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Cognac Truffles (14 Pieces)"
    }, 
    {
        "text": [
            "i love chocolate so it was a must-do on our vegas list to visit jpp's famous chocolate fountain.  it was incredible to say the least and i was able to buy a \"piece\" of the fountain to bring back home as souvenirs for my sisters.  i noticed that the chocolate was coming from the ceiling my noted this to my husband who didn't miss a beat and replied that jpp's chocolate must be coming from heaven. :)  although i'm sure that this isn't the case, jpp's <mark>Chocolate <mark>Cocoa and Cognac Truffles (6 Pieces)</mark></mark> really were heavenly.  however, the selection at jpp bellagio is a lot smaller than the jpp aria so i'll give this one 4 stars :)", 
            "i've been to jean philippe for years, so it's about time for a review.   this past weekend i decided to try their gelato.  i had the pistachio and hazelnut gelato, and it was very good!  i enjoyed the pistachio more than the hazelnut, but both were delicious!  and it was under $5 for a cup with two scoops of gelato, definitely a bargain compared to the other gelato shops in vegas!   the crepes here are also delicious, but they are a tad expensive, about $10 if i remember correctly.   they also have a large selection of pastries, which are excellent.  my favorite is their chocolate croissants, it's loaded with chocolate, but it isn't overly sweet!  the butterfly cookies are also excellent.  i have tried their chocolates, which i cannot complain about.  they recently came out with a fruit jelly chocolate, which comes in a pack of 6.  these are excellent fruit chocolates and i would recommend them as a substitute to the regular <mark>Chocolate <mark>Cocoa and Cognac Truffles (6 Pieces)</mark></mark>.   the prices for pastries and gelato and very reasonable and they taste great.  the crepes are a tad expensive and so are the chocolate varieties, but they won't disappoint you!"
        ], 
        "dish_name": "Cocoa and Cognac Truffles (6 Pieces)"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Bar"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Bar with Nuts"
    }, 
    {
        "text": [
            "great pastries!  i can personally vouch for  the cheesecake in white chocolate, chocobana (chocolate mousse, caramelized bananas, dark chocolate cremeux, hazelnut dough), opera (chocolate ganache, coffee butter cream, almond biscuit, espresso syrup), and the pecan tart (pecan caramel, espresso cream, pecan buttercream, hazelnut dough).  the gelato is good, but not in the same league as the pastries.  there are also crepes, breakfast pastries, and chocolate.\n\n**update as of october 2007: the only thing i haven't liked is a nutella crepe (nutella is a <mark>Chocolate Hazelnut Spread</mark>). the crepe itself was fine, but it came slathered with much too much nutella. it was sickly sweet and rich - and this coming from a guy that likes greasy food.", 
            "having just spent a week at the bellagio, jean philippe became a breakfast/lunch/snack/late-snack/just because staple.\n\ni can't even believe how much food my fianc\\u00e9 and i ate from this place!\n\nturkey cr\\u00eapes \nnutella cr\\u00eapes\n<mark><mark>Coconut Chocolate Macaroons</mark></mark>\ngelato\nmadelines\n<mark>Chocolate Hazelnut Spread</mark>\ncheesecake\nnutella napoleon\nproscuitto, basil, mozarella panini (good served both hot and cold)\nturkey croissant sandwiches\nmeringues\nnutella brioche\ndulce de leche brioche\nplain croissants\nchocolate croissants\numm...  yeah\n\nkinda went a little overboard, but i have no guilt.  i agree that the service can be hit-or-miss but generally, we did pretty well. try to avoid ordering just before closing, or risk being crushed in the gate by the employees as they try to close for the night.", 
            "chocolate fountain at jean philippe patisserie at bellagio is a must see when you are in las vegas.  it's a modern day willy wonka choco wonder.  this incredible chocolate fountain is rumored to be a million dollar worth.  i took a lot of pictures, because the first time i've seen it 5 yrs ago, i never thought  its got a tag of a million dollar, but i am totally awed by this tall, inticate continuous flow of dark and white chocolate, that i'm so tempted to go underneath it, if it is not enclosed in a glass.\n         lucky they have crepe in front, fresh to order so i decided to try their \"crepe nutella\".  i was not disappointed.  it was nicely presented, softly made and with just the perfect amount of that yummy chocolate/<mark>Chocolate Hazelnut Spread</mark> of ferrero's nutella.  i usually get my crepe at paris hotel across the road, but with a show of chocolate fountain while eating your crepe, i would definitely choose jean philippe.  i would definitely try their other stuff next time i'm in vegas.", 
            "i have a love and hate relationship with jpp. they serve the best gelato i've ever had outside of europe, but i hate the fact i can't stop myself from making multiple trips (sometimes twice a day!) there whenever i'm in vegas.  \n\nit's a great place to grab a snack whenever. good variety of pastries, crepes and of course, gelato. they also offer a large variety of pre-packaged goods should you choose to take some with you when you leave (the peanut butter <mark>Chocolate Hazelnut Spread</mark> is exceptional!). there's always a line but it moves pretty quickly. \n\npastries are $5-$8, gelatos are $5 per cup (very generous portion). favorite flavors are mango and pistachio. \n\nas expected, i am now craving for their gelato.", 
            "note: my review is based on their pastries and desserts and chocolates.  i read a lot of good reviews on their crepes but my rating is not based on crepes, since i have not tried that.\n\ni am a big fan of sweets and desserts...but i find this place overrated.  the desserts are beautiful to look at but taste just ok.  $8 ea.  pastries $5 ea.  chocolate syrup in a bottle for $16 ea.  <mark>Chocolate Hazelnut Spread</mark> and peanut butter spread $12 ea.  i didn't mind the prices if they were really good...but they were not that special.  pretty disappointed."
        ], 
        "dish_name": "Chocolate Hazelnut Spread"
    }, 
    {
        "text": [], 
        "dish_name": "Peanut Chocolate Spread"
    }, 
    {
        "text": [
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Butterfinger Sticks"
    }, 
    {
        "text": [], 
        "dish_name": "Filled Chocolate Bars (3 oz.)"
    }, 
    {
        "text": [], 
        "dish_name": "Mendiants (16 pieces)"
    }, 
    {
        "text": [], 
        "dish_name": "Assorted Mini Chocolate Bars"
    }, 
    {
        "text": [], 
        "dish_name": "Gianduja Almonds"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Mini Pretzels"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Wafer"
    }, 
    {
        "text": [], 
        "dish_name": "Florentins"
    }, 
    {
        "text": [
            "nom nom nom nom nom nom. i am five pounds heavier after only two days' worth of unfettered access to the gastronomic orgiastic delights bellagio's little \"coffee shop\" has to offer. tiramisu gelato, resplendent with chunky mouthfuls of espresso-soaked sponge cake? check. nutella brioche, bursting with creamy hazelnut-chocolate flavor? check. scrumptious plain coffee, made luxurious with gobs of caramel syrup and real whipped cream? check. <mark>Peanut Brittle</mark> gelato, which may have finally converted my gelato-ly skeptical so to the dark side? check. fresh fruit cup, with juicy blueberries the size of your thumb? check. breakfast panini that made my so's eyes roll back in his head from pleasure? check.\n\nokay. so i spent well over $100 there in 48 hours. shut up. everything i had the pleasure of ingesting was superb! the world's largest chocolate fountain (which would look soooo much better in my living room) attracts a bunch of annoying tourists with cameras, but if you can focus on the goods and get past the chaos, you are gold!", 
            "whenever my sister or i travel, we always try to bring back something edible for the other. i remember when i first received my small package of <mark>Peanut Brittle</mark> from jean philippe patisserie. i looked at the label, saw the price, scoffed and thought to myself, this better be some hella good <mark>Peanut Brittle</mark>. who the heck would pay $15 for <mark>Peanut Brittle</mark>?!?!?! uhhh yeah... apparently i would because i bought two packages of it on my first trip to vegas. i specifically sought out the place just for the brittle... but well, like all good places you end up buying way more than you anticipated. \n\nthis wonderful patisserie is tucked inside the bellagio hotel. although many people rave about the chocolate fountain, i didn't find it that spectacular. honestly, by the way people were describing it, i was expecting to see the type of fountain out of charlie and the chocolate factory. but the fountain is a nice addition to the place. they also have crepes, gelato, a beautiful assortment of pastries and desserts, chocolates, and drinks. i left with 2 chocolate brownies, 2 packages of <mark>Peanut Brittle</mark>, <mark>Vanilla Sugar</mark>, and a fruit tart. i had to stop myself at that, even though i didn't want to! it's like gambling, you have to know when to stop. so if you get a chance, check this place out. i've definitely found one of my favorite sins in sin city!", 
            "great place to pick up breakfast/lunch/snack! super convenient if you are staying at the bellagio in the spa tower. ate a delicious ham & cheese panini (the mustard was awesome!) for lunch. also had half a nutella crepe and a bite of a chocolate strawberry crepe, both were delicious! throughout our stay i also tried a smattering of pastries for breakfast throughout the week (apple brioche, blueberry brioche, apple muffin, raisin cinnamon roll), all were excellent. i also bought the <mark>Peanut Brittle</mark> as a gift and they gave a nice bag to put it in. avoid going at peak times, as the line can wrap around the counter.", 
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)", 
            "on one of my many lone walks down the strip, i found myself inside bellagio taking refuge from the 100+ degree weather.\n\ni pulled out my phone and yelped for the nearest, most easily accessible treats and ended up st jp.  \n\nwow all their goodies, from sammies to crepes to gelato to pastries-- everything looked so appetizing. now i was already anticipating a large meal within the next hour so i couldn't go crazy. \n\ni got the popular nutella brioche, vanilla eclair and <mark>Peanut Brittle</mark>. \n\ni quite enjoyed the latter two treats but was disappointed in their nutella brioche. i suppose it would have been much better warm but it wasn't given to me that way. the brioche itself was tough and slightly stale unfortunately. at least they were more than generous with the nutella. \n\npretty sure i'll be making a comeback. this time, with no other dining plans.", 
            "i came here for the first time and it was a bit late. they had a very limited amount of items as they had sold out from the day. i decided on the tripe chocolate dessert. ive had a ton of desserts in my life and usually something like this is very dense and very heavy. to my pleasant surprise, this was neither. it had a creamy white chocolate center and some sort of <mark>Peanut Brittle</mark> even further in. really high quality tasty pastries"
        ], 
        "dish_name": "Peanut Brittle"
    }, 
    {
        "text": [], 
        "dish_name": "Crunchy Nougat"
    }, 
    {
        "text": [], 
        "dish_name": "Almond Rocher"
    }, 
    {
        "text": [
            "first off, the guy who works here with the mustache is a douche.\n\n[1] your sign telling us where to go to buy pastries is facing the register. to read it, we'd already be standing in the right place.\n\n[2] don't interrupt me when i'm telling you what i want to buy. maybe then, you'd actually get it right.\n\n[3] don't presume that i want my dessert for here, just to give me the stink eye when i ask you to box it up, smashing my macarons in the process.\n\nat any rate, the macaron with rose infused cream is delicious. it gets soggy at the bottom, though. so you probably want to chill it at your room if you can.\n\nmy girlfriend got the raspberry cake with pistachio cream and she enjoyed that as well.\n\ni also got a pack of four macarons which cost $8. they were delicious, however, and my girlfriend who normally doesn't like macarons enjoyed them as well.\n\noverall, good pastries, great looking <mark>Miniature Wedding Cakes</mark> on display, but generally unpleasant staff.\n\n====\n\nrubric: 5 = mindblowing 4 = excellent 3 = i see the charm 2 = disappointing 1 = never again", 
            "jean philippe is a great place to grab a quick pastry, coffee, or have a casual breakfast.  while the bellagio location isn't as welcoming or beautiful as the aria location, the food is just as good and the service is great!  the pastries are great, the crepes are fantastic (both sweet and savory) and the selection of dry goods has something for everyone!  i don't get the infatuation folks have with the chocolate fountain---its just a bunch of dripping chocolate.  much more impressive are the <mark>Miniature Wedding Cakes</mark> displayed around the shop.", 
            "we went for breakfast one morning while in vegas and my senses were on total overload! there's bound to be a line, but that's ok. it will give you time to check out the amazing cakes on display around the shop. i only wish i could afford a wedding cake like these! check out the rice krispy treat balls, the truffles and the mini <mark>Miniature Wedding Cakes</mark>. there's the chocolate fountain that looks like something even willy wonka would have been proud of. four different types of chocolate flow out of pipes in the ceiling, streaming over glass platforms into the floor. you can even buy bottles of chocolate from the fountain. \n\nmy partner got a basic bagel with cream cheese. i figured i'd try my hand at a plain croissant and a chocolate croissant. the bagel wasn't anything special, i guess, but both of my croissants were just about perfect! flaky and soft, not dry at all. the next time i go back i'd probably get the same thing, but i'd probably indulge in some of the amazing chocolate and other goodies there too.", 
            "cupcakes in vegas baby! \n\neverything at jean-philippe patisserie looked wonderfully delicious! there were even little mini <mark>Miniature Wedding Cakes</mark> just in case you had one of those quickie vegas weddings for $20 bucks a pop.  \n\nwe tasted the triple chocolate cupcake and the red velvet cupcake.\n\nthe cupcakes were so pretty ya almost didn't want to eat them...almost.  both cupcakes were super fabulous.  i had never tasted a cupcake quite like it.  the frosting on each cupcake was more like a rich chocolate mousse and the cake was just so incredibly moist. next time i am in vegas i am going to try this little set up called a sweet trio. it has a rose macaroon, a mini creme brulee, and a peanut cake pop. \n\na bit pricey for a cupcake at $ 5.50 each but definitely worth it.", 
            "in the mood for gelato after strolling the shoppes at bellagio?  swing by this patisserie for a flavorful cold treat for the taste buds and a treat for the eyes. there is a floor to ceiling chocolate fountain and displays of intricate <mark>Miniature Wedding Cakes</mark> and whimsical special occasion cakes.  we sat for awhile, consuming tiny  spoonfuls of our pistachio,  coconut, and triple berry gelato scoops and watched videos of how j-p artists  engineer their chocolate creations. there are sandwiches and salads, pastries, and other concoctions, too, in case you prefer a meal before dessert!"
        ], 
        "dish_name": "Miniature Wedding Cakes"
    }, 
    {
        "text": [], 
        "dish_name": "Gianduja Pyramid"
    }, 
    {
        "text": [
            "this patisserie is located behind the beautiful bellagio botanic garden. the first thing you'll see is the mesmerizing fountain of cascading liquid chocolate. jp offers an incredible selection of sweet and savory items including chocolates, cookies, cakes, crepes, salads, sandwiches and much more. \n\nmy favorites are the ham and cheese panini sandwich, grilled to perfection with melted cheese and ham, simple and yet satisfying. sugar brioche, a rich buttery roll topped with crystallized sugar, the crunchiness of the sugars compliments perfectly with the soft and sweet dough. <mark><mark>Chocolate Fountain Bar</mark></mark> crepe, a made to order crepe, topped with warm caramelized banana, and drizzled with <mark>Hot Chocolate</mark> sauce, add a scoop of vanilla bean gelato, and it's a perfect dessert!", 
            "they look good and they taste even better! ^_^bbbbb if i have 5 thumbs they would all be up. but, i settle with the stars. \n\nif you treck to the bellagio casino in las vegas, and enjoy the indoor garden/green house that grace the big hall next to the lobby, venture in a little bit further. behind the green garden there is a small garden of indulgence. jean-phillipe patisserie. ( i believe he is the head chocolatier for bellagio) well, the place is spectacular and filled with goodies dripping from its wall and ceiling. literally. :)\n\nmy favorite indulgence there is the gelato. it is pricey, but so worth it. i mean, hey, you are in a fancy place, you gotta expect to pay a fancy price. at least it's fancifully good too ~.^\n\nwhat is your mood? something light and refreshing? something soury to perk you up? something with umph and rich? fruity? etc etc. you gotta taste them and make your pick. my last venture was for tiramisu and rum raisin. *drool* perfect combo. my sister chose strawberry and chocolate. the chocolate gelato is dark and rich and taste more chocolatey than a chocolate colored frozen sugar. that, my fellow yelpers, is how chocolate ice cream or gelato supposed to taste like.\n\nin the summer i would usually go for the fruity sorbet type, like mango, coconut, lemon. they perk you and chill your body as you stroll out into the hot summer of las vegas.\n\nthe place opens late and will fulfill your sweetest indulgence from something cold, something warm, something hot and something crunchy. cakes, pastries, chocolates, candies, crepes, gelato. you name it. they opens pretty late and starts early in the day (in case you play hard and forgot the time of day and realize you need *ehm* breakfast. get your savory crepe, or salad, or sandwich, and a cup of <mark>Hot Chocolate</mark> ^_^", 
            "you've got to \"stop and smell the roses\" when you see 3 different kinds of liquid chocolate flowing from the ceiling down onto the floor at a lovely french patisserie.   and that's exactly what we did - except, we also tasted the darn good metaphorical \"roses.\"\n\nyo (my attempt at attracting a massive public attention as i rarely use such, um, form of greeting).  get this: this place isn't cheap (a simple cup of t-bag tea is $3.50 and most of their pastries run $8-15 per piece).  but it's oh-so-good, almost to the point where you just wish you owned the place.  the chocolates are rich and smooth (and, yes, expensive - costing over $6 for a tiny piece of rocher), the <mark>Hot Chocolate</mark> being a one-way express ticket to heaven, and the pastries.... oh the pastries!!!\n\nif you like fresh crepes... this is the place to be.  they offer a variety of crepes that they make right then and there (see picture) - bam! \n\nthey also have some (albeit limited) seating areas where you can sit, sip, and savor away the delicate chocolates.  it does get a bit crowded, but i suppose that's all part of the vegas fun.", 
            "everything that can be said has been said about this wonderful place, so i will keep it short.  the tiramisu gelato was rich, creamy, and otherworldly....possibly the best tiramisu i've ever had, but in frozen and transcendent form.  the $8 72% dark <mark><mark>Chocolate Fountain Bar</mark></mark> i bought for the lady?  smooth, rich, and perfect.  the coffee......i guess it was coffee, but honestly it tasted chocolate infused......heavenly.\n\nmy buddy picked up a bag of the \"<mark>Hot Chocolate</mark>\" for his mother....as opposed to standard powder/mix, these were miniature balls of chocolate designed to be dissolved in milk.  incredible.\n\nwhile the lines can get long and inconvenient, who cares when you can watch the mesmerizing chocolate fountain and stare at the incredible fondant cakes surrounding you?\n\ni'll stop by for a crepe next time, for sure.", 
            "leave it to the french to have the absolute best desserts even in sin city.  jean-philippe was amazing!  the fruit sorbet was very smooth and tasted just like the fruit it represented but wayyy better. the tiramisu was decadant. the dark <mark>Hot Chocolate Powder</mark> layered in between the cream was so rich.\n\nmy only compliment is that j-p needs to serve up some 5 star service with his 5 star desserts.  perhaps the servers need to be given a daily dose of the desserts to put on a smile :)", 
            "i absolutely love this place, but then i absolutely love chocolate. they have the best <mark>Hot Chocolate</mark> i have ever tasted hands down. it has a rich chocolate flavor, but isn't really sweet...just sweet enough to not be overly bitter. i love it. i also love their cakes...everything is sooo good! their pastries are delish too. my friend had one of their savory crepes, it looked very yummy as well, and she seemed to enjoy it a lot. a must go to every time you're in vegas!", 
            "delicious.  i had:\n- blueberry brioche ($3.95): oh-so-good... like a blueberry muffin but better\n- basil aioli chicken panini ($10.50): droolworthy. it was so delicious... has grilled onions and fontina cheese.  the bread was so crusty and crunchy.  mmmm.\n- gelato ($6.75 if you get a waffle cone): pricey, but super creamy & tasty. for the same price, you can choose to have 1 or 2 flavors.\n- <mark>Hot Chocolate</mark> (~$4): mediocre.\n\nthey also possess the guinness world record for largest chocolate  fountain.  check it out- it is truly enormous.\n\nthe only reason it's 4 stars and not 5: the price of the panini and gelato -- it wasn't even huge or anything... but it's in the bellagio, so i guess that's to be expected.", 
            "i'm a self-professed chocoholic and a chocolate snob. and i absolutely loved the <mark>Hot Chocolate</mark> they serve here. our group got a few crepes and they were all good. the veggie crepe is a great choice if you don't like to be overwhelmed with cheese. the nutella crepe was delicious. they also have a great pastry bar. the flowing chocolate display is unique. \n\nbut the <mark>Hot Chocolate</mark> takes the cake for transporting me to a different continent. :-)", 
            "it was okay. i went to this place because their <mark>Hot Chocolate</mark> was extremely highly rated as the best <mark>Hot Chocolate</mark> ever.  as a chocoholic, i was extremely disappointed when i tried it.  starbucks <mark>Hot Chocolate</mark> is better, which is saying a lot because generally that isn't very good.\nthe only reason i'm giving it 3 stars is because their services was good.  they ran out of large cups so gave us small cups and free pastries.\nthe pastries were actually really good!", 
            "2014 yelp 100 challenge - 45/100\n\ni had read some amazing reviews about jean philippe patisserie, so i had to come here on my recent visit to vegas this past weekend.\n\nit is located in the bellagio hotel, just a little bit past the conservatory & botanical gardens. there are signs pointing towards which direction it is located in!\n\ni was actually pretty surprised at how small this place was. i had envisioned to be a full bakery/patisserie with tons of cute little cafe tables/chairs and whatnot, but that wasn't the case. it's like a circular area with the employees/staff all in the middle, and you kinda just walk around the counter to look at all of the pastries, gelato, sandwiches, etc.\n\none wall has the famous chocolate fountain, which honestly...was not as big as i had pictured. when people said it's the \"biggest chocolate fountain in the world\" i was thinking like straight up willy wonka status. this was totally not the case! granted, it was a really nice glass display and i really liked that they had dark, milk, and white chocolate pouring in it, but i didn't think it was as mindblowing as i had expected it to be.\n\nalong the circular walls they have a bunch of packaged goodies like chocolates, candies, <mark>Hot Chocolate</mark> mix, etc. they also have some fake cakes on display. i'm not sure if they actually bake fancy cakes here, but the displays were nice!\n\nunfortunately i had just eaten lunch and wasn't hungry at all, so i didn't any of the pastries although i had really wanted to try some of them out! they didn't have a huge selection but some of them looked very tasty! i ended up getting a scoop of the dulce de leche gelato ($3+), and the jean philippe vanilla <mark>Hot Chocolate</mark> mix ($18).\n\nthe gelato was ok to me. presentation wasn't the nicest, and also it was really soft...like to the point where it was basically melting! gross. i wasn't impressed.\n\ni made the <mark>Hot Chocolate</mark> mix when i came home, and i must say, this stuff is incredible. it reminds me of the <mark>Hot Chocolate</mark> at churros calientes in los angeles. super thick, rich, and decadent. omg, it is incredible. i'm glad it turned out well because $18 for only a few cups of <mark>Hot Chocolate</mark> was pretty pricey! even more than godiva and some other high end chocolate brands.\n\noverall, i liked jean philippe but i wasn't as blown away as i thought i was going to be. i definitely would return to actually try some of their pastries and maybe even their crepes (which are supposed to be amazing). 3 stars!", 
            "as an incorrigible sugar addict, you'd think i'd automatically give this patisserie five stars, but i found their goodies looked better than they tasted. i find it difficult to forgive & forget when a dedicated dessert spot disappoints me, so i won't be giving jean phillipe another chance. \n\n- <mark>Hot Chocolate</mark>: dark chocolate flavor was overpowering. not smooth & creamy, more like melted dark chocolate. too much of a good thing. \n- chocolate croissant: not enough chocolate. i've had better from no-name bakeries.\n- chocolate-dipped rice krispy treats: though the shiny, sexy chocolate glistened beautifully, the flavor was dull & chalky. \n\neverything was so, so average. i expected more from a place where chocolate fountains flow freely.", 
            "do you like chocolate? if so you'll love this intimate chocolate delicatessen experience. great people watching and i enjoyed the vanilla \\u00e9clair and <mark>Hot Chocolate</mark>. this week the had a life sized grinch made of chocolate. amazing culinary feat in its own.", 
            "we got super lucky the day we came here because it wasn't that busy when we ordered.  after our order was placed, thats when the crowd came.  \n\nby the way, when i come here, i get so confused that there are different lines.  so yes, pay attention to what line you are in so you don't waste your time any longer to get your, oh so sweet delights.  \n\nwe ordered crepes, pastries, <mark>Hot Chocolate</mark>, and coffee.   since there were 5 of us we ordered 3 different crepes, lucky me right?    yup, i got to try a lot.  all delicious.  \n\ni am reading through the reviews and yes it is a bit pricey, however, you are the strip and this isn't your average dessert place, so i think its okay to treat yourself, or your sweetie (see what i did there?)  not much seating, so if you want to enjoy your dessert right away, save yourself a seat when one opens up!", 
            "i love the <mark>Hot Chocolate</mark> and mochas here! i look forward to visiting for the christmas display every year so i can get this drink.", 
            "first of all, the staff/chefs are excellent and very pro. they all live up to the standard of jean philippe. i've tried their <mark>Hot Chocolate</mark> and crepes before, and they were heavenly. now, my wife was hungry as we missed dinner, and the line for crepes was long, so we picked up a tuna panini to go. oh boy, was i in for a surprise when we bite down after we got back to our hotel. the bread was still fresh and crunchy, the tuna ain't your usual cheap canned tuna (which most places do) as it was fresh, full of aroma, and very very tasty. it is, by continental far to be the best tuna sandwich/panini i've ever had! it is worth every penny of almost 1,200 of it.\noh, did i mention their <mark>Hot Chocolate</mark>? it ain't cheap for a very good reason. you won't find one as smooth anywhere else, and as chocolaty, yet not too sweet. don't just take picture of the cool chocolate fountain, get a <mark>Hot Chocolate</mark>! they should have something that say \"be calm and drink <mark>Hot Chocolate</mark>\"."
        ], 
        "dish_name": "Hot Chocolate"
    }, 
    {
        "text": [
            "this patisserie is located behind the beautiful bellagio botanic garden. the first thing you'll see is the mesmerizing fountain of cascading liquid chocolate. jp offers an incredible selection of sweet and savory items including chocolates, cookies, cakes, crepes, salads, sandwiches and much more. \n\nmy favorites are the ham and cheese panini sandwich, grilled to perfection with melted cheese and ham, simple and yet satisfying. sugar brioche, a rich buttery roll topped with crystallized sugar, the crunchiness of the sugars compliments perfectly with the soft and sweet dough. <mark><mark>Chocolate Fountain Bar</mark></mark> crepe, a made to order crepe, topped with warm caramelized banana, and drizzled with <mark>Hot Chocolate</mark> sauce, add a scoop of vanilla bean gelato, and it's a perfect dessert!", 
            "everything that can be said has been said about this wonderful place, so i will keep it short.  the tiramisu gelato was rich, creamy, and otherworldly....possibly the best tiramisu i've ever had, but in frozen and transcendent form.  the $8 72% dark <mark><mark>Chocolate Fountain Bar</mark></mark> i bought for the lady?  smooth, rich, and perfect.  the coffee......i guess it was coffee, but honestly it tasted chocolate infused......heavenly.\n\nmy buddy picked up a bag of the \"<mark>Hot Chocolate</mark>\" for his mother....as opposed to standard powder/mix, these were miniature balls of chocolate designed to be dissolved in milk.  incredible.\n\nwhile the lines can get long and inconvenient, who cares when you can watch the mesmerizing chocolate fountain and stare at the incredible fondant cakes surrounding you?\n\ni'll stop by for a crepe next time, for sure.", 
            "i first sampled these chocolates when they were left in our bellagio hotel room - unlike other hotel bedside chocolates, these were incredible - i had to get more to bring home!\n\nthe boutique itself is a bit small and does not offer a large selection of items, but it's adequate in getting that chocolate fix.\n\nthey have simple <mark><mark>Chocolate Fountain Bar</mark></mark>, some specialty bars, caramels, hot cocoa (drinking chocolate) and <mark>Chocolate Covered Marshmallow</mark>.\n\nthis is definitely one of those places you always stop by when you are in vegas.", 
            "i kept passing by this darling patisserie en route to and from my hotel room while staying at the bellagio. there was always a line, which was discouraging, but it kept me away from the high caloric crepes, and luscious looking desserts. anyhow, i was in vegas to run a half marathon, so the last thing in the world i need is to consume these fattening pastries. \n\nthat is what i kept telling myself all weekend. \n\nand so the last day of our trip rolled around, and i agreed to meet a few friends for breakfast before our massage appointment. trying to be healthy, i ordered the berry protein shake, which was very delicious, but not as good as the nutella crepe merely looked. i held off from ordering one, and only indulged in one bite of my friends. \n\nhere i sit at home.... thinking.... dreaming.... craving.....that delicious hazelnut and <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark> crepe. \n\ntrust me. do not refrain. you'll regret it. i am.", 
            "the absolute best crepes i have ever had!! my favorite is definitely the souffle crepe. i personally like my crepes pretty plain but <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>,  so this was kind of the perfect one for me. i've tried others before, but cannot remember their names since my discovery of the souffle crepe, but i do recall the others being delicious as well.\n\nthey also vend several different types of goodies which are great for gifts. everything is nicely displayed and decorated, very clean and fancy and i can stare at their amazing chocolate fountain for days!\n  \neach time i go to vegas, i always try to make a trip to this place even though it may be bit out of my way if i'm not staying at the bellagio. it is not located in the same area as the other stores and boutiques, it is actually by the guest elevators instead, which is a bit of an awkward location. yes, the place might be hard to find, it may be a bit pricey, the lines might be long, and the place might be unorganized with several customers wandering around, but the crepes are definitely worth the trouble!", 
            "girls love crepes. it's true. so a crepe stop at the esteemed jean philippe patisserie is a requirement on an all-girls vegas trip. i was surprised by the lack of seating. there's 3-4 small tables wedged into the walls and some very small tables further down the corridor, but it's very much a take-and-go cafe. the curvy, bending mounted wall menu is hard to read when it's over your head while in line, so decide what you want beforehand. the lady taking the orders was pretty rude to me as well. i must've not heard her when she asked me what i wanted and she skipped to the person behind me. \"excuse me, did you take my order yet?\" i asked politely. \"no.\" she glared at me. whoa, alright, sorry. she left for a little bit, came back, sighed, and begrudgingly told me, \"okay now i can take your order.\" jeez, i'll buy some hearing aids next time. all other staff were pretty nice. \n\ni feel like i've listed a lot of cons, but it's not a bad place! it's a beautiful, unique, tasty cafe. the chocolate fountain is awe-worthy. it's hard to resist the urge to break through the glass and just drown yourself in the chocolaty waterfall. lots of amazing, quirky, gorgeous cakes lining the walls so you have some eyecandy when in line or eating. \n\non to food!\nnutella brioche // simple and delicious. soft, tender bread <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark> injected right in the middle.\n\nberry souffle crepe // the crepe itself was fine, syrup too sweet for my taste, strawberries weren't fresh, but oh-dear-lord i just have to give the 4th star for the souffle filling. i think i've found something i love more than nutella. there! i said it. if only they sold that vanilla creme in a double-pack from costco. only an inkling of public decency kept me from licking that plate clean. would've been absolutely perfect if i had the souffle crepe sans syrup with fresh berries and dollop of whipped cream.\n\nsugar crepe // my friend ordered this plain crepe and...it was no good. she hated it and she grew up in france, she knows what a real crepe should be like. it was filled with granulated sugar and sickeningly sweet. skip!", 
            "no matter how good the pastries might be, if they are served with a really bad attitude then they might as well be made out of dog chow.  we were in line for 30 minutes, and not because they had tons of people in line, they were literally that slow.  so when you walk by and they seem super busy or packed, just know it's that they are super slow and not that they serve that many people.  three people around me in line left before reaching the counter because it was that slow.  it could have something to do with the fact that \"charles\" who claimed to be the manager did nothing but stand around the entire time or it could be that another worker had a wash cloth and wiped the same three feet of counter not less than ten times and did nothing else.  the only person working hard was the poor lady making crepes.  charles let this happen instead of doing the right thing and offering to help her.  guess he's too good to do any real work or get his hands dirty.  the people in front of me were planningo on ordering gelato, but the first three flavors they requested were greeted with \"we're out of th0at flavor\" and then \"we are out of anything <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>\".  this was interesting since charles, you know the manager thad stood around doing nothing, seemed to be responsible for keeping the gelato bar full since he stood over it making a list of what was needed.  in all the time i waited, he never brought any of them out though.\n\nfinally, i get to the front of the line and i ask charles if he is a manager.  he answere \"yes\" but kept his head down and wouldn't even look at me.  guess he's too good to interact with customers too.  when i told him i felt the service was really bad and that i didn't appreciate that someone that handled money without washing their hands was now handling the overpriced pasteries i ordered, he didn't even respond.  i kid you not.  he was three feet in front of me and he literally pretended not to hear or see me even though he actually replied to my first question (without looking at me).  he should have just said \"f*ck you\" to me so at least i didn't hold my breath waiting for a  response.\n\ni wish i had an opinion about the food, but the experience was so horrible and dealing with charles was so insulting that i didn't even eat what i ordered.  i gave it to my kids (of course after i made them give me fresh ones because of the ones they first tried to give me with nasty dirty hands).", 
            "the first day we went they had sold out of their nutella brioche ... they said they wud get more in the next day at 7 am...so w went the next day n finally got it...the brioche was buttery n it was adorned <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark> on top n.plenty of it in the middle...while it was good (cuz everything is better <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>) it was nothing special...we also tried the chocolate mint gelato which was delicious...very refreshing for a hot day n a sizeable scoop\n\nbrioche $4\ngelato $5.25\n\nalso bring ur camera...there is plenty to see including the worlds largest chocolate fountain & a large marshmallow train :d", 
            "i knew that i had to indulge my sweet tooth *just once* while in vegas...\n\nso, in typical vegas fashion, i decided to go big or go home.\n\nthere's no better place to seriously indulge one's craving for sweets than jean philippe in the bellagio, and there's no better way to indulge one's craving for sweets than jean philippe's pastry sampler.\n\nfor about $9, i was able to taste 3 of jean philippe's sublime dessert creations.  after taking a gander at the world's largest chocolate fountain (natch) and waiting in line for less than 5 minutes, i had in my hand a plate of the following:\n\n** a raspberry macaron stuffed with fresh raspberries and cream and dusted with powdered sugar.  i admit that i'm still a newbie in the world of macarons, but this macaron was delightful.  it had a beautiful chew -- not too tough or crumbly -- which played nicely with the juicy berries.\n\n** a chocolate, peanut butter, and hazelnut-filled cake lollipop.  this little package of bliss is as sinfully sweet and decadent as it sounds.  another home run.\n\n** cr\\u00e8me br\\u00fbl\\u00e9e.  as much as i adored the macaron and the lollipop, the cr\\u00e8me br\\u00fbl\\u00e9e was by far my favorite.  while i have a history of tasting some underwhelming cr\\u00e8me br\\u00fbl\\u00e9es -- whose burnt sugar top-layers taste like charcoal -- jean philippe manages to turn the cr\\u00e8me br\\u00fbl\\u00e9e top into a pristine pane of sugary glass.  it's absolutely miraculous to look at, and transcendent in both taste and texture.  the vanilla cream itself is also executed with care and skill.\n\nas if these three desserts weren't enough -- they were all artfully placed on a base of pure milk chocolate.  \n\nyeah, we finished all of it -- including the <mark><mark>Chocolate Fountain Bar</mark></mark>.  \n\n(don't judge.)\n\nneedless to say, my sweet tooth was satisfied.\n\nall of jean philippe's sugar-laden works of art are brilliant.   next time, i want to try try jean philippe's cr\\u00eapes and gelato.  heck, i'll try anything chef philippe comes up with.", 
            "while walking through bellagio to catch the tram, we noticed this amazing bakery.  the site is beautiful and it was packed with folks trying to get an sweet afternoon treat.  everything looked amazing and there were so many options to choose from that it was really hard to pick just one dessert.  my friend settled on the creme brule' gelato and i went with the triple chocolate cheesecake.  she enjoyed her gelato.  my cheesecake was so beautiful that i did not want to cut into it.  the cheesecake was covered by a white chocolate shell.  once you cut into it, the cheesecake was really soft and yummy.  the graham cracker crust was difficult to cut into while walking and eating at the same time, but it was really good.  once it was done, there was a <mark><mark>Chocolate Fountain Bar</mark></mark> on top which was the perfect capper.  i wish i could have tried some of the other pastries or chocolates.  i will be back next time i am in vegas.", 
            "i am in love with this place. i just wish i had tried it sooner so i could have come back every morning for breakfast.\n\nwhat we ordered:\nnutella brioche - sooooo good. it's a brioche dusted in powdered sugar and filled <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>. how can you go wrong there??\n\nnutella crepe - good. i mean, it's a nutella crepe. it's not as good as the ones i've had in france, but it's the best i've had in the us, so no complaints. i'd order it again since i'm addicted to all things nutella.\n\nroyal crepe - good if you like creamy savory crepes. i probably wouldn't order it again just so that i could try more sweet crepes, but i recommend it to those who prefer savory.\n\npain au chocolate - to die for. it's everything a pain au chocolate should be. the croissant is flaky, buttery perfection, and there's just the right amount of chocolate in it! now i'm going to have this hole in my heart where the jean philippe pain au chocolate should be since i won't be getting anything of the same quality for a long, long time.\n\njean philippe is a must! the wait doesn't seem so long when your eyes are glued to their marvelous candy decorations, and the food is divine. it's like being transported to france.", 
            "by the time i stopped at this branch of the jean philippe patisserie, i had already visited the one at the aria thrice in one trip. \n___________________________________\n\ndate/time: saturday, march 30, 2013 // 6:15pm\n\nprice: +/- $10/crepe, $4/donut.\nvalue: a bit pricey, which increases expectations a bit.\nambiance: this branch is somewhat smaller than the one at the aria, and due to it's circular set-up, can be a little confusing. for crepes, you get in the line to the left hand side when facing the store, order your crepes, then wait for your name to be called out. seating is not directly within the jean philippe and looks a bit like somewhat outdated bellagio-themed random tables and chairs, unlike the modern set-up at the aria location. there is, in fact, a chocolate fountain.\nservice: a bit on the slow side.\nchance of returning: 40% (i prefer aria's)\n___________________________________\n\n:::: [ the food ] ::::\n\n* banana foster crepe w/nutella - $8.95 + $2.00 = $10.95\n             http://www.yelp.com/user_local_photos?select=8kefh3qyjoibgqliqhuxqa&userid=bwfejsr9ylqdszamaxfyqg\n             - [3.5/5 - after having the crepes at bacchanal the day before, the hub and i were craving them again. unfortunately, while this one clearly had more calories and was very tasty, it was just not *as* good, surprisingly. the banana foster itself was so runny that it made the crepes soggy, and had a rather strong flavor.]\n* vanilla souffle crepe w/nutella - $9.95\n             http://www.yelp.com/user_local_photos?select=jyoxxb6fifvqrmnmrct7hg&userid=bwfejsr9ylqdszamaxfyqg\n             - [3.5/5 - tasty. the vanilla cream was not too sweet. we opted to pair it <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>, which we found added a perfect amount of sweetness to the crepe.]\n* nutella donut - $4.00\n             http://www.yelp.com/user_local_photos?select=rxd7v047i0u8pygrlcnzfq&userid=bwfejsr9ylqdszamaxfyqg\n             - [4/5 - we were looking for the nutella brioche, but they had sold out by 6pm on a saturday afternoon. the nutella donut was really good, with a nice ratio of nutella to dough.]", 
            "my gf loves their almond croissants, so flaky! i tried their sticky buns, flaky and light too! \n\nalso got her a bar of nougat w/ pistachios, loved it! grabbed a container of that coconut cracker thing and guess what? she loved it!! can you see a trend? lol\n\nwe've been here lots of times and just looked and was turned off by the prices, big mistake. this place is worth every dollar! you can taste the difference. on previous trips we did buy the <mark><mark>Chocolate Fountain Bar</mark></mark> and of course we liked it. \n\ncan't come to vegas without stopping in!", 
            "they have a plain raised sugar doughnut <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark> in it, that is to die for. it is amazing!", 
            "funny the cascade of three different quality of chocolate \nwe ate:\nsouffle with vanilla and nutella: excellent  \ncrepes <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark>: exquisite \ncrepes apple sensation: sweet\n\nthe service was fast and very well done\nwe'll come again", 
            "ordered a cr\\u00eape <mark><mark>Chocolate Fountain Bar</mark> with Nuts</mark> and berries. soooo delicious. made super quick and still piping hot in the box (though the whipped cream melted a little bit from the heat, naturally) when i walked back to the attached vdara. we split it and loved it. the next day, i had a latte and a plain croissant for breakfast and those were very good. i've been to paris and had my share of fare, and this is probably the closest to it that i've had in north america thus far. love this place for continental-style breakfast & also for the dessert, of course. hope to try more of the menu when i return to vegas. :-)", 
            "after the comedy show saturday night, we looked for some place to get a drink, or i accidentally suggested \"sweets\", so ended up coming out to this place to try their cakes!!  yup, things happen for reasons!! \n\nwe had:\n*mini sweets sampler: so cute!! mini pudding, cake pops and raspberry macaron are on the <mark><mark>Chocolate Fountain Bar</mark></mark>.\n*opera chocolate cake\n*tall coffee (who drinks coffee that late at night? meeeee..)\n\nwe got us a nice comfy table and chairs in the hallway next to the window looking down in the pool below..\n\nif you see way too long line up front, try the cashier on the side by the chairs. that one had no line whatsoever.\n\ni can see myself keep coming back here..", 
            "i love this place\n\nlike\nway too much.\n\nback when i was young and not 21, my parents discovered this sugary place in bellagio. and me being my young self, as a rugrat, i loved sugar.\n\nwell now that i'm over that hump, i still love sugar and ice cream. and during our trip to vegas, i had to go to jean philippe patisserie. just had to! and my cousin said okayyyy and so we went to jpp.\n\nthey serve breakfast and you only have 1 line in the mornings til around 11:10am. at that time, they separate into 2 lines. so if you're like me and want ice cream, you can get a second line at that time rather than wait in the whole long line.\n\nchocolate- love it. rich, very rich. sweet. amazing. tasty. in love. it's like on a whole nother dimension. i wish they had it here in socal.:ddd i always get this and i wish i could just eat this every dayyyy.\n\nmint choco chip- hehe the mint is in chip form and it just brightens and freshens you up. it wakes you up. \n\nthey also have <mark><mark>Chocolate Fountain Bar</mark></mark> and other halloween candies. they have waffle-ish stuff as well here, so you can eat this for breakfast. but at the end of the day, i still love their gelato/ice cream."
        ], 
        "dish_name": "Chocolate Fountain Bar"
    }, 
    {
        "text": [
            "tried the souffle crepe here.. it was pretty good!  good chocolate. it was a better than average crepe.  the whipped cream however, was very mediocre.  the <mark>Chocolate Sauce</mark> used wasn't the best i've ever had. i'd rate the chocolate a 4.  my friend also tried it, but she though it was more on the mediocre side. they don't have chocolate fondue here.  they don't have chocolate fondant here. the best chocolate shops always have something to wow me... just crepes, gelato, coffee, smoothies, milkshakes..  nothing you won't find elsewhere in america.  \n\nthey do have bottles you can buy to make chocolate fondue yourself.. but for the lazy there aren't any options.", 
            "chocolate and gelato heaven!\n\nbest chocolate souffle crepes ever! well worth the money and wait. it had delicious <mark>Chocolate Sauce</mark> and chunks of what it seemed like soft brownies with walnuts in them, custard, side of whipped cream and powdered sugar. i also had the intense and yes it was just that. i counted about 10 different treatments to chocolate in this one little piece of macaroon mousse treat! i recommend their iced mocha to wash it all down. :] oh, and had to try the sugar brioche because of a yelper. that was prepared very well also.  we sat not too far from the shop outside in the lobby. i'm pretty sure it was for their customers too. the view was of the bellagio's pool.", 
            "this place is great! came here twice in my 2 days that i was in vegas. i had gelato the first day (hazelnut) and it was really good. not the best, but definitely one of the better ones in the states. 2 days later i came back for brunch and i got the croissant which was amazing, so crisp and fluffy at the same time. i also got a sugar crepe with strawberries, whipped cream, gelato and <mark>Chocolate Sauce</mark>. mmmmm sooo good. i walked by the jean phillippe at the aria and i loved the chocolate dragon display. this location wasn't as big or as well decorated but the food was still really good.", 
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Chocolate Sauce"
    }, 
    {
        "text": [
            "leave it to the french to have the absolute best desserts even in sin city.  jean-philippe was amazing!  the fruit sorbet was very smooth and tasted just like the fruit it represented but wayyy better. the tiramisu was decadant. the dark <mark>Hot Chocolate Powder</mark> layered in between the cream was so rich.\n\nmy only compliment is that j-p needs to serve up some 5 star service with his 5 star desserts.  perhaps the servers need to be given a daily dose of the desserts to put on a smile :)"
        ], 
        "dish_name": "Hot Chocolate Powder"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Cereal Balls"
    }, 
    {
        "text": [
            "i first sampled these chocolates when they were left in our bellagio hotel room - unlike other hotel bedside chocolates, these were incredible - i had to get more to bring home!\n\nthe boutique itself is a bit small and does not offer a large selection of items, but it's adequate in getting that chocolate fix.\n\nthey have simple <mark><mark>Chocolate Fountain Bar</mark></mark>, some specialty bars, caramels, hot cocoa (drinking chocolate) and <mark>Chocolate Covered Marshmallow</mark>.\n\nthis is definitely one of those places you always stop by when you are in vegas."
        ], 
        "dish_name": "Chocolate Covered Marshmallow"
    }, 
    {
        "text": [], 
        "dish_name": "Assorted Crisp Pearls"
    }, 
    {
        "text": [], 
        "dish_name": "Orange, Citron, Almond Candy"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Friture"
    }, 
    {
        "text": [
            "for the amount of time we spent queuing for what i thought would be a party for my tastebuds, i was sadly disappointed by what jean philippe had to offer.  the raspberry tart was forgettable, not to mention plain and dry.  the only memorable thing was their <mark>Chocolate Turtle</mark>, which i discovered by accident at the register. i thought they were divine! but when i had them again recently i felt they were too sweet. not to mention, not really worth the exorbitant price for two chocolates."
        ], 
        "dish_name": "Chocolate Turtle"
    }, 
    {
        "text": [], 
        "dish_name": "Fruit Pound Cake"
    }, 
    {
        "text": [], 
        "dish_name": "Rice Crispy Treats"
    }, 
    {
        "text": [
            "desserts, chocolate, pastries, desserts, truffles, tarts, desserts! omg this place is my heaven! definitely not cheap but the things that they are making and selling are out of this world! i tried the chocolate mousse with a dark chocolate ganache and small chocolate <mark>Rice Crispy Balls (1 Piece)</mark> inside. the mousse was so smooth and the <mark>Rice Crispy Balls (1 Piece)</mark> gave it a nice crunch. also tried a dark chocolate raspberry truffle and a tropical jelly chocolate which was pretty much chocolate with a passion fruit jelly inside. absolutely to die for!"
        ], 
        "dish_name": "Rice Crispy Balls (1 Piece)"
    }, 
    {
        "text": [], 
        "dish_name": "Sable Breton"
    }, 
    {
        "text": [], 
        "dish_name": "Biscotti"
    }, 
    {
        "text": [], 
        "dish_name": "Coconut Macaroons"
    }, 
    {
        "text": [], 
        "dish_name": "Coconut Tuiles"
    }, 
    {
        "text": [], 
        "dish_name": "Diamond Cookies"
    }, 
    {
        "text": [], 
        "dish_name": "World Champion Cookies"
    }, 
    {
        "text": [], 
        "dish_name": "Vanilla Meringue"
    }, 
    {
        "text": [
            "having just spent a week at the bellagio, jean philippe became a breakfast/lunch/snack/late-snack/just because staple.\n\ni can't even believe how much food my fianc\\u00e9 and i ate from this place!\n\nturkey cr\\u00eapes \nnutella cr\\u00eapes\n<mark><mark>Coconut Chocolate Macaroons</mark></mark>\ngelato\nmadelines\n<mark>Chocolate Hazelnut Spread</mark>\ncheesecake\nnutella napoleon\nproscuitto, basil, mozarella panini (good served both hot and cold)\nturkey croissant sandwiches\nmeringues\nnutella brioche\ndulce de leche brioche\nplain croissants\nchocolate croissants\numm...  yeah\n\nkinda went a little overboard, but i have no guilt.  i agree that the service can be hit-or-miss but generally, we did pretty well. try to avoid ordering just before closing, or risk being crushed in the gate by the employees as they try to close for the night.", 
            "cute and whimsical, the jean phiippe patisserie is a great place to take a break for coffee, dessert, or gelato.  the praline truffle and the coconut truffle were phenomenal and worth the $2 a pop.  we also ate the hazelnut gelato and oreo gelato, both of which were pretty good.  we took home the <mark><mark>Coconut Chocolate Macaroons</mark></mark>, and these were mediocre and overpriced.  take my advice and skip the cookies and go straight to the chocolate and gelato.", 
            "this place by far had the most heavenly crepes i have ever eaten and they make it right in front of you! i love the chocolate fountain they displayed and this little gem was by far the best at our stay at the bellagio. 2nd best is their breakfast buffet lol\n\ni also had <mark><mark>Coconut Chocolate Macaroons</mark></mark> and madelines as gifts and the receivers said they were great as well!", 
            "this is definitely a place you must see if you come to vegas.  find their famous chocolate fountain at the bellagio.  who won't be intrigue by this beautiful tri-chocolate delicious dreamy goodness art.  even the chocolates are good here.  i got a tin set of the white, milk and dark chocolate,  and mocha coffee.  i bought the <mark>Silver Mint Candy</mark> almonds and chocolate <mark><mark>Coconut Chocolate Macaroons</mark></mark>, but did not care for it too much.  everything else is yummy good =d  this place does get busy so expect a line.  they have ice cream and crepes too, but i did not get a chance to try it.  maybe next time when i am in vegas.", 
            "delicious freakin' crepes.\n\ni don't think i need to say anything more but i will because i almost died when i had the crepes and gelato here. yes, it was pretty damn good.\n\nthis place is always packed but no kidding right? it's vegas and this one is located in the bellagio. perfect for me since we were staying at vdara and i literally just walk down a pathway then bam there it is!\n\nooh so many creations to choose from. it took me at least 5 minutes to finally decide and even then i was having second thoughts. everything just looked so tempting. i went with the exotic combo with mango, pineapple and coconut gelato. the crepe was airy and sweet while the mango and pineapple had a perfect tart taste. and the coconut gelato just brought everything together heavenly. every single bite was fantastic.\n\ni also bought some chocolate <mark><mark>Coconut Chocolate Macaroons</mark></mark> dipped in white chocolate. it was a nice treat to have back at the hotel.\n\nmy all time fave has always been pistachio gelato but coconut has made it to my top as well. definitely a must to visit when in vegas."
        ], 
        "dish_name": "Coconut Chocolate Macaroons"
    }, 
    {
        "text": [], 
        "dish_name": "Valencia Cookie"
    }, 
    {
        "text": [], 
        "dish_name": "Tuile Chocolate Hazelnut Pepito"
    }, 
    {
        "text": [], 
        "dish_name": "Sugar Cookie Box (3 Piece Cookies)"
    }, 
    {
        "text": [], 
        "dish_name": "Assorted Caramels"
    }, 
    {
        "text": [], 
        "dish_name": "Vanilla Nougat Bar"
    }, 
    {
        "text": [
            "had their savory crepes and opera cake! everything we had was fantastic. we also took a <mark>Vanilla <mark>Chocolate Nougat Bar</mark></mark> with us and it was heavenly!! best we've ever had!"
        ], 
        "dish_name": "Chocolate Nougat Bar"
    }, 
    {
        "text": [
            "this is definitely a place you must see if you come to vegas.  find their famous chocolate fountain at the bellagio.  who won't be intrigue by this beautiful tri-chocolate delicious dreamy goodness art.  even the chocolates are good here.  i got a tin set of the white, milk and dark chocolate,  and mocha coffee.  i bought the <mark>Silver Mint Candy</mark> almonds and chocolate <mark><mark>Coconut Chocolate Macaroons</mark></mark>, but did not care for it too much.  everything else is yummy good =d  this place does get busy so expect a line.  they have ice cream and crepes too, but i did not get a chance to try it.  maybe next time when i am in vegas."
        ], 
        "dish_name": "Silver Mint Candy"
    }, 
    {
        "text": [
            "go here, but not just for the most luscious looking chocolate fountain - that is the least impressive thing at jeane philipe.  i can say i am their number one fan and customer.  i go to vegas about 3-4 times a year, and i never leave without eating their delicious crepes and getting dozens of pastries.  my last splurge was a grand total of $350.  i can honestly say it was worth every penny.  okay, don't get scared - i bought a lot of pastries, chocolates, gifts, etc. just to give you an estimate - prices are on average $3.50 for pastries, $10.00 paninis, $12.00 for clear packaged goodies, $30-70 for the very elegant boxed chocolates. \n\nmy most favorite thing to eat at jp is their chocolate crepe. you can see it in my \"profile pic\" i hope. i love how delightful it is.  their whip cream is so light and refreshing.  they have this special <mark>Chocolate Sauce</mark> they put on top with pieces of brownie drizzled with some chocolate flakes. perfectionnn! they make the crepes right in front of you, which is kind of cool. \n\none of my other favorite items is their tuna panini.  i've never had a better sandwich.  their ciabatta bread is so fluffy inside and a little crispy outside.  make sure you get them to toast it. \n\nmy other favorites are their french macaroons, chocolate croissants (to die for), cheese danish and bear claw.  i've also picked up many of their boxed chocolates (<mark>Truffle Box</mark>, square box and <mark><mark>Mini Ballotin Box</mark></mark>) and different types of candies in clear containers (<mark>Butterfinger Sticks</mark>, caramelized peanuts, chocolate covered pretzels, florentins (my father's favorite), <mark>Peanut Brittle</mark>, and <mark>Almond Dragees</mark>, etc).  i've pretty much tried everything because i can't get enough of jp!\n\nthe last, but not least is their amazing display of cakes.  i'm posting a couple pictures so look for them! :)"
        ], 
        "dish_name": "Almond Dragees"
    }, 
    {
        "text": [], 
        "dish_name": "Chocolate Dragees"
    }, 
    {
        "text": [], 
        "dish_name": "Marshmallows"
    }, 
    {
        "text": [], 
        "dish_name": "Riverstones Dragees"
    }, 
    {
        "text": [], 
        "dish_name": "Chocodelices Dragees"
    }, 
    {
        "text": [], 
        "dish_name": "Orange/Lemon Slice Candies"
    }, 
    {
        "text": [], 
        "dish_name": "Raspberry Candies"
    }, 
    {
        "text": [], 
        "dish_name": "Mini Mint"
    }, 
    {
        "text": [], 
        "dish_name": "Lilliputians Candy"
    }, 
    {
        "text": [], 
        "dish_name": "Copper Basket"
    }, 
    {
        "text": [], 
        "dish_name": "Bronze Basket"
    }, 
    {
        "text": [], 
        "dish_name": "Silver Basket"
    }, 
    {
        "text": [], 
        "dish_name": "Gold Basket"
    }, 
    {
        "text": [
            "whenever my sister or i travel, we always try to bring back something edible for the other. i remember when i first received my small package of <mark>Peanut Brittle</mark> from jean philippe patisserie. i looked at the label, saw the price, scoffed and thought to myself, this better be some hella good <mark>Peanut Brittle</mark>. who the heck would pay $15 for <mark>Peanut Brittle</mark>?!?!?! uhhh yeah... apparently i would because i bought two packages of it on my first trip to vegas. i specifically sought out the place just for the brittle... but well, like all good places you end up buying way more than you anticipated. \n\nthis wonderful patisserie is tucked inside the bellagio hotel. although many people rave about the chocolate fountain, i didn't find it that spectacular. honestly, by the way people were describing it, i was expecting to see the type of fountain out of charlie and the chocolate factory. but the fountain is a nice addition to the place. they also have crepes, gelato, a beautiful assortment of pastries and desserts, chocolates, and drinks. i left with 2 chocolate brownies, 2 packages of <mark>Peanut Brittle</mark>, <mark>Vanilla Sugar</mark>, and a fruit tart. i had to stop myself at that, even though i didn't want to! it's like gambling, you have to know when to stop. so if you get a chance, check this place out. i've definitely found one of my favorite sins in sin city!"
        ], 
        "dish_name": "Vanilla Sugar"
    }, 
    {
        "text": [], 
        "dish_name": "Brown Sugar Sticks"
    }, 
    {
        "text": [
            "my husband and i stayed at the bellagio and every single morning for a 4 days i went down the jean philippe and picked up coffee and breakfast for us and we enjoyed our treats by the pool.   i fell in love with the sugar brioche.  i had it the 1st day i went there and every day since!!  my husband enjoyed the bfast sandwich type thing.  i think it was ham and something else but it was buttery and rich.  the iced <mark>Coffee (12oz)</mark> were fabulous.  on our last day i purchased chocolates to take home for presents.  i would come back here again just for the pastries.  \n\nsince i was going there super early in the morning, the lines weren't that long but there still was a crowd and for good reason.", 
            "i drew the short straw and had to go get coffee/breakfast early one morning for my husband and me while staying at the bellagio.  it was early and the hotel / casino was still quiet and i scrambled downstairs in sweats and a pony tail, figuring i wouldn't run in to many people.  that was until i got to jean philippe patisserie, where the well-formed line was already the center of activity in the hotel/casino that morning.  :)  i grabbed some <mark>Coffee (12oz)</mark> (they have soy milk - love that - thanks jp) and some muffins and croissants for my husband and some fresh fruit for me.  the muffins and croissants were way too much food for my husband, but there was no way i could limit the choices down for him -- everything looked amazing.  his favorite was the chocolate croissant.  \n\neven if you don't indulge, go there to check out their chocolate fountain (makes you think of willy wonka), cakes or other decorations.  it's a fun place to sit and people watch too.", 
            "even though i was super stuffed from dinner, we decided to head to bellagio to grab some desserts and to see the giant chocolate fountain. it's apparently it's the largest chocolate fountain and is even in the guiness book for world records. it goes from the ceiling to the ground, but it's made up of a bunch of small shelves and the chocolate travels in different paths. there's a dark chocolate path, milk chocolate, and white chocolate, and they intertwine kind of, but they never mix. i thought it was a cool design. it's pretty awesome, and people would just stop walking when they saw it and pulled out their cameras. it was fun people-watching here too. after looking around the shop for a bit, we decided to get a crepe and some cakes. my friend made a good decision and got an \"exotic\" crepe? or something like that... it was reallllly good. the top was warm mango in a mango syrup, and the ice cream was coconut. it was super super super good. inside i think she said was some kind of berry jam or something? i'm not really sure, but the crepe was delicious. the coconut ice cream was super coconuty and really really good. twas my favorite part. we also got two different types of cakes. the first one we got was called opera and it was like a 12-layer cake with all kinds of chocolate and coffee flavors. oh man, i cannot describe to you how delicious this cake was. it was so so so so so good. i even ate the gold on top. the dark chocolate on top was super rich, but the layers were so moist and flavorful. each layer was something new, so my mouth never got tired of eating it. the truffle on top was decent too, but the cake was the main attraction. so delicious. when i go back here, i'm going to have a hard time not ordering this again even though i want to try all the different cakes there. the last cake we got there, i can't remember what it was called, but it was chocolate mousse with hazelnut and banana flavors. the bottom actually seemed like it had very small pieces of banana in it. it was really good, a lot more refreshing than the chocolate one, a lot less rich, but still really really good. they used a carmelized banana on the top too. not sure how they made it red, we think maybe just like a red cocoa powder? all the desserts we got there were really good -- my goal is to come back here each time and try all the different cakes there, because there were just so many i wanted to try. they also have other things like $22 marshmallows and good looking <mark>Coffee (12oz)</mark> and chocolates. highly recommend eating dessert here. i can vouch for the crepes and the cakes being one of the best i've had.", 
            "we eaten here for many years and always say the same thing: the crepes are outstanding, the pastries and coffee is great, but why are the attitudes of the workers so poor? the answer is that they hate their jobs, having to stand there for 8 hours a day, taking orders from goofy tourists. we have been here no less than 30 times and always find the staff curt, unfriendly, and in some cases, rude.\n\nwe always order a couple of crepes, <mark>Coffee (12oz)</mark>, and pastries, and always know that the staff will be sullen, and inefficient. the crepes must be worth it for us to keep returning.", 
            "this cafe has a playful ambience and courteous staff. both the sweet treats and the <mark>Coffee (12oz)</mark> always delight! make sure and drop by to see the decorative displays as well as the chocolate fountains. you'll not be disappointed!", 
            "this little piece of heaven with its marvelous sweets is located inside the bellagio. their cakes are designed amazing. here you can watch the famous world's biggest chocolate fountain and eye the unique cake creations that jean philippe is famous for. it's definitely something to be seen. they also have a great selection of ice creams, waffles, pancakes, crepes and of course <mark>Coffee (12oz)</mark>. i am fond of their crepes. they are freshly made with good quality ingredients.  \neverything here , of course , is a little pricey, but don't forget- this is las vegas!!!!!!! \njust enjoy your time)))", 
            "we stopped by here for breakfast on our way to see the picasso gallery. they have so many delicious treats. unfortunately, since we were in a hurry we just grabbed ham and cheese croissants and <mark>Coffee (12oz)</mark>. it's a bit small inside, you have to go around people to get to the sugar and cream stand. take a look at all the pastries before ordering, the line covers some of the pastries and they take your order before you get all the way to the register, so you dont really get a chance to see everything they have. hopefully next time we can take a quick break and enjoy a delicious treat. :)"
        ], 
        "dish_name": "Coffee (12oz)"
    }, 
    {
        "text": [
            "yummy!  i love this place and can't stop thinking about it.  perfection in both the pastries and savoury foods.  \n\ncroissant and chocolate croissant - both very flaky and buttery.  the chocolate had great bittersweet chocolate nestled in the middle.  i think they were the best croissants i have ever eaten.  \n\nchicken cobb salad:  very fresh produce, shredded crisp lettuce, with perfectly poached chicken breast (very tender and moist).\n\nsables:  yummy buttery cookies that are mild in sweetness and have a sandy texture.  very addictive and roughly a dollar a piece.  they sell in packs of 10 and a tube of 20.  \n\nfruit salad - consisted of mixed berries, cantaloupe, <mark>Honey (8.5oz)</mark> and pineapple.  everything was sweet, fresh and neatly cubed (melons).  i was very content while eating this on the plane and had some jealous onlookers.  \n\nthe sandwiches looked very tasty too, but i was really craving a salad for lunch.  \n\nwarning: go early or they will sell out!!  i went back at 5 to pick up some dinner for the flight and boo, almost everything was gone."
        ], 
        "dish_name": "Honey (8.5oz)"
    }, 
    {
        "text": [], 
        "dish_name": "Artisan Jams (8oz)"
    }, 
    {
        "text": [], 
        "dish_name": "Caramel Cream"
    }, 
    {
        "text": [], 
        "dish_name": "Caramel Popcorn"
    }, 
    {
        "text": [
            "went with my bf, brother and his bf. late night- wanted to see if they had macaroons or get some pastries....no macaroons, pastries that were left didn't perk my interest (fruit tarts, eclair).\n\nbro and bf got gelatos and chocolates. took a bite of their pistachio- nice actually, robust pistachio flavor.\n\nwe got a crepe with just custard and chocolate and chocolates and a raspberry tart bf wanted to try as well. crepe was good, i like that the chocolate wasn't overtly sweet milk chocolate, more like a milk and dark cross, but i don't think it was priced right for what it is. i spend a lot on desserts, but it's just a crepe. chocolates good, i liked the coconut which i normally don't but it was subtle. tart- alright, there was a pistachio like cream on the bottom and it was nice, but the tart itself was kinda hard, berries were fresh and sweet. \n\ngot teas to compliment.- a-ok- just got standard greens, but were all premium tea drinkers and it doesnt wow like some of the selection at home (no ready made <mark>Assorted Tea Bags</mark>, fine tea leaves).\n\nthey were yummy, but not like omg imma effing die this soo goood.  it was satisfying enough to curb our after dinner sweet toofs. \n\none big shtick i got about this place is that its circular layout makes it eye pleasing but it makes it a clusterfuck when it's busy. people just don't know where to go, they cut cuz they don't get if there's a line. also since we were getting stuff from all their stations it was frustrating- the chocolate lady told us to order crepes from the crepes, and go to coffee to get our drinks, etc.....wth?! can't you ring up and charge us and ticket them our order to make?! i dont think she knew really what theyre doing....surely you dont have to line up 4 times, but whatever we just figured it's easier to split up and not confuse that lady even more.  yeah, we 4 split up and lined up in each area. bf went to gelato, i got the crepe, brother got the chocolates and bf got teas. crepe customers vicious, i had to tell someone to step off their order because they helped themselves to the front of the line. \n\nmaybe i'll try it again if i'm here or aria when it's not busy, but by all means i will walk by and forget it if it's a busy cluster. desserts good but not worth having to tagteam to hit all the stations again."
        ], 
        "dish_name": "Assorted Tea Bags"
    }, 
    {
        "text": [], 
        "dish_name": "Coffee Mug"
    }
]