[
    {
        "text": [], 
        "dish_name": "Cheese Grits"
    }, 
    {
        "text": [], 
        "dish_name": "Scrambled Eggs with Spinach & Mushroom"
    }, 
    {
        "text": [], 
        "dish_name": "Orange Segments"
    }, 
    {
        "text": [], 
        "dish_name": "Dried Cereals"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Potato Pancakes"
    }, 
    {
        "text": [
            "nothing terribly memorable about this place. i'll admit that i wasn't as hungry as i should have been, and was kinda sorta recovering from a blackout the night before...so take the rating with a grain of salt, i suppose ^_^.\n\ni got the breakfast buffet for about $15, which seems pretty standard for vegas. nothing really special about the buffet that i can remember, except that they had pizza, which made me really excited in the morning. everything else was just your standard eggs, not-so-fresh <mark>Applewood-Smoked Bacon and Sausage</mark>, hash browns, etc. i made it 3/4 through a plate before i grossed myself out, and i didn't get near my money's worth. \n\nbut the service was great! my waitress gave me two big glasses of oj so i didn't have to ask for another later hehe...very considerate. \n\nso yeah, if you're staying at the planet hollywood, it doesn't hurt to grab breakfast here. but i'd vie for breakfast over at le village buffet in paris instead *wink wink*", 
            "this is my first vegas buffet, how exciting! \nwent to the breakfast buffet this past sunday, and i was surprised to see that there was no line! i had seen other buffet lines in vegas, and they're frightening. \nselection was pretty good, there was fruit smoothies, <mark>Stewed Prunes & Fresh Assorted Fruits</mark>, belgian waffles, corned beef, pastries, bacon, crepes, toast, bagels, omelettes, eggs, <mark>Applewood-Smoked Bacon and Sausage</mark>. \ncost was great. at $14.99, i found it to be a  complete bargain. \nminus one star though, because some of the food was kind of cold and unappetizing.", 
            "we use the spice market buffet sometimes for breakfast as we stay right across the street. on this occasion we were using the buffet of buffets pass and i didn't look to see how much monday morning breakfast was, but what we like about planet hollywood's buffet is they have a nice breakfast selection.  i was on some crazy fresh fruit tear that morning, so i got lots of yummy fruit from berries to pineapple to cantaloupe.  i also dug into the oatmeal and there were all kinds of great toppings: craisins, almonds, granola, etc.  my husband had an egg mcmuffin on cheddar cheese steroids and said it was awesome.  and of course, we munched through the usual eggs <mark>Applewood-Smoked Bacon and Sausage</mark> and bacon items.  they have a nice bread bar with <mark>French Toast</mark>, pancakes, and waffles with a selection of syrup and toppings as well as donuts.  i passed on my usual biscuits and gravy, but it was there and so were bagels with toppings like lox, tomatoes, <mark>Bagels & Cream Cheese</mark>, etc. and a toast selection.  in other words, great breakfast selections.  \n\ngood food and good service.  i like that the bathroom is at the same location so you don't have to go traipsing all over the casino to find it.  we like it.  we'll probably be back.\n\ni did have one previous experience there at dinner and on that occasion the food was okay, but it didn't give me an urge to return for dinner.", 
            "arrived early on a sunday night.  there was hardly anyone in front of us in line, yet it took forever.  still don't get it, as it took us very little time to pay when we got up there.  (yes, added a tip).  then it took somewhat forever again before someone seated us.  \n\ntook off for the buffet, and was seriously unimpressed!  favorite part for me (the only part) was the italian section. meatballs <mark>Applewood-Smoked Bacon and Sausage</mark> were good.  liked that they had crushed red pepper to kick things up. broccolini good.  after that i had a hard time finding anything that looked edible.  even the seafood section was only so-appealing.  had a couple crab legs (ice cold) and okay.  the other fish selections didn't make me want them.\n\nhusband was raving over a pork taco in the mexican section.  they were out of them when i went up there.  later found one and it was okay.  nobody working there seemed glad to be there (especially the folks replenishing the food).  \n\nkinda sad that i wasted my limited vegas time and money here, honestly.", 
            "i'm allergic to eggs and found plenty to eat here! breakfast out is hard on those allergic to eggs and i didn't want to waste money on a buffet to eat toast <mark>Applewood-Smoked Bacon and Sausage</mark>. my husband had gone to planet dailies and spent something crazy like $30  so after that everyone in our party went to the buffet. on the last day i joined them and i am glad i did.  it was about $20 and everything was very good. huge selection and lots of options for vegetarians too."
        ], 
        "dish_name": "Applewood-Smoked Bacon"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Turkey Hash"
    }, 
    {
        "text": [], 
        "dish_name": "Egg Beaters"
    }, 
    {
        "text": [], 
        "dish_name": "Egg Whites"
    }, 
    {
        "text": [
            "that'd be an ick for the food and a yay for our waitress.\n\nthe food was super disappointing. we went in thinking we'd have a good breakfast, lots of options to choose from, and leave feeling happy and full. \n\ninstead, the food was marginal, overcooked and dry. there really wasn't much variety, which was sad, considering they have so many stations promising things like \"asian\" or \"mexican\" or \"italian\". it was pretty much the same thing at each stop, with a few variations.\n\non my first pass - still nursing some high hopes - i grabbed an andouille sausage corn cake, a <mark>Breakfast Quiche</mark>, a scoop of hash browns, an egg benedict half and some <mark>Scrambled Eggs</mark>.\n\nthe corn cake was hard and dry, and if there was andouille sausage in there, it was hiding from me. the <mark>Breakfast Quiche</mark> was so dry i couldn't even swallow the tiny bite i took. it was seriously like the sahara desert inside that thing. the egg benedict was - predictably - overcooked, though that's on me for grabbing an egg benedict from a steam table. if the egg was poached when it was set out, all that time above the steam and under the lights just kept right on cooking it.\n\nthe eggs and the hash browns were the best things i had that day. both were buttery and tasty, without being too greasy. score.\n\nmy second pass - hopes understandably diminished, but wanting to get the most out of the buffet prices - was forgettable. i tried some saut\\u00e9ed fruits (peaches and apples), as well as a scoop of cheesy grits and one of the pastries from the sad dessert station, but nothing blew me away.\n\nthe best thing about the morning was our waitress, nina. she had the best personality! she joked with us, made us girls feel special, and made sure to get us what we were asking for. she then made my husband and i feel super special for having participated in the half marathon the day before, even though we weren't feeling extra special at that point. \n\ni wish everybody had a good, friendly, open attitude like nina did. she's definitely the best thing we experienced at spice market, and i hope they appreciate her there!"
        ], 
        "dish_name": "Breakfast Quiche"
    }, 
    {
        "text": [], 
        "dish_name": "Smoked Kielbasa Sausage"
    }, 
    {
        "text": [
            "this place was great for me and my husband--hard to achieve as i am a no-meat, no-fish vegetarian and he eats nothing but meat and fish... he liked the dressing-stuffed pork loin <mark>Chicken and Turkey</mark> with cranberries and apples, and the creme caramel...i liked the moroccan stew, the garlic mashed potatoes, the mac and cheese, the dried fruits, the cheeses, the veggie skewers, the cotton candy, and the chocolate mousse tarts. it's about $20 per person and well worth it!", 
            "this buffet is located in the planet hollywood casino, i think if i was a kid i would def love to eat at this buffet, they have cotton candy and a good variety of desserts/cupcakes as well.  please remember to show your total rewards card since they do have a discount for cardholders.\n\ni tried the dinner buffet here on a saturday, the wait time was about 10 minutes, which was surprising, the food selection and variety here was outstanding in my opinion, they have about six or more sections of food (seafood, mexican, middle eastern, asian, italian, and american)\n\nthe middle eastern and american sections of food were the favorites for this trip.  the shrimp, lamb, crab legs, and dessert selections were very good as well.  there is also a prime rib <mark>Chicken and Turkey</mark> carving station, the mashed potatoes were very good. the service was great, our server checked on us numerous times to fill drinks and remove our plates when we were finished.  i'm sure this varies depending on what time or day you visit, i've some to expect most buffets in vegas can be hit or miss on service, etc so don't hold it against the employees since they are trying their best to keep up.  i will definitely have to try this buffet again on my next trip to vegas.", 
            "i wasn't sure what to expect from this buffet, we got a deal from groupon, so while on vacation, groupon was our best friend!\n\nspice market is located in planet hollywood, and is downstairs of the casino. there was a decent spread, and the middle eastern section was by far my favorite. there was an asian section, an american section, a south american section, and the mid-eastern section. the asian section offered spring rolls and noodles, american offered sliders, a roast <mark>Chicken and Turkey</mark>, the south american had some hispanic dishes with rice and tortillas, but my fave was the curried lamb, couscous, and na'an bread. honestly, i don't know if i'd have chosen this buffet if it weren't for the groupon. \n\nour groupon included all-you can drink wine or beer, so that was also a bonus. definitely a nice buffet if you are feeling adventurous.", 
            "in planet hollywood an academy award scene is enjoying the spice market buffet. they say that variety is the spice of life. and the spice market buffet is a culinary walk of fame with cuisine stars represented in nine food stations: seafood, two salad bars, soup, dessert, mid eastern, italian, american, asian, and mexican.\n\n  asian foods:  the foods represented included spicy drunken noodles, kung pae chicken, miso soup, honey nut chicken, tilapia, fried rice,  and spring rolls. i really enjoyed the spicy drunken noodles and miso soup. the spicy drunken noodles remind me of chow fun. the miso soup was tasty and served in larger bowls than at courtyard buffet. i would of appreciated it if they had wonton soup. it seems that that cravings buffet is the only buffet on the strip serving wonton soup. \n\n soup: i was filling up on soup. so i passed over the chicken noodle and tortilla soup. \n\nmexican: there was a decent selection of mexican food. the foods represented included mexican corn, spanish rice, charro beans, chile cheese, quesadilla, grilled chicken, and fajitas. \n\namerican : this station seemed to have the longest line. this makes sense because it appeared to be the only live station. they cooked turkey and prime rib that the chefs cut and placed on your plate. near the meat was rice pilaf, ribs, mash potatoes, and bbq spice chicken. the asian and seafood stations were filling me up and i passed over the fresh cut prime rib <mark>Chicken and Turkey</mark>. \n\nseafood: this is the spice market buffet station that is worthy of an oscar. there was far more seafood than the so-called station buffets that double the price and make a steak and shrimp gimmick on a popular night that people go out. this got the most action on my plate. the seafood represented included sushi, seafood paella, shrimp scampi pasta, stuffed sole, snow crabs, cajun crawfish pasta, and peel eat shrimp. this seafood station is my minimal expectation of a seafood buffet. \n\nmid eastern: the neat thing about buffets is they bring out the adventurous eater. what is the worst thing that could happen if you try something and you dislike it? i was adventurous when i went to the mid eastern station. what should i try? there was chicken curry, couscous salad, lamb, taboull,  hummus, and kabobs. i'd try the couscous salad and hummus. i'm glad i got to try it because now i know that i don't care for mid eastern food. \n\nitalian food: if there was eggplant parmesain or veal parmesain, i would of filled up less in the seafood station. i was not crazy over the selection. they had pizza, pasta, meatballs, and some other food. \n\nreport of my 11/01/2015 visit:\n\n   if you sign up for a harrah's credit card, they reward you with two complimentary buffets. my brother took advantage of this deal. he invited me along for the zero cents buffet. around 5 pm on a sunday we met up there. we saved over $29 each. and we saved on time.  there was no line. and there was zero waiting on the server to ask you what to drink. upon paying for the buffet, you order the beverage that the server brings to the table. in lieu of waiting for the server, i made a beeline for the food stations. i'd mostly full up on asian foods and seafood to the point that i passed over dessert. throughout the dinner, the server occasionally checked up on us and never rushed us. \n\n   the spice market buffet was an academy award winning scene in the basement of planet hollywood. however it falls short of being an academy award buffet. in my opinion it falls in the middle of las vegas strip buffets. in yelp ratings, the middle is 3 stars."
        ], 
        "dish_name": "Chicken and Turkey"
    }, 
    {
        "text": [], 
        "dish_name": "Sausage Patties"
    }, 
    {
        "text": [
            "as usual we had our family thanksgiving meal at a buffet at thanksgiving. there was really nothing that made this particular one stand out past the other buffets i've had on the las vegas strip. at least the line for thanksgiving wasn't as bad as other hotels. the food was less the stellar. yeah, the turkey (along <mark>Buttermilk Biscuits with Country Gravy</mark> and stuff) tasted good along with the prime rib (although it was a little bit dry), the other stuff they offered tasted like it's been sitting out there in the open for a couple of hours and tasted like it too. the made-to-order crepes was cool although the chef really liked putting a ton of butter to make it."
        ], 
        "dish_name": "Buttermilk Biscuits with Country Gravy"
    }, 
    {
        "text": [
            "nothing terribly memorable about this place. i'll admit that i wasn't as hungry as i should have been, and was kinda sorta recovering from a blackout the night before...so take the rating with a grain of salt, i suppose ^_^.\n\ni got the breakfast buffet for about $15, which seems pretty standard for vegas. nothing really special about the buffet that i can remember, except that they had pizza, which made me really excited in the morning. everything else was just your standard eggs, not-so-fresh <mark>Applewood-Smoked Bacon and Sausage</mark>, hash browns, etc. i made it 3/4 through a plate before i grossed myself out, and i didn't get near my money's worth. \n\nbut the service was great! my waitress gave me two big glasses of oj so i didn't have to ask for another later hehe...very considerate. \n\nso yeah, if you're staying at the planet hollywood, it doesn't hurt to grab breakfast here. but i'd vie for breakfast over at le village buffet in paris instead *wink wink*", 
            "this is my first vegas buffet, how exciting! \nwent to the breakfast buffet this past sunday, and i was surprised to see that there was no line! i had seen other buffet lines in vegas, and they're frightening. \nselection was pretty good, there was fruit smoothies, <mark>Stewed Prunes & Fresh Assorted Fruits</mark>, belgian waffles, corned beef, pastries, bacon, crepes, toast, bagels, omelettes, eggs, <mark>Applewood-Smoked Bacon and Sausage</mark>. \ncost was great. at $14.99, i found it to be a  complete bargain. \nminus one star though, because some of the food was kind of cold and unappetizing.", 
            "we use the spice market buffet sometimes for breakfast as we stay right across the street. on this occasion we were using the buffet of buffets pass and i didn't look to see how much monday morning breakfast was, but what we like about planet hollywood's buffet is they have a nice breakfast selection.  i was on some crazy fresh fruit tear that morning, so i got lots of yummy fruit from berries to pineapple to cantaloupe.  i also dug into the oatmeal and there were all kinds of great toppings: craisins, almonds, granola, etc.  my husband had an egg mcmuffin on cheddar cheese steroids and said it was awesome.  and of course, we munched through the usual eggs <mark>Applewood-Smoked Bacon and Sausage</mark> and bacon items.  they have a nice bread bar with <mark>French Toast</mark>, pancakes, and waffles with a selection of syrup and toppings as well as donuts.  i passed on my usual biscuits and gravy, but it was there and so were bagels with toppings like lox, tomatoes, <mark>Bagels & Cream Cheese</mark>, etc. and a toast selection.  in other words, great breakfast selections.  \n\ngood food and good service.  i like that the bathroom is at the same location so you don't have to go traipsing all over the casino to find it.  we like it.  we'll probably be back.\n\ni did have one previous experience there at dinner and on that occasion the food was okay, but it didn't give me an urge to return for dinner.", 
            "arrived early on a sunday night.  there was hardly anyone in front of us in line, yet it took forever.  still don't get it, as it took us very little time to pay when we got up there.  (yes, added a tip).  then it took somewhat forever again before someone seated us.  \n\ntook off for the buffet, and was seriously unimpressed!  favorite part for me (the only part) was the italian section. meatballs <mark>Applewood-Smoked Bacon and Sausage</mark> were good.  liked that they had crushed red pepper to kick things up. broccolini good.  after that i had a hard time finding anything that looked edible.  even the seafood section was only so-appealing.  had a couple crab legs (ice cold) and okay.  the other fish selections didn't make me want them.\n\nhusband was raving over a pork taco in the mexican section.  they were out of them when i went up there.  later found one and it was okay.  nobody working there seemed glad to be there (especially the folks replenishing the food).  \n\nkinda sad that i wasted my limited vegas time and money here, honestly.", 
            "i'm allergic to eggs and found plenty to eat here! breakfast out is hard on those allergic to eggs and i didn't want to waste money on a buffet to eat toast <mark>Applewood-Smoked Bacon and Sausage</mark>. my husband had gone to planet dailies and spent something crazy like $30  so after that everyone in our party went to the buffet. on the last day i joined them and i am glad i did.  it was about $20 and everything was very good. huge selection and lots of options for vegetarians too."
        ], 
        "dish_name": "Applewood-Smoked Bacon and Sausage"
    }, 
    {
        "text": [], 
        "dish_name": "Hashbrowns"
    }, 
    {
        "text": [
            "while staying at the aladdin/planet hollywood i read in reviews that this buffet was at least top10 in vegas. so i had to check it out..not to mention it was easy to get to.  i had breakfast there friday morning, and dinner there saturday night.\n   price: breakfast $15 per person, dinner $25 per person. not on the cheap side, but still fair. especially for the quality of food.\n  wait:  breakfast we showed up at 10:00 am, 2-3 people ahead of us in line, quickly seated.  dinner, about 6 people ahead of us, the cashier took no time to get to, but getting a table for 6 took a little while, and was slightly annoying (probably about 10-15 mins)....probably would've been easier if there wasn't some wedding banquet going on on the other side of the restaurant. we ended up doing the..lets' just stand next to the table of 6 grannies not eating and chatting..and talk real loud about how hungry we are and how we wish we had  a table that could hold six people..i think they got the hint and left quickly.  \n\nfood quality - breakfast was good with many options, the omlet station line was a little long so i passed on it. but everything else was good..besides...how bad does a buffet got to be to screw up <mark>Scrambled Eggs</mark>, sausage, hash browns, chicken fried steak? \ndinner - was awesome. the different stations for different cuisine was good too.  the middle east kabobs were very good..i liked the lamb a lot, but the chicken was kind've weird (marinated in chasu sauce which is chinese and reserved for pork).  mexican looked like your standard taco bar...i passed. the roast beef was very good, potato bar had some nice options. asian cuisine had terrible egg rolls (as expected), but the tempura shrimp was good (too bad no dipping sauce). the quality of sushi was very good though..so i grabbed a lot..(*tip*..eat the raw fish as sashimi only..screw the rice)..salmon, tuna, eel...wanna-be sushi conossiuers would you prefer me to use the japanese names?!?  okay fine...meji, sake, and unagi. i took 4 years of japanese but it's horrible..hahah..\n  anyway, the italian station was very good as well...as they had a variety of different pastas..the lobster pasta was quite tasty, and the cheese raviolis as well..the pizza looked good too, but i passed as..i did not spend $25 to eat pizza. lastly the seafood..which mainly composed of oysters and alaskan king crab was good..i did not try the oysters (i try only to eat premium oysters for fear of food poisoning)...but the alaskan king crab legs were great and plentiful..of course a line for that, but not too bad...once you got past the little old ladies who always stakced 20 legs on their plate...just do your part as well. the soups were good as well...i had a creamy tomato basil soup..nice.\n  \nservice - we were never left with empty glasses, plates cleared quickly. it was sad to see one server clear a table for six people all by herself. we left her a good tip, she was a friendly server and  a hard worker.  and was very on top of always keeping our drinks filled.\n\noverall -  i highly recommend spice market buffer, the prices are fair, the food quality is very good, and the amount of variety is good as well. i'll be there for lunch next time in vegas as i was craving some clam chowder i saw being prepared for lunch while i was there for breakfast.\n~g", 
            "the signs say it's the best buffet in vegas, but my girlfriend and i weren't overwhelmed by the two breakfasts we had at the spice market. the food and service were alright, nothing more (the <mark>Scrambled Eggs</mark> were runny, for example). it helped that we received a $5 off coupon upon check-in at planet hollywood (coupons are also available online). it is a cute touch to have framed posters from movies involving food all around.", 
            "you just have to go to a buffet when you're in vegas right? it's like a right of passage along with drinking all day long and partying all night long. essentially chose this one because it was conveniently located where we were staying = lazy hungry girls go to the closest place. \n\nwhat you ought to do is snag some 10% coupons they hand out for this place. it's not exactly super cheap but i think the whole \"all-you-can-eat\" aspect and the large amount of choices make it a solid choice. we actually made it our one of two meals that day so it averages out in terms of price. \n\non to the food. they have a kind of \"world\" theme going with selections from \"italy\" \"asia\" \"middle east\" and \"mexico\" along with standard seafood and american stuff. clearly it's  nothing super authentic  but you have a lot of options. desserts are really diverse from tarts to soft serve to cotton candy (probably a huge hit with kids)!\n\nmy favorites: shrimp cocktail, mashed potatoes, all the fruit (very fresh), bacon, lobster pasta, crab salad,  bbq pork buns, and the prime rib. things that were not so good: the guacamole was pretty gross. it was brownish and way too lemon-y tasting and actually most things from the mexican area were just not good at all. <mark>Scrambled Eggs</mark> were a little runny that day and i think the pizza tastes like something from an elementary school cafeteria. of course this is all my opinion, i certainly didn't try everything (though i put in a good effort) and they have a lot of variety that is sure to please every palate. i think i was most impressed with the middle eastern section which was surprisingly good and certainly unusual at a buffet. \"italian\" stuff is mostly pasta and pizza, don't expect anything fancy. \n\nyou will stuff your face here and they are pretty nice about letting you hang around for a couple of hours while you eat, rest, and then eat some more. waiters bring you drinks and overall it's an ok place to linger if a bit cold (bring something if you plan on having a 4 hour feast as i got pretty cold).", 
            "have you guys heard?  the harrah's group is now offering $39.99 (for total reward members) $45.99 (for non-members) with 24hr buffet pass!  that means you can go as many time as you want within 24 hours!  what an awesome deal!  now that harrah's has dominated the strip with at least 8 casinos surely you will find a location that has your dishes in their buffet line!\n\nnow that was not a plug for harrah's in fact... they probably hate me for sharing such great news to everyone!  if you do the math, each of the buffets on the strip now cost at least $15.99 even breakfast... now throw in already expensive buffets such as the le village buffet at paris, rio buffet, and here, spice market.... you are pretty much getting each buffet below the $15 threshold... isn't that terrific money saved for the slots? \n\nok ok, i'll stop the sidetracking and stay on course.....(no wonder my reviews are so annoying long?  lol!)\n\nspice market buffet is located in planet hollywood.  (by the way, unless you know planet hollywood's location or have seen the sign from far away, you wouldn't know if you stand in front of it.  they don't have any signs showing that is planet hollywood except with \"miracle mile mall\" and \"casino\" posted above their entry way...(my buddy was confused on where he was at but i was able to guide him thru)\n\nonce entered, you get into a line so that you can then be prompted to get into the \"real\" buffet line downstairs.  the spice market buffet used to be arabian themed but since the take over of hollywood you will now see posters of movies hanging on the walls.  not as nice as before as they are trying to be more sophisticated.\n\nfood here really is pretty good.  to me, it's one of the much better ones located in the central strip area.  they had salads, mexican, asian, seafood, mediterranean, italian, and a nice dessert section.  \n\nmy highlights were the following...  lamb kabobs... fresh off the grill dipped in tzatziki sauce.... wonderful pairing as the kabobs were slightly salty which balanced out perfectly with light yogurt/cucumber sauce.  very refreshing!  however, i'm not a big fan of these grill meats because they tend to be a bit dry compared to the likes of other kabobs (such as satay or izakaya), but my buddy thought it was one of the better ones he's had so i'd take his word for it.  it is very flavorful though.\ngot some prime rib <mark><mark>Scrambled Eggs</mark> with Spinach & Mushroom</mark> rougut... man... did i ever tell you how much i love mushrooms?  it had the best firm texture these mushrooms which i was so addicted to.  pairing with a tender prime rib is definitely out of this world.. (i then went back and got a bowl of mushroom only!  please do not miss the mushrooms if you ever go here!  you will thank me for this!)  \n\nhad some salads as i needed to increase my veggie intake, and overall veggies were veggies... nothing special to discuss here but they are fresh!  had it with thousand island dressing which is always yummy!\n\nnow onto the main portion.. seafood... \n\nfried sole was absolutely jammin!  imagine actual fish n chip except the fish is definitely not over battered, and the meat if full and juicy!  if you get a plate of say 6 pieces with some fries, you got your $11 worth already!  they did a great job with their fried fish!\nmy buddy had the buffalo popcorn shrimp as i missed out on it.  he really enjoyed the kick that is added to the crunchiness which is a good pairing.  very inventive for a buffet as you usually only see straight up deep fried shrimp.\n\nnow onto my favorite dish of them all, a wrapped filet of sole wrapped around crab filling.  for those frequent readers of my reviews, do you remember my experience at le village buffet in paris and the rose filet of sole?  remember how much i loved that?  well.... this just topped that because it's near identical except now it's got crab fillings... it's like eating a rose of sole ravioli, then once you bite into it you've just entered the crab cake dimension... omg delicious!!!  \n\nnow you see why i didn't get to more items?  i got stuck on the sole and never turned back.........  \n\ni did have a little bit of dessert though... fresh strawberry tart, tiramisu (not what i've had in the past which was the only disappointment), and a really cool cotton candy station where everyone can take a cotton candy to go!!!  kids absolutely love it!\n\nso if you are in vegas, i strongly recommend you get the 24hr pass (so you have access to the buffet anytime your heart desires / also save money), and visit the spice market buffet.  one great tip... if you want to visit the paris buffet, anticipate a nice long wait or you must go early.  if you just simply walk over next door to spice market in ph, you will notice that the line is half of the size and also the service is much more faster because paris moves at the speed of a snail.....  you are in vegas and every second matters as all the fun and excitement are calling your at all times... make a smart choice!", 
            "okay take this review with a grain of salt because i was really hungover and couldnt eat very much i still managed a huge plate of breakfast food and a small plate of lunch food. we got their at 11 so go to enjoy both. my girlfriend was less hungover and absolutely loved it. \n\nthe <mark>Scrambled Eggs</mark> were terrible and the only thing i didnt like, i shoulda waited in the omlette line cuz of course that woulda been fresh and delicious. everything else was good. the little tater tot breakfast things were so good, same witht the bacon, and seafood at lunch.\n\nwe used two 5/off coupons and they accepted both of them making our total less than 25 bucks for the two of us. it was a great value. wish i could have ate more.", 
            "decent breakfast buffet, everything was different and tasty. i especially loved \"the egg guy\". eggs cooked to the way i want them, instead of funny <mark>Scrambled Eggs</mark> that are served at almost every other breakfast buffet.", 
            "this is the 2nd buffet that i tried with david g, sarah a and minh d when we did the buffet of buffets.  located in planet hollywood, this was yet another impressive selection of food!\n\nin my food haze, this is what i remember:\n\nsalad area:\nlettuce\ncreamy salads\ngrilled veggies\nsalad veggies\nfruit\na ton of different rolls\n\nmexican area:\nquesadillas\ntortillas\ntaco filling\nbeans\nguacamole\nsalsas, cheese, sour cream\nmexican omelette\nchips \n\nbreakfast area:\n<mark>Scrambled Eggs</mark>\nbacon\nbreakfast potatoes\n2 diff kinds of benedict\n<mark>French Toast</mark>\npancakes\nwaffles\nmade to order omelettes\n\nmiddle eastern area:\ntandoori chicken breast\ngrilled veggie skewers\nbaba ghanoush\n\nitalian area:\npizza\nmeat lasagna rolls\ngrilled veggies\npastas\ngarlic breadsticks\n\nmediterranean area:\nprime rib w/jus and horseradish\nmashed potatoes\nsteamed veggies\nstuffed pork loin w/apples\n\nseafood area:\nstuffed sole\npaella\nshrimp cocktail\nsushi\nlox\n\nasian area:\ndim sum\nchinese food\neggrolls\n\ndessert area:\nmake your own crepes\nchocolate & vanilla mousse in chocolate shells\nfruit tarts\ncheesecake\nflan\ncotton candy\ncookies\npeach cobbler\nbread pudding\ncakes\nbanana cream pie\nfruit pies\ncookies\nself serve chocolate & vanilla frozen custard with cones and toppings\ndanish assortment\n\ni likely missed some things, so you'll have to go check it out yourself.\n\noof.....i need to lie down now.....", 
            "went here for brunch with a group of people on a saturday. there wasn't a long wait at all so we sat down pretty quick. for $20, i guess you get what you pay for; especially since that's cheap for vegas. i honestly can't tell you what i liked the most because the food there was sub par. all of their \"international stations\" were really sad looking. they had cold grilled veggies in the \"salad\" station which was deceiving. grilled is suppose to be hot not cold. seafood station was also upsetting. no crab legs!!! really, what vegas buffet does not have crab legs? moving onto the \"italian station\" - also very upsetting. they didn't even have a basic spaghetti with meatsauce/marinara/alfredo. it was pizza and breadsticks with some type of nasty looking pasta, and grilled \"hot\" veggies. oh and they had <mark>Scrambled Eggs</mark> at the italian stations, weird?! next up was the breakfast/dinner/mixed with everything station. i wanted a small piece of prime rib, asked for med well, and got rare!! ugh, i hated wasting food. it's very upsetting when you go to a buffet, and when the waiter takes your plate, all the food is still left on there. now that's when you know that the food was not good. \n\nsighs, i would have rather spent that $20 at the feast buffet at sunset station. at least their food was good.", 
            "went here for lunch. line wasn't too bad. the seating area is very spacious and each cuisine is separated into different areas. the mideastern food was delicious, very fresh. the american area had <mark>Scrambled Eggs</mark> which were great and bacon and <mark>Traditional Eggs Benedict</mark>. asian section wasn't the best and while there was a mexican section, i didn't eat the food because it was mainly beans, rice and fajitas.  dessert bar was good- freshly made and laid out nicely. also a great assortment of danishes and pastries.", 
            "one of my top choices for buffets in las vegas - and i have tried almost all of them. spice market buffet offers a great variety of great tasting food for breakfast, lunch and dinner. if you want to save some money print out the $5 coupon from http://www.destinationcoupons.com/nevada/las_vegas/spice-market-buffet/spice-market-buffet-coupons.asp - i've used it on several occasions and it's always worked. make sure to show your total rewards card if you joined the casino to save even more. \n\nat breakfast they have traditional favorites like pancakes, waffles, <mark>French Toast</mark>, <mark>Scrambled Eggs</mark>, salmon and lox with bagels, oatmeal and fruit, etc. some nice additions are <mark>Traditional Eggs Benedict</mark> - you won't find this at every buffet breakfast, and an omelet station. for lunch/dinner they have prime rib, turkey, salads, mexican food, mediterranean food, seafood including crab legs, paella and cocktail shrimp, asian cuisine, and italian including pastas and fresh from the oven pizzas. and of course they have desserts - notably, made to order crepes, cotton candy and soft serve custard. \n\ni think this buffet is a good buy for your money - there aren't a lot of \"exotic\" foods that you would find at buffets like the wynn or caesars - however, the selection is delicious and you can't go wrong.", 
            "staying at the elara time share, i wanted to try a buffet but was lazy, so i just headed for planet hollywood and walked through the miracle mile shops.  upon entering the casino, i looked for the buffet, which was sort of hidden.  \n\nit was late dinnertime so there weren't a lot of people but they still had a ton of food.  i immediately went to town and grabbed the \"exotic\" dishes like kabobs, lambs, etc. and then noticed that you can make your own burger, so i proceeded to request two medium well's <mark>Scrambled Eggs with Ham & Cheese</mark>.  \n\ni must have eaten around like 4 or 5 platefuls then it was time for dessert.  they had like a cupcake bar.  tons of cupcakes, and i tried maybe 6 of them.  \n\ni recommend this place only if you are nearby and if you're lazy.  otherwise i should have just gone out and ate somewhere else.", 
            "that'd be an ick for the food and a yay for our waitress.\n\nthe food was super disappointing. we went in thinking we'd have a good breakfast, lots of options to choose from, and leave feeling happy and full. \n\ninstead, the food was marginal, overcooked and dry. there really wasn't much variety, which was sad, considering they have so many stations promising things like \"asian\" or \"mexican\" or \"italian\". it was pretty much the same thing at each stop, with a few variations.\n\non my first pass - still nursing some high hopes - i grabbed an andouille sausage corn cake, a <mark>Breakfast Quiche</mark>, a scoop of hash browns, an egg benedict half and some <mark>Scrambled Eggs</mark>.\n\nthe corn cake was hard and dry, and if there was andouille sausage in there, it was hiding from me. the <mark>Breakfast Quiche</mark> was so dry i couldn't even swallow the tiny bite i took. it was seriously like the sahara desert inside that thing. the egg benedict was - predictably - overcooked, though that's on me for grabbing an egg benedict from a steam table. if the egg was poached when it was set out, all that time above the steam and under the lights just kept right on cooking it.\n\nthe eggs and the hash browns were the best things i had that day. both were buttery and tasty, without being too greasy. score.\n\nmy second pass - hopes understandably diminished, but wanting to get the most out of the buffet prices - was forgettable. i tried some saut\\u00e9ed fruits (peaches and apples), as well as a scoop of cheesy grits and one of the pastries from the sad dessert station, but nothing blew me away.\n\nthe best thing about the morning was our waitress, nina. she had the best personality! she joked with us, made us girls feel special, and made sure to get us what we were asking for. she then made my husband and i feel super special for having participated in the half marathon the day before, even though we weren't feeling extra special at that point. \n\ni wish everybody had a good, friendly, open attitude like nina did. she's definitely the best thing we experienced at spice market, and i hope they appreciate her there!", 
            "amazing breakfast! i had <mark>Scrambled Eggs</mark>, flank steak, smoked salmon, and so many fruit smoothies i can't even remember. great breakfast experience."
        ], 
        "dish_name": "Scrambled Eggs"
    }, 
    {
        "text": [], 
        "dish_name": "Sliced Pit Ham"
    }, 
    {
        "text": [
            "i read somewhere that this buffet was just as good as the wynn, bellagio, rio, in fact it won some award on year for being a damn good buffet. course it was 1 year, and the rio has won consistently. \n\ni went there for breakfast on my last day in vegas. how do i put this? the eggs in their <mark>Traditional Eggs Benedict</mark> were fried where the yolk was solid, they had corn <mark>Corned Beef Hash</mark> that was dry. the orange juice i had ordered was completely watered down. when i went to the buffet to get a smoothie they had actual real orange juice there. wtf? you mean i have to go to the buffet to get real orange juice. and they didn't have a selection of fresh fruit.\n\ntheir pastries from p.f. changs should have been left at the door. p.f. changs i have a bone to pick with you, but that's later. \n\nthe only thing good there was their oatmeal. and its hard to mess that up. the baked oatmeal was good too. i'd pass on this buffet as the quality of it just ain't that great.", 
            "we went for brunch this past sunday.  after hearing the hype about the place, i was actually looking forward to it.  maybe i'm just not a buffet fan... who knows... but i was not too impressed.\n\nfirst off, i was really looking forward to the breakfast items (nothing like bacon and eggs and shaking off a hangover).  i went right for the <mark>Traditional Eggs Benedict</mark>, my favorite.  they looked perfect, until i cut in at least.  cooked through... no yolk.  wtf?!  this is a brunch staple here!  so, i got some more to try again... no dice... i could have broken a window with the yolk.  oh well...the bacon was cooked right at least!\n\nmiddle eastern and sushi are my favorite foods, so i was pysched to see they had both.  the middle eastern section was very good.  the meats, grape leaves and hummus all were great.  the sushi was ok.  nothing fancy, just the basic 3 rolls, but they satisfied my craving for raw fish in the morning at least.\n\ni did not try too much otherwise... i think the overcooked eggs just pissed me the hell off and i lost my will to consume 4x my daily recommended intake of food in one sitting.  as far as service, it was very attentive at least, and the atmostphere was what you would expect for a buffet.  but, as far as being the \"best in las vegas\", i would hate to see what the others are like!  i went to the one at wynn a couple times in the past, and i would rate that much higher than this!", 
            "came here for the breakfast buffet around 9:30 on a friday morning.  busy busy.  quite a long line, but apparently that's standard.  the food was quite good here, nothing really to complain about.  they had little smoothies, which i thought was a fun idea.   the server was excellent, also.  the <mark>Corned Beef Hash</mark> was excellent and so were the little fried potatoes.  the <mark>Traditional Eggs Benedict</mark> were a bit overcooked, but everything else was great.", 
            "almost as good as google's free food with more options, way better than old country buffet (actually, old country is not even in the same league), and way better than the buffets at the hilton. def worth it.\n\n1. good price. $18 for all you can eat. plus if you stay at the resort, they give you a $5 off coupon (per room, good for four people). \n\n2. so many options! mediterranean bar. mexican grill. asian grill. salad bar. italian bar. dessert bar (so many cakes, breads, pastries, petit fours, tarts, pies, <mark>Soft-Serve Ice Cream</mark>, etc). omelet bar. etc.\n\n3. great food and drink. the coffee was fantastic (this coming from a coffee drinking seattleite). rich. full flavored. strong. the oatmeal was sweet and creamy.  the <mark>Traditional Eggs Benedict</mark> was great. fresh fruit. loved it.", 
            "this buffet can certainly take on the rio as being one of the biggest buffets in town. they offer just about any and everything you can imagine. \n\nsurprisingly the quality of the food is pretty good considering the volume although, you do trade a bit of quality for selection. they have a really good brunch and offer two kinds of <mark>Traditional Eggs Benedict</mark>, traditional and maple. yum! \n\n***you'll read this in my other vegas buffet reviews...make sure to find out when the buffet price changes from breakfast to lunch and lunch to dinner. the best time to visit any buffet is just before the time change. you'll get to pay a little less and have the benefit of trying both meal selections as they change over the items.", 
            "for a breakfast/brunch buffet, the spice market buffet was a steal in my opinion. there were <mark>Stewed Prunes & Fresh Assorted Fruits</mark>, an omelet station, assorted cheeses and meats, and even offerings like <mark>Traditional Eggs Benedict</mark>. in a nutshell, this buffet seemed to have everything imaginable that one would want to consume. service can be a little spotty since both days we went it was jammed, but that's understandable. i'm no expert on buffets but considering we wanted something relatively quick and not too much of a hassle, the spice market buffet fit the bill.", 
            "back when the casino used to be the aladdin, this was my favorite buffet in vegas. my friends and i used to joke that the banners proclaiming it to be the #1 voted best buffet in vegas could never live up to the hype. but we gave it a shot and it was awesome! honestly, it was better than bellagio's (meh), even wynn's seafood buffet (overhyped) at the time. the selection used to be pretty much all winners regardless of which section you chose.\n\ni don't know what happened, but the last few times i've visited the spice market seeking the same satisfaction as my first visit, i've been let down. the quality has just fallen from where it used to be.\n\nwe went for the brunch: the <mark>Traditional Eggs Benedict</mark> was probably the best thing i had this time and it was very good, prime rib was alright (not juicy enough), and the fake asian general chicken was not bad too. however, most of the other stuff was pretty average. next time, i'll probably go somewhere else.\n\n3.5 stars, but really some of that is the nostalgia factor.\ndear planet hollywood casino: you did a facelift to transform aladdin into ph, might as well do the same with the spice market buffet. the current iteration is only a shell of its former self.", 
            "its my pet peeve when buffets have a label that says \"<mark>Traditional Eggs Benedict</mark>\"\n\nexcuse me planet hollywood but those were more like mcdonalds egg mcfuffin with fake hollandaise sauce!! the eggs were no where near \"poached\"\n\nok so besides that irritating me, i must say, this has been one of the worst buffets i've tried in vegas. save that $15. go to the m resort for $10 instead or try the wynn for breakfast. they are so much better.\n\ni must have came in on bad day. but it was monday for breakfast and the employees took an incredibly long time to refill the stations....so long that when i left 30 minutes later, it still wasnt refilled. so there goes the pastry station for me. everything else just seemed so \"watered down or over cooked\" not worth my money. will not be returning to this buffet or casino! reviewing the casino next!", 
            "i was thoroughly not impressed! first of, the sunday brunch price was $28.99 with tax came out to $31. it's a champagne brunch with all you can drink. while standing in the long line granted it was during the peak brunch time at around noonish, i could see the extensive choices. there's selection, like an american station, mexican station, middle eastern (this includes indian, weird!), asian, italian (apparently pancakes and <mark>French Toast</mark> are italian), a breakfast station, a dessert station, a seafood station and two salad stations. as i said, it's extensive. so, i was hungry, my belly was growling and i remember seeing someone eating a cotton candy as they were leaving spice market so i was intrigued by this. anywho, stood in line, paid, stood in line yet again and my party of five was eventually seated after a half hour wait. so we gave our drink orders, and a friend and i took our turn to get our food. of course i was excited, i saw on the screens while we were waiting that was chicken curry at the middle eastern station so i knew i had to get some. grabbed two plates and started with an <mark>Traditional Eggs Benedict</mark>, bacon, got some chicken curry, tandoori chicken, some steamed rice, a steamed pork bun (yea i was getting my feast on) and proceeded back to the table to get crunk with my food. sadly that was not to be, the chicken curry was salty and lacked flavor (what happened to spice? huh spice market?!), the tandoori chicken was rubbery and so lackluster, it felt limp in my mouth =( , the steamed rice was not that soft (like how do you mess that up?!), the <mark>Traditional Eggs Benedict</mark> egg was not runny but cooked through, seriously?!! the only two things that were satisfactory was the bacon and the pork bun. so i thought maybe it's a fluke? i must have chose the wrong food items, so back i went to the buffet and this time, i got a blueberry and cherry crepe, a slice of <mark>French Toast</mark>, some fruit (cantaloupe and pineapple) and a fruit cobbler. the crepe was meh i've had way better, the <mark>French Toast</mark> was limp and blah, the fruit not sweet and the fruit cobbler was generic. the $31 was money wasted, i might have been full from sampling everything but i was not satisfied, rather i felt cheated. in my opinion for the money you spend, the same price could be better spent at other brunch buffets elsewhere on the strip like mandalay bay, the rio or stratosphere. i'm not a big buffet person but this buffet is a no-go in the future.", 
            "so not impressed. if i wanted to spend this much on brunch, i would've gone somewhere better, but no, the people in the group wanted this place. i think we should've questioned her taste buds since she was slightly sick/congested. \n\nthe place had different stations. there was american, mexican, italian, asian, a salad station, seafood, desserts, and middle eastern, which included indian food because apparently india is not asia according to planet hollywood. \n\nthe line was quite long, but it was around brunch/lunch so my party and i waited in line, which didn't seem that long of a wait. or maybe it didn't seem that long since they had tvs playing a nets game and people were all about lin, but i digress. once we paid, the total came to $31, we had to wait to be seated, which again didn't seem so long a wait. we marked out drink orders on a paper and went off in search of belly fulfilling food. i got the usual breakfast food: <mark>Traditional Eggs Benedict</mark>, bacon (a lot of it since i don't really eat bacon lol), as well as some fruit and harsh browns. another plate contained stuff from the middle eastern station, like some chicken curry, basmati rice, their lamb stuffed tomato thing, and pita and hummus. well have to say, i enjoyed the breakfast stuff, aside from the non-runny <mark>Traditional Eggs Benedict</mark> and was kinda disappointed in the middle eastern station. i found the food at that station a bit bland and asking \"where is the spice that makes this whatever it is suppose to be?!\" \n\nluckily there were drinks, although the oj was a bit warm for my liking. and the mimosas were more like an orangina than a mimosa. we asked for water, but that didn't come till later. i almost thought the poor server forgot. anyways, i went back to the buffet to see what else i could eat. i didn't find much too appealing cause i was a bit full, but i soldiered on. i went back for a crepe which was at the dessert station. they didn't have any strawberries (big boo to that!!!) so i settled with cherries topped with chocolate sauce, whipped cream, and powdered sugar. i found it a bit blah; too chocolatey and the cherry filling was a bit off putting for me. \n\ni got another fruit of plate and found i was more satisfied with fruit than i was with anything else. i could've gotten it and a decent mimosa somewhere else or found better food at other buffets on and off the strip. aside from the fruit, i liked the cotton candy :)\n\ni like buffets in vegas, but not this one.", 
            "went here for lunch. line wasn't too bad. the seating area is very spacious and each cuisine is separated into different areas. the mideastern food was delicious, very fresh. the american area had <mark>Scrambled Eggs</mark> which were great and bacon and <mark>Traditional Eggs Benedict</mark>. asian section wasn't the best and while there was a mexican section, i didn't eat the food because it was mainly beans, rice and fajitas.  dessert bar was good- freshly made and laid out nicely. also a great assortment of danishes and pastries.", 
            "one of my top choices for buffets in las vegas - and i have tried almost all of them. spice market buffet offers a great variety of great tasting food for breakfast, lunch and dinner. if you want to save some money print out the $5 coupon from http://www.destinationcoupons.com/nevada/las_vegas/spice-market-buffet/spice-market-buffet-coupons.asp - i've used it on several occasions and it's always worked. make sure to show your total rewards card if you joined the casino to save even more. \n\nat breakfast they have traditional favorites like pancakes, waffles, <mark>French Toast</mark>, <mark>Scrambled Eggs</mark>, salmon and lox with bagels, oatmeal and fruit, etc. some nice additions are <mark>Traditional Eggs Benedict</mark> - you won't find this at every buffet breakfast, and an omelet station. for lunch/dinner they have prime rib, turkey, salads, mexican food, mediterranean food, seafood including crab legs, paella and cocktail shrimp, asian cuisine, and italian including pastas and fresh from the oven pizzas. and of course they have desserts - notably, made to order crepes, cotton candy and soft serve custard. \n\ni think this buffet is a good buy for your money - there aren't a lot of \"exotic\" foods that you would find at buffets like the wynn or caesars - however, the selection is delicious and you can't go wrong.", 
            "we had the lunch buffet with all you can drink mimosas.  the greeter offered to let us look at the food before purchasing and we should have listened to her.  \n\npositive - our waitress was great\n\nnegative - very expensive, food was dried out, cold when should have been warm, warm if supposed to be cold, pineapple was bruised all over.  i was surprised they put it out.  how do you screw up mexican rice?  they figured it out.  how do you screw up bacon?  they mastered it.  everything was gross - even the egg rolls.  i was shocked that my husband grabbed the <mark>Traditional Eggs Benedict</mark>.  it was so nasty!!  the place had few people so we should have known better.  the pico de gallo was old and obviously stored for awhile.  \n\nwe should not have eaten here.  we were only here for one more day and we wasted it here.  \n\ni would never recommend this place!!", 
            "this was my favorite in town during my visit to las vegas. armed with a travelzoo voucher, we headed to champagne brunch without any particular expectations. first of all, maritza ( or possibly maricella) was our server, and the best server we had in buffet setting during our visit to vegas. our glasses never went empty. we worked our way in a clockwise fashion. stuffed sole and peel and eat shrimp were the highlight of the otherwise uninteresting seafood section. onto a yummy looking italian section where i sampled meatballs that would make my nonna hang up her apron. a huge breakfasty section was mostly avoided- except for some <mark>Traditional Eggs Benedict</mark> , egg itself was a bit firm for my taste, and partner had a lovely supercheesy beef slider. my favorite part of the buffet was strangely the tabouli. it was the best tabouli i had ever had in my life... fresh and light and perfectly lemony. hummus was good, dolmas good. why on earth would you put pita in a basket labeled naan? shaking my head here. tandoori style chicken while good, lacked traditional flavor. high quality olives were available near the imported meats <mark>Domestic and Imported Cheeses</mark>, i missed this station initially starting from the other side. don't miss this station, everything besides the mortadella was primo. i would also like to give the pastry chef a big ole hug. most of the other buffets we went to had the same exact stuff; i'm guessing that the mgm properties make all of their desserts in the same place and have them delivered so spice market was a real treat. was particularly smitten with the angel food cupcake with a mini canoli popping out of the top, i can still taste it- simply amazing. i had a few other bite size treats but wow, that cupcake was the star...\ni hope to go back in the future, even sans discount!"
        ], 
        "dish_name": "Traditional Eggs Benedict"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Cheese Blintz"
    }, 
    {
        "text": [
            "i usually write longer, more thoughtful reviews, but in the case of spice market buffet, i won't waste my time.  do not go!\n\nwe waited in line upstairs in the casino only to make it down the escalator to wait even longer in what looked like a holding pen for livestock.  the food was not good.  most of the displayed food looked dry and flavorless but, in fact, they did have flavor!  it was the flavor of really low-quality buffet food!  the only tasty item was the chocolate-filled crepes topped <mark>Baked Oatmeal with Peaches</mark> and a berry sauce.  they make them fresh at the dessert station.\n\ni'm kinda trashy in that i harbor a shameful enjoyment in vegas buffets, but if you need to go to one, i suggest the one at the mirage.", 
            "i have frequented the spice market a number of times when i  was in las vegas.  every time it was excellent probably the best in the city.  i took a party of 9 today for breakfast, spending over $180 only to find the quality had fallen off significantly.  as examples, the cheese on the cheese platter was dry and the edges curling.  the baked oatmeal was so over cooked that you could not get a serving spoon to break the  crust.  the bowl of compote at the crepe station were very unappetizing.  in fact the bananas foster <mark>Baked Oatmeal with Peaches</mark> resembled vomit.  i infact spoke to the manager, keith, and his.attitude was that he could care less and did missed my comments.  save your money and find another breakfast buffet.  this review should actually have 1star but the attitude of the waitstaff was excellent.  the only.redeeming feature of this buffett."
        ], 
        "dish_name": "Baked Oatmeal with Peaches"
    }, 
    {
        "text": [], 
        "dish_name": "Breakfast Pizza"
    }, 
    {
        "text": [], 
        "dish_name": "Fruit Pancakes"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Pancakes"
    }, 
    {
        "text": [
            "i love the <mark>French Toast</mark> here for brunch...it's so good!  especially with the peach topping they have.  we were pressed for time, so we had to hurrily eat our meal within 30 minutes.\n\ni was kind of disappointed with the crab legs.  it's nice that they split them up, but it was sad that they don't have a lot of it.  they only have one tray in the seafood section and it goes by fast.  \n\nit's similar to other buffets where they have a variety of food from other countries.  they had a middle eastern food section that was pretty good.  the dessert section was paltry compared to rio's carnival.  the only thing good was the flan.  \n\noverall, it's a deal with the 24 hour wristband, but the line is off the chain long. expect to wait a good hour and a half on sunday, just like we did.  the service was just not there.  perhaps because he was super busy, i hope.  i suggest coming only if you have a wristband, if you have to pay full price, i don't think it would be a great idea.", 
            "went here for brunch on a saturday with a friend. we got here between 10:30 and 11 am. line wasn't long (especially when compared to some other places we passed), which was really the determining factor in going here.\n\nthere were a lot of options on the buffet, but a bit heavier on the lunch vs. breakfast. the mimosas are included in the buffet price, which was cool. and i will say that i did enjoy the mimosas - they had a good balance of sparkling wine and orange juice. but the overall price was a bit expensive for my taste (probably pretty much in line with most buffets in vegas).\n\nthey had omelettes made to order, which was cool. but that was the only really special breakfast stuff they had. other than that i got some fried potatoes, smoked salmon, <mark>French Toast</mark>. i tried some of the desserts too and didn't really enjoy a single one.\n\noverall, nothing was amazing, but everything was ok.", 
            "this is the 2nd buffet that i tried with david g, sarah a and minh d when we did the buffet of buffets.  located in planet hollywood, this was yet another impressive selection of food!\n\nin my food haze, this is what i remember:\n\nsalad area:\nlettuce\ncreamy salads\ngrilled veggies\nsalad veggies\nfruit\na ton of different rolls\n\nmexican area:\nquesadillas\ntortillas\ntaco filling\nbeans\nguacamole\nsalsas, cheese, sour cream\nmexican omelette\nchips \n\nbreakfast area:\n<mark>Scrambled Eggs</mark>\nbacon\nbreakfast potatoes\n2 diff kinds of benedict\n<mark>French Toast</mark>\npancakes\nwaffles\nmade to order omelettes\n\nmiddle eastern area:\ntandoori chicken breast\ngrilled veggie skewers\nbaba ghanoush\n\nitalian area:\npizza\nmeat lasagna rolls\ngrilled veggies\npastas\ngarlic breadsticks\n\nmediterranean area:\nprime rib w/jus and horseradish\nmashed potatoes\nsteamed veggies\nstuffed pork loin w/apples\n\nseafood area:\nstuffed sole\npaella\nshrimp cocktail\nsushi\nlox\n\nasian area:\ndim sum\nchinese food\neggrolls\n\ndessert area:\nmake your own crepes\nchocolate & vanilla mousse in chocolate shells\nfruit tarts\ncheesecake\nflan\ncotton candy\ncookies\npeach cobbler\nbread pudding\ncakes\nbanana cream pie\nfruit pies\ncookies\nself serve chocolate & vanilla frozen custard with cones and toppings\ndanish assortment\n\ni likely missed some things, so you'll have to go check it out yourself.\n\noof.....i need to lie down now.....", 
            "day 2 and onto our 2nd buffet, we all decided on coming to the spice market. this buffet is located down a set of escalators just inside the miracle mile entrance of planet hollywood. the cashier desk is located in the middle of the buffet. since we already bought a 24 hour pass all we had to do is show our id's and our total rewards card and we were in!!\nlucky for us, that we were seated at a table that was close to the action. large plasma tv's were hanging in different area's and had either mtv hitlist or espn on.\nthis buffet is on the smaller side but make no mistake it holds alot of yummi foods!!\n\nhighlights of the action:\n\ntandoori chicken, hummus, couscous, stuffed tomatoes with ground lamb, pita bread,lamb skewers,tabouleh, chicken in curry sauce\n\ncrepe-making station \n\nall different kinds of salads\n\ntacos,quesadillas,tortillas, guacamole and salsa\n\nham and prime rib \n\nall kinds of yummi breakfast foods:\neggs, bacon, <mark>French Toast</mark>, pancakes, waffles, hash browns and who can forget the made to order omelettes!!\n\npizza, lasagna, garlic breadsticks and pastas with different sauces\n\nshrimp cocktail, sushi (again i wouldnt recommend),crab legs\n\neggrolls, noodles and dim sum\n\ndessert:\ncotton candy (heck yeah)\n<mark>Soft-Serve Ice Cream</mark>\ncookies\npies\ncakes and the list keeps going and going!\n\nour waiter was kind and our water glasses were always refilled when asked,plates were cleared after we were finished as well! only beef i have is when i went to the carving station there was no one there. i waited along with a couple other hungry customers for about 2-3minutes till one of the servers noticed he had a line. geez buddy, if you know its busy then stay out where we can see you!!!", 
            "probably one of the only other buffets in vegas i'm willing to eat at, other than wynn's. don't be fooled by my 4-star rating; the food isn't amazing -- but it gets the job done without breaking the bank. i've been here twice for breakfast and lunch, and everything tasted decently yummy.\n\nmy favorites from here are probably the <mark>French Toast</mark> with real strawberries and syrup, most of the chicken dishes, and the soft serve <mark>Soft-Serve Ice Cream</mark> (one of the best soft serves i've ever had). they also have a great dessert selection, including deliciously soft and chewy cookies and cotton candy. yes, you read right, cotton candy. i forget why but for some reason our buffet came with champagne and we discovered that putting cotton candy in champagne makes a fine (and sweeter) tasting bubbly.\n\nno complaints from me!", 
            "i was thoroughly not impressed! first of, the sunday brunch price was $28.99 with tax came out to $31. it's a champagne brunch with all you can drink. while standing in the long line granted it was during the peak brunch time at around noonish, i could see the extensive choices. there's selection, like an american station, mexican station, middle eastern (this includes indian, weird!), asian, italian (apparently pancakes and <mark>French Toast</mark> are italian), a breakfast station, a dessert station, a seafood station and two salad stations. as i said, it's extensive. so, i was hungry, my belly was growling and i remember seeing someone eating a cotton candy as they were leaving spice market so i was intrigued by this. anywho, stood in line, paid, stood in line yet again and my party of five was eventually seated after a half hour wait. so we gave our drink orders, and a friend and i took our turn to get our food. of course i was excited, i saw on the screens while we were waiting that was chicken curry at the middle eastern station so i knew i had to get some. grabbed two plates and started with an <mark>Traditional Eggs Benedict</mark>, bacon, got some chicken curry, tandoori chicken, some steamed rice, a steamed pork bun (yea i was getting my feast on) and proceeded back to the table to get crunk with my food. sadly that was not to be, the chicken curry was salty and lacked flavor (what happened to spice? huh spice market?!), the tandoori chicken was rubbery and so lackluster, it felt limp in my mouth =( , the steamed rice was not that soft (like how do you mess that up?!), the <mark>Traditional Eggs Benedict</mark> egg was not runny but cooked through, seriously?!! the only two things that were satisfactory was the bacon and the pork bun. so i thought maybe it's a fluke? i must have chose the wrong food items, so back i went to the buffet and this time, i got a blueberry and cherry crepe, a slice of <mark>French Toast</mark>, some fruit (cantaloupe and pineapple) and a fruit cobbler. the crepe was meh i've had way better, the <mark>French Toast</mark> was limp and blah, the fruit not sweet and the fruit cobbler was generic. the $31 was money wasted, i might have been full from sampling everything but i was not satisfied, rather i felt cheated. in my opinion for the money you spend, the same price could be better spent at other brunch buffets elsewhere on the strip like mandalay bay, the rio or stratosphere. i'm not a big buffet person but this buffet is a no-go in the future.", 
            "i was pleasant surprise as i have heard that some of the buffets in vegas are terrible. i went with some of the ladies i was staying with on a saturday morning for the brunch buffet as we missed the breakfast only. they offered a wide range of food options from breakfast, lunch, and dessert. they had traditional breakfast options such as eggs, waffles, pancakes, and <mark>French Toast</mark>. along with breakfast they had various lunch options with everything from soup and salads, asian, italian, middle eastern, and seafood. they also offered many dessert options from pastries, crepes, and fresh fruit. \n\nsome of my highlights were the <mark>French Toast</mark> which was dipped in cinnamon. the pineapple and cantaloupe were extremely fresh and juicy. spicy buffalo shrimp and this crab dish i can't think of the name were so good. i thoroughly enjoyed my crepe it would have been nice to just offer strawberry instead of mixed but the banana was good with chocolate sauce. \n\nif your looking for a decent buffet this would be a good option to try. i will recommend that you go get the players card of the casino at planet hollywood because the buffet will be cheaper.", 
            "one of my top choices for buffets in las vegas - and i have tried almost all of them. spice market buffet offers a great variety of great tasting food for breakfast, lunch and dinner. if you want to save some money print out the $5 coupon from http://www.destinationcoupons.com/nevada/las_vegas/spice-market-buffet/spice-market-buffet-coupons.asp - i've used it on several occasions and it's always worked. make sure to show your total rewards card if you joined the casino to save even more. \n\nat breakfast they have traditional favorites like pancakes, waffles, <mark>French Toast</mark>, <mark>Scrambled Eggs</mark>, salmon and lox with bagels, oatmeal and fruit, etc. some nice additions are <mark>Traditional Eggs Benedict</mark> - you won't find this at every buffet breakfast, and an omelet station. for lunch/dinner they have prime rib, turkey, salads, mexican food, mediterranean food, seafood including crab legs, paella and cocktail shrimp, asian cuisine, and italian including pastas and fresh from the oven pizzas. and of course they have desserts - notably, made to order crepes, cotton candy and soft serve custard. \n\ni think this buffet is a good buy for your money - there aren't a lot of \"exotic\" foods that you would find at buffets like the wynn or caesars - however, the selection is delicious and you can't go wrong.", 
            "we use the spice market buffet sometimes for breakfast as we stay right across the street. on this occasion we were using the buffet of buffets pass and i didn't look to see how much monday morning breakfast was, but what we like about planet hollywood's buffet is they have a nice breakfast selection.  i was on some crazy fresh fruit tear that morning, so i got lots of yummy fruit from berries to pineapple to cantaloupe.  i also dug into the oatmeal and there were all kinds of great toppings: craisins, almonds, granola, etc.  my husband had an egg mcmuffin on cheddar cheese steroids and said it was awesome.  and of course, we munched through the usual eggs <mark>Applewood-Smoked Bacon and Sausage</mark> and bacon items.  they have a nice bread bar with <mark>French Toast</mark>, pancakes, and waffles with a selection of syrup and toppings as well as donuts.  i passed on my usual biscuits and gravy, but it was there and so were bagels with toppings like lox, tomatoes, <mark>Bagels & Cream Cheese</mark>, etc. and a toast selection.  in other words, great breakfast selections.  \n\ngood food and good service.  i like that the bathroom is at the same location so you don't have to go traipsing all over the casino to find it.  we like it.  we'll probably be back.\n\ni did have one previous experience there at dinner and on that occasion the food was okay, but it didn't give me an urge to return for dinner.", 
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast.", 
            "i was surprised at how low the ratings are for this place. \n\ni came here one for breakfast in 2010 and fell in love so i had to come back this time. breakfast was amazing. i loved everything, except <mark>French Toast</mark> and pancakes but everything else was great. i left so full that i took a 4 hour long nap. \n\ni went there for dinner  3 nights later and it was good but not as great as breakfast. i give breakfast a 5 and dinner a 3.5. the crab legs were cold which made me sad. the steak for dinner and breakfast though were excellent. i ate so much breakfast steak. \n\nbreakfast was $22 and dinner was $36.", 
            "i read several reviews on here before going to try the breakfast buffet on sunday. the whole process to pay and be seated was horrible and staff was rude. i should have left then. at 10am they started to put up the breakfast items, which was strange for brunch. mimosas were so disgusting. they did have a small omelet station with 4 pans. the chef was only making one omelet to completion before starting another. several angry people in line. desserts were all stale and even the <mark>Soft-Serve Ice Cream</mark> was runny and tasteless. i could not even put it in the sugar cones. this experience should have foreshadowed the food poisoning i got. by 3 o'clock i had to lay down and did not wake up till 10pm to be physically ill. this was all that i had eaten and i washed my hands/ used hand sanitizer after playing machines. bad service, bad choices and selection, poor quality, and the food makes you sick. avoid! no buffet should be able to ruin breakfast. attaching a pic of my burnt <mark>French Toast</mark>."
        ], 
        "dish_name": "French Toast"
    }, 
    {
        "text": [], 
        "dish_name": "Waffles"
    }, 
    {
        "text": [], 
        "dish_name": "Assorted Donuts"
    }, 
    {
        "text": [
            "i read somewhere that this buffet was just as good as the wynn, bellagio, rio, in fact it won some award on year for being a damn good buffet. course it was 1 year, and the rio has won consistently. \n\ni went there for breakfast on my last day in vegas. how do i put this? the eggs in their <mark>Traditional Eggs Benedict</mark> were fried where the yolk was solid, they had corn <mark>Corned Beef Hash</mark> that was dry. the orange juice i had ordered was completely watered down. when i went to the buffet to get a smoothie they had actual real orange juice there. wtf? you mean i have to go to the buffet to get real orange juice. and they didn't have a selection of fresh fruit.\n\ntheir pastries from p.f. changs should have been left at the door. p.f. changs i have a bone to pick with you, but that's later. \n\nthe only thing good there was their oatmeal. and its hard to mess that up. the baked oatmeal was good too. i'd pass on this buffet as the quality of it just ain't that great.", 
            "came here for the breakfast buffet around 9:30 on a friday morning.  busy busy.  quite a long line, but apparently that's standard.  the food was quite good here, nothing really to complain about.  they had little smoothies, which i thought was a fun idea.   the server was excellent, also.  the <mark>Corned Beef Hash</mark> was excellent and so were the little fried potatoes.  the <mark>Traditional Eggs Benedict</mark> were a bit overcooked, but everything else was great.", 
            "of the plethora of choices for harrah's properties, ph has the best buffet of all of them. i rate paris next in line. one way to know is how they make some of their food. for instance, the creamed chipped beef and <mark>Corned Beef Hash</mark> are all made fresh. while at harrahs, and the others, it is from a can. the flamingo has gone up in standards a bit, but harrah's and paris have gone down hill some. if you are going to do the 24 hour buffet i would do ph as your main choice to eat. \n\nfor dinner, they have the best choices of all the other buffets and really do the crab legs well with both warm and cold legs. they also have peel and eat shrimp already peeled for you. that little step saves a ton of mess and time. it is worth the crab legs just to eat there. \n\nservice is friendly and the staff were attentive to us. if you are diamond or platinum they make sure you are taken care of right away.  \n\nmake no mistake ph doesn't get five stars because it is not on the caliber of mgm or bellagio. but for harrah's properties, it is the best.", 
            "this was the 4th and final stop on our 24 hour buffet rampage, and we all wished we would have skipped it. one of my brothers even suggested leaving while we were all on our first(and i think only) plate and going back to paris or harrah's. we came here for brunch on sunday. in addition to them not being satisfied with how slowly the champagne was flowing, they all mentioned how nasty the bacon was, and we were all less than amused with the selection and variety of this place. the <mark>Corned Beef Hash</mark> was very salty and i did not enjoy the smoked salmon, but the chorizo & eggs were good as were the breakfast potatoes. i was also somewhat annoyed that the signs did not match what they were in front of, but maybe that was because they were changing from breakfast to brunch. my first plate was ok, but i had no desire to go back for a second, until i saw the dessert. they had a huge selection of interesting flavors of cupcakes. i had a candy apple one, a key lime one, and two other unique flavors. they were really good, but not good enough to lure me back here, even with the buffet of buffets pass. do not go here, as there are far better options.", 
            "what the hell happened here in the past 6 months. this was my favorite buffet in vegas since it opened. i came here this past weekend expecting the best but instead got shortchanged. i asked for their 24 hour ayce buffet pass. it went up $20 to $70. really? i expected the quality of food to have increased as much as the prices. over half of the food i got was so salty, i couldn't eat it. if you have heart disease or diabetes, run for the exit. ridiculously salty. it was 6:30pm on friday when we walked in. this place was empty. should've recognized this red flag. \n\ncame back for breakfast the next day. same thing. my favorite <mark>Corned Beef Hash</mark> to the hash browns were saturated with salt. who runs the kitchen now? they should rename their buffet \"salt market buffet.\"  time to find me a new buffet in town...any recommendations?", 
            "blegh. i used to love coming to spice market in planet hollywood for their lunch buffet circa 2012-2013. i remember the cotton candy machine at the dessert bar and all the different cultural cuisines you can try.\n\nwe had the breakfast buffet here on friday for $20 per person and man, was it bad. we really should have went somewhere else. it doesn't compare to the lunch at all. it wasn't even worth 20 bucks. when we walked in, it was depressing to see that many of the stations with different cuisines were blocked off, and we were only limited to a few stations stocked with breakfast items.\n\nthe options are scarce. the breads, pastries, and pancakes were stale and gross. something out of a plastic bag, sitting in the back for months. i put some <mark>Corned Beef Hash</mark> on my plate and it was lukewarm and dry. i ended up filling up on <mark>Stewed Prunes & Fresh Assorted Fruits</mark> and oatmeal, grabbing 2 small glasses of their strawberry banana smoothie and calling it a day. smoked salmon was brown and old. i got a slice of steak and it was flavorless and difficult to chew. again, lukewarm. nothing was hot. it made me lose my appetite.\n\ndo they recycle old food items from the day before for breakfast? because that's exactly what it tastes like.\n\nnever come here for breakfast."
        ], 
        "dish_name": "Corned Beef Hash"
    }, 
    {
        "text": [], 
        "dish_name": "Breakfast Sliders"
    }, 
    {
        "text": [
            "i wouldn't return.\n\nexpensive, not very expansive (just because you have a lot of space, doesn't mean you are serving a lot of food), and the food was standard hometown buffet quality.\n\nfor the money they charge, i expect to be eating good food.  nothing stood out as great...maybe the <mark>Breakfast Sausage</mark>.  sausage is absolutely impossible to screw up.\n\nthe potatoes tasted like recycled egg cartons.  well i guess it's good that they are recycling..right?\n\ngo to any of the other 356 good buffets in the land of strippers, liberace, and buffets."
        ], 
        "dish_name": "Breakfast Sausage"
    }, 
    {
        "text": [], 
        "dish_name": "Home-Fried Potatoes"
    }, 
    {
        "text": [
            "staying at the elara time share, i wanted to try a buffet but was lazy, so i just headed for planet hollywood and walked through the miracle mile shops.  upon entering the casino, i looked for the buffet, which was sort of hidden.  \n\nit was late dinnertime so there weren't a lot of people but they still had a ton of food.  i immediately went to town and grabbed the \"exotic\" dishes like kabobs, lambs, etc. and then noticed that you can make your own burger, so i proceeded to request two medium well's <mark>Scrambled Eggs with Ham & Cheese</mark>.  \n\ni must have eaten around like 4 or 5 platefuls then it was time for dessert.  they had like a cupcake bar.  tons of cupcakes, and i tried maybe 6 of them.  \n\ni recommend this place only if you are nearby and if you're lazy.  otherwise i should have just gone out and ate somewhere else."
        ], 
        "dish_name": "Scrambled Eggs with Ham & Cheese"
    }, 
    {
        "text": [], 
        "dish_name": "Polish Kielbasa & Peppers"
    }, 
    {
        "text": [], 
        "dish_name": "Creamy Oatmeal"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Oak-Smoked Salmon with Capers"
    }, 
    {
        "text": [], 
        "dish_name": "European Breakfast Meats"
    }, 
    {
        "text": [
            "ready nice buffet. everything was fresh abd looked good too.  pineapple curry tilapia, bbq ribs, flank steak, three cheese lasagna all stand outs.  some interesting choices as well apricot ham, mac <mark>Domestic and Imported Cheeses</mark> balls, pork baroca burritos all good to. but i spent my extra stomach space on dessert. ... cupcakes to die for! strawberry shirt cake and mint chocolate chip were best.  really i ate $21 worth.   they also have crepe bar to make what you want, how you want it.  for lunch it's going to be enough to fill me up thru dinner.", 
            "this was my favorite in town during my visit to las vegas. armed with a travelzoo voucher, we headed to champagne brunch without any particular expectations. first of all, maritza ( or possibly maricella) was our server, and the best server we had in buffet setting during our visit to vegas. our glasses never went empty. we worked our way in a clockwise fashion. stuffed sole and peel and eat shrimp were the highlight of the otherwise uninteresting seafood section. onto a yummy looking italian section where i sampled meatballs that would make my nonna hang up her apron. a huge breakfasty section was mostly avoided- except for some <mark>Traditional Eggs Benedict</mark> , egg itself was a bit firm for my taste, and partner had a lovely supercheesy beef slider. my favorite part of the buffet was strangely the tabouli. it was the best tabouli i had ever had in my life... fresh and light and perfectly lemony. hummus was good, dolmas good. why on earth would you put pita in a basket labeled naan? shaking my head here. tandoori style chicken while good, lacked traditional flavor. high quality olives were available near the imported meats <mark>Domestic and Imported Cheeses</mark>, i missed this station initially starting from the other side. don't miss this station, everything besides the mortadella was primo. i would also like to give the pastry chef a big ole hug. most of the other buffets we went to had the same exact stuff; i'm guessing that the mgm properties make all of their desserts in the same place and have them delivered so spice market was a real treat. was particularly smitten with the angel food cupcake with a mini canoli popping out of the top, i can still taste it- simply amazing. i had a few other bite size treats but wow, that cupcake was the star...\ni hope to go back in the future, even sans discount!"
        ], 
        "dish_name": "Domestic and Imported Cheeses"
    }, 
    {
        "text": [], 
        "dish_name": "Vine-Ripened Tomatoes"
    }, 
    {
        "text": [], 
        "dish_name": "Marinated Olives"
    }, 
    {
        "text": [
            "this is my first vegas buffet, how exciting! \nwent to the breakfast buffet this past sunday, and i was surprised to see that there was no line! i had seen other buffet lines in vegas, and they're frightening. \nselection was pretty good, there was fruit smoothies, <mark>Stewed Prunes & Fresh Assorted Fruits</mark>, belgian waffles, corned beef, pastries, bacon, crepes, toast, bagels, omelettes, eggs, <mark>Applewood-Smoked Bacon and Sausage</mark>. \ncost was great. at $14.99, i found it to be a  complete bargain. \nminus one star though, because some of the food was kind of cold and unappetizing.", 
            "for a breakfast/brunch buffet, the spice market buffet was a steal in my opinion. there were <mark>Stewed Prunes & Fresh Assorted Fruits</mark>, an omelet station, assorted cheeses and meats, and even offerings like <mark>Traditional Eggs Benedict</mark>. in a nutshell, this buffet seemed to have everything imaginable that one would want to consume. service can be a little spotty since both days we went it was jammed, but that's understandable. i'm no expert on buffets but considering we wanted something relatively quick and not too much of a hassle, the spice market buffet fit the bill.", 
            "blegh. i used to love coming to spice market in planet hollywood for their lunch buffet circa 2012-2013. i remember the cotton candy machine at the dessert bar and all the different cultural cuisines you can try.\n\nwe had the breakfast buffet here on friday for $20 per person and man, was it bad. we really should have went somewhere else. it doesn't compare to the lunch at all. it wasn't even worth 20 bucks. when we walked in, it was depressing to see that many of the stations with different cuisines were blocked off, and we were only limited to a few stations stocked with breakfast items.\n\nthe options are scarce. the breads, pastries, and pancakes were stale and gross. something out of a plastic bag, sitting in the back for months. i put some <mark>Corned Beef Hash</mark> on my plate and it was lukewarm and dry. i ended up filling up on <mark>Stewed Prunes & Fresh Assorted Fruits</mark> and oatmeal, grabbing 2 small glasses of their strawberry banana smoothie and calling it a day. smoked salmon was brown and old. i got a slice of steak and it was flavorless and difficult to chew. again, lukewarm. nothing was hot. it made me lose my appetite.\n\ndo they recycle old food items from the day before for breakfast? because that's exactly what it tastes like.\n\nnever come here for breakfast."
        ], 
        "dish_name": "Stewed Prunes & Fresh Assorted Fruits"
    }, 
    {
        "text": [], 
        "dish_name": "New York-Style"
    }, 
    {
        "text": [
            "4 stars for the spice market buffet.   i'm being slightly generous but these 4 stars make sense in context of the fact that we're talking about a las vegas buffet.   i'm not even comparing this place with picasso across the street or any \"honest\" restaurant, for that matter.   when one accounts for the fact, though, that this is an all-you-can-eat buffet, spice market buffet should evidently get 4 stars.\n\nother reviewers have already mentioned this:  they have a wide variety of different cuisines:  seafood, salads, italian, american, asian, middle eastern, mexican, and desserts.   this means you can get sushi to start with, then load up egg benedicts, then switch over and get a bagel with lox and <mark>Bagels & Cream Cheese</mark>, then get a quesadilla or some pasta, and finish it up with a couple of desserts.   we didn't get an opportunity to try nearly that many foods here, but this is just to illustrate the variety of foods that they serve.\n\ni started with their lox and <mark>Bagels & Cream Cheese</mark>, incidentally.  the salmon was really extremely good.   i also tasted their egg benedict and their crab benedict, and i gotta say the egg benedict was quite good.   the crab one... only so so.  their lobster pasta was *serious* disappointment, as was their sushi.  let's just say that i didn't even touch the sushi:  my wife got it for me as she knows i love it, but just eyeing the fish, i knew it was probably not even close to fresh and didn't really feel like spending my vegas weekend puking, so i left it.  the sausage pizza was cooked with a wine-based sauce and was way tastey!   finally, their dessert selection was astounding.   i had the tiramisu and it really was quite a treat!\n\n$20 a head for sunday brunch... it's pricey, but then again you're gonna eat a lot of different foods and lots of it, so that'll basically be your one meal for the day.   price-wise, i guess it's worth it.\n\nas far as decor is concerned, it's quite tragic.   i think i've felt more warmth kickin' it at the ritz carlton men's restrooms than i did in this place.   it's open seats, very ugly booths... just tragic decoration.\n\nalso, watch out for serious white trash contingency here.   this couple took our table and switched receipts because they apparently weren't pleased with where they'd been placed by the hostess.  puzzled, i asked the guy who looked worse than a bulldog if he might have mistakenly sat at the wrong table.   he sorta grunted and went back to sucking his food out of his plate.   the guy looked so grungy and smelly i frankly wasn't gonna argue.  probably sitting back in that chair i'd have caught some nasty disease.    anyway, that was a bit of a downer on our brunch since both my wife and i felt slightly freaked out at this episode.  we tried to sit as far away from them as we could but, sadly, it wasn't far enough.   so yeah, watch out for the white trash that seems to hang out here.   then again, most of the other patrons looked normal enough.  still, looks can be deceiving.", 
            "great choice as an intermediate buffet... you guys know what i'm talking about!! you know??? when you're so sick of buffets from the first buffet you dined at but somehow still want the best bang for your buck on the 2nd meal...why do anything else?! buffet #2 here you come. \n\nthe spice market buffet always has a warm spot in my heart because of their brunch. how can you not love made to order omelets??? they have the typical omelet items... ham, onions, mushrooms, green onions, cheese... but you want to know the secret? \n\nhere's the secret: go get a slice of the prime rib... chop it up yourself... then bring the plate w/ your chopped primed rib to the station and have (arguably) the best omelet experience of your life... haha, clever, eh?! \n\nthe spice market buffet has other items that are kind of unique--i love their shrimp tempura, smoked salmon and <mark>Bagels & Cream Cheese</mark>, and crepes!! yum... super buttery, but yum. \n\ncome for champagne brunch and get your grub on w/ some mimosas, how can you complain when you can eat and drink?!! winner winner, chicken dinner (in this case, chicken brunch).\n\ngreat place to go, would get 5/5 but that's more reserved for the m-buffet where you can get everything i just listed for about half the price on a weekday.  but the m's 9 miles away if you're on the strip, so convenience garners a strong review--well done spice market.\n\np.s. i love walking thru the miracle mile shops too--good way to build up an appetite.", 
            "this so-called buffet is located downstairs in the planet hollywood resort & casino.\n\nthere was a long line, but the wait was only about 10-12 minutes. ended up paying $27.99 since i had my player's card, but my friend ended up paying $30.00 since she didn't bring hers.\n\nanyway, i had a little bit of each cuisine, except the mexican, since i accidentally spilled water all over it. unfortunately, it would take me forever to nit-pick what was wrong with each dish, so i'm just going to be listing what i didn't like about each one here:\n\namerican:\n\nrag-out: mushrooms tasted like they were uncooked, sauce was flavorless\nmacaroni & cheese: it didn't taste like cheese, or pasta; plus the cheese was sort of clear(eww!)\n\nmediterraenean:\n\nnaan with mango chutney: okay. the mango was a little too sweet for my liking, but it wasn't terrible.\n\nseafood:\nking crab legs: these were going fast; not sure why though. they could have at least provided some melted butter so it wouldn't be so bland\nclams: tasted like mussels; though that's not necessarily a bad thing\n\nitalian:\n\n3 cheese lasagna: similar to the type of lasagna you'd get at sbarro. a-ok.\n\ni didn't have any of the salads, but my friends said they were good. \n\nand now, for the desserts, which was the worst part of the meal:\n\nseafood:\nking crab legs: these were going fast; \nclams: tasted like mussels; though that's not necessarily a bad thing\n\ncarrot cake: basically, they baked carrots into rye bread.\nflan: weird, because the sauce was good, but flan itself was like flavorless jello. \nstrawberry cheesecake: okay, so they decided not put any sugar in it. oh, and they substituted some crumbly feta cheese for the <mark>Bagels & Cream Cheese</mark>. awful, just awful.\ncreme brulee: the top wasn't even glazed over and crunchy; you're supposed to crack the top of a creme brulee to eat it. the inside tasted very eggy, and the texture was just like pudding.\nlemon meringue tart: guess they decided to save money and just use the same filling for the creme brulee and the lemon meringues. \n\nhands down the worst dining experience i have ever had in my life. though i didn't try much of the mediterranean cuisine, my friends said that and the salads were the only tasty parts of their meal. the only thing i liked about eating here was that they had cotton candy.", 
            "with the groupon for 2/$45 with unlimited drinks (alcohol included), it was a fantastic way to say adios to las vegas. \n\nthe food was fresh and hot and didn't look like it was sitting around for too long. everything was pretty good quality, but i guess this might be because i made it to dinner just as it started. it's not comparable to the higher class buffets in vegas, but for it's price range, i wouldn't expect it to be. \n\nthe one complaint i had was the dessert station was all cupcakes. i wish there was more variety in the types of dessert offered (i can only eat so much <mark>Bagels & Cream Cheese</mark> frosting, guys.). \n\noverall, for less than $25 a person (with groupon), this expanded and better tasting hometown buffet is a great way to fill up one last time before passing out on the airplane.", 
            "we use the spice market buffet sometimes for breakfast as we stay right across the street. on this occasion we were using the buffet of buffets pass and i didn't look to see how much monday morning breakfast was, but what we like about planet hollywood's buffet is they have a nice breakfast selection.  i was on some crazy fresh fruit tear that morning, so i got lots of yummy fruit from berries to pineapple to cantaloupe.  i also dug into the oatmeal and there were all kinds of great toppings: craisins, almonds, granola, etc.  my husband had an egg mcmuffin on cheddar cheese steroids and said it was awesome.  and of course, we munched through the usual eggs <mark>Applewood-Smoked Bacon and Sausage</mark> and bacon items.  they have a nice bread bar with <mark>French Toast</mark>, pancakes, and waffles with a selection of syrup and toppings as well as donuts.  i passed on my usual biscuits and gravy, but it was there and so were bagels with toppings like lox, tomatoes, <mark>Bagels & Cream Cheese</mark>, etc. and a toast selection.  in other words, great breakfast selections.  \n\ngood food and good service.  i like that the bathroom is at the same location so you don't have to go traipsing all over the casino to find it.  we like it.  we'll probably be back.\n\ni did have one previous experience there at dinner and on that occasion the food was okay, but it didn't give me an urge to return for dinner."
        ], 
        "dish_name": "Bagels & Cream Cheese"
    }, 
    {
        "text": [
            "i usually write longer, more thoughtful reviews, but in the case of spice market buffet, i won't waste my time.  do not go!\n\nwe waited in line upstairs in the casino only to make it down the escalator to wait even longer in what looked like a holding pen for livestock.  the food was not good.  most of the displayed food looked dry and flavorless but, in fact, they did have flavor!  it was the flavor of really low-quality buffet food!  the only tasty item was the chocolate-filled crepes topped <mark>Baked Oatmeal with Peaches</mark> and a berry sauce.  they make them fresh at the dessert station.\n\ni'm kinda trashy in that i harbor a shameful enjoyment in vegas buffets, but if you need to go to one, i suggest the one at the mirage.", 
            "i have frequented the spice market a number of times when i  was in las vegas.  every time it was excellent probably the best in the city.  i took a party of 9 today for breakfast, spending over $180 only to find the quality had fallen off significantly.  as examples, the cheese on the cheese platter was dry and the edges curling.  the baked oatmeal was so over cooked that you could not get a serving spoon to break the  crust.  the bowl of compote at the crepe station were very unappetizing.  in fact the bananas foster <mark>Baked Oatmeal with Peaches</mark> resembled vomit.  i infact spoke to the manager, keith, and his.attitude was that he could care less and did missed my comments.  save your money and find another breakfast buffet.  this review should actually have 1star but the attitude of the waitstaff was excellent.  the only.redeeming feature of this buffett."
        ], 
        "dish_name": "Oatmeal"
    }, 
    {
        "text": [
            "came here for breakfast on the final leg of our buffet of buffets marathon. \n\nwow. if i had paid for this place, i would have been pissed. service was excellent. i adored our server. she asked if we wanted a to-go cup of coffee. no one has ever offered that!\n\nthe juice was clearly from concentrate. the mexican and salad sections were closed. what? no mexican breakfast? those are the best dishes! \n\nmiddle eastern included bagels and lox. this was probably my favorite section. i forced fed myself lox <mark>Oak-Smoked Salmon with Capers</mark> to get my money's worth. i liked the mozzarella and tomato salad, but it was something i could find at a supermarket deli. \n\ndessert section looked like it was filled with mini packaged pastries. i selected a chocolate croissant, but it was flaky and dry, so i skipped it. \n\non to the american section. there were 2 types of benedicts. they looked good, but i think they became overcooked from the heat lamp. the country style potatoes were good and surprisingly still crispy. i did however, find these potatoes repeated 2 more times. it also seemed like these were the seasoned potatoes you find in the freezer aisle. \n\nthere was an omelet station, that i skipped. and i think a crepe station in the dessert section. \n\nstopped in the asian section to get a squirt of sriracha. \n\ni stopped off for a <mark>Cheese Blintz</mark>, but never ate it. it was pretty burnt and didn't have much filling. the section also included <mark>French Toast</mark> and pancakes?\n\nthere was a nice oatmeal/<mark>Cream of Wheat</mark> section. then, a fresh fruit section where you could construct your own parfait. 2 yogurt flavors, shredded coconut and granola? 2 smoothie options. they were really plain. i think one was banana, the other, strawberry. \n\nthe final section included spinach and cheese egg scramble, but i didn't see any cheese or spinach. there were <mark>Potato Pancakes</mark>. and a <mark>Turkey Hash</mark> which had fingerling potatoes (yum) and roasted peppers. i took the time to dig out the pepper and fingerlings. this was one of the only things that didn't seem pre-made. and it was pretty good.  \n\ni looked through the photos for lunch and dinner and they all look like a completely different restaurant! i don't know, guess they dropped the ball for breakfast. kind of a shame for people like me who love breakfast."
        ], 
        "dish_name": "Cream of Wheat"
    }, 
    {
        "text": [], 
        "dish_name": "Yogurts with Dried Fruits & Nuts"
    }, 
    {
        "text": [], 
        "dish_name": "Granola"
    }, 
    {
        "text": [], 
        "dish_name": "Berries & Cream"
    }, 
    {
        "text": [], 
        "dish_name": "Strawberry & Banana Smoothies"
    }, 
    {
        "text": [], 
        "dish_name": "Pies"
    }, 
    {
        "text": [], 
        "dish_name": "Crepes"
    }, 
    {
        "text": [], 
        "dish_name": "Tarts"
    }, 
    {
        "text": [
            "i was there for the breakfast buffet and upon hearing lots of good recommendations from friends and yelpers, i was dissapointed. even though it has a wide variation of different food culture, the flavor is not that good. everything kinda taste the same after a while. the only delicious food is the <mark>Soft-Serve Ice Cream</mark>. and it was expensive compared to a better buffet that we ate in paris las vegas hotel. my friends and i ended up eating lots of shrimp and champange in order to get our money worth spending.", 
            "this place was bomb. the wait was a little long for lunch time and the prices were jacked up cuz of holidays but when we got in and ate, it was pure pwnage. they had a section dedicated to each type of food, from seafood, american, italian, asian, mexican, middle eastern, and so many different types of desserts its not even funny. actually, it is so not funny, that it is funny... ha ha.  \n    the main food that i liked was the usual prime rib because what las vegas buffet doesnt have prime rib... it was bloody, just the way it should be and yes... it became good friends with my mouth. also there were endless king crab legs and shrimp. a meal fit enough for a hilton. the service was good too, never saw the bottom of my glass. thanks omar for all of your great service. keep it up and there will be many more washingtons in your pocket. \n    watever food u can think of they probably have it. the asian part was a little dissapointing tho, maybe because im asian and i know what the good stuff is... i didnt try tthe mexican food or the soup/salad because i want to get my 28 dollars worth of food. the fruit was good too. watermelons were crisp and juicy, and they had lichee which was bomb. \n    for dessert there were so many things it was hard to see what they didnt have. i ate crepe and <mark>Soft-Serve Ice Cream</mark>. also some rugula or however u spell that stuff. the crepe was really good becuase they put strawberries/peaches and glaze on up with chocolate. by the end of the meal i got so full it hurt to breathe. \n   overall this place was the best buffet i went to. aladdin, thanks for the food and freeing the genie.", 
            "i though this place was suppose to be good from what i have heard, but i was sadly disappointed. as i walked up to the cashier, she gave me the price which was about $28 per person, i gladly supplied her with my credit card. she gave me the charge receipt and i wrote the tip amount into the receipt. she took the receipt from me and said there is a problem with me tipping on the card because she already closed the transaction. she said it would be difficult for me to tip on the receipt because she would have to void the transaction and then recharge the transaction. i said that was a silly thing to do. then she suggested that we just charge the tip amount on the card as a separate transaction. i finally said we would just pay in cash at the table. the service wasn't very helpful to accommodate my payment method.\n\nthe seating area was not very spectacular. it felt like a hometown buffet, but with a little more class. the food was not very fresh. the lettuce in the salad was rather wilted and didn't taste very good. i tried a little sushi, but the rice was very hard. my sister told me that when she picked the sushi up, the rice already cracked in half.\n\nthe prime rib and ribs were average. i do have to say the duck was rather tasty. i think this was the best part of the meal.\n\ni tried some of their dessert, but was also disappointed. i felt the chocolate covered strawberries were rather mushy. as i walked toward the soft serve <mark>Soft-Serve Ice Cream</mark> machine, i saw the machine being serviced.", 
            "mmmm delicious!  their seafood section was soooo goood!  the alaskan crab legs were amazing...and they were all halved and cracked so no hard work to dig for the meat.  their desserts were also amazing...i got a cheesecake bite...it looked like it was a scoop of <mark>Soft-Serve Ice Cream</mark> and was delicious.  i also got the banana cream pie, my favorite.  great tasting food for sure!  if they had a wider variety of foods, then i would have given it 5 stars and agreed with it's \"best buffet in vegas 07\" award.  it comes very close in my book though.", 
            "while the idea of eating at a buffet isn't at the top of my dining list, this buffet was the exception to the rule.  everything here was super clean, and very attractive.  my friend and i showed up on a sunday evening, around 6, and the line lasted for maybe 5 minutes for entrance into the eating frenzy!\n\nthere's a wide variety of foods to choose from, such as salads, mexican, italian, mediterranian, seafood, and then good ol' comfort food.  fast forward to my favorite part, the desserts!   yum!  i think i ate more desserts than \"real\" food.  wide variety, but by far what stood out was the warm brownie, that i doused with vanilla <mark>Soft-Serve Ice Cream</mark> and broken up heath bar.  yum!\n\nthis will be a sure stop next time i'm out this way, purely for the yummy desserts!", 
            "i was caught up with vegas fever and had to visit a buffet....  a local recommended this as being the best.  i would agree, it was pretty good for a buffet (i'm not a typical buffet person, being vegetarian it's usually not worth it for me).  definately one of the best i've been to and certainly the biggest i've ever seen!\n\nfirst i was told to get the coupon from those little books, they run a buy one get one free, so that helps with the cost.  line to get in is so long, but moves pretty fast.  \n\nthe place is comprised to stations of so many nationalities, it was overwhelming!  mexican, indian, chinese, american, italian, dessert, etc.\n\nfood was hit or miss...  flaffel and hummus was terrible as was most of the mexican station.  italian was so-so.  indian and american was pretty good and dessert had lots of yummy things including <mark>Soft-Serve Ice Cream</mark>.\n\nif you have to do a buffet, do this one!", 
            "on a trip a few months back, several taxi drivers, independent of each other, all answered, \"the planet hollywood buffet\" when we asked them what they thought the best buffet in vegas was.  sadly, on that trip, we only went to the bellagio's.  i fixed that on this trip out.\n\nwe went for a late lunch on sunday and found that no matter what time you go to a buffet, they are always hoppin with business.  for about $27, you will be given countless options for food.  i had some of the steamed shrimp, a couple of things from the asian station (surprised to see some dumplings there and even more surprised that they were pretty good), a couple of things from the carving station (bbq beef was moist and not dried out, the prime rib had a wonderfully spiced edge), and a few things from the middle eastern station (some hummus, eggplant, and tabbouleh).  everything i tried was good, and i was careful to grab only a spoonful.\n\ndessert was simple:  a helping of some damn good bread pudding with a shot of vanilla soft serve <mark>Soft-Serve Ice Cream</mark> on top.  niiiiice.\n\nthere's a lot of food choices here; bring a cot or sleeping bag if you can.", 
            "this is my favorite buffet in vegas so far.  i like it because it has wide spread of food from all different parts of the world.  there are counters with seafood, asian food, mexican food, italian food, american food, soups, salads, middle eastern food, and of course a dessert counter.\n\nmy favorite was the seafood area.  i liked the baja shrimp salad and the crab stuffed sole.  there was also an interesting seafood enchilada.  \n\ni was happy to find that they had middle eastern food, which is not common in buffets.  i tried the tandoori chicken and it had good flavor (but a little dry).\n\nmy friend said the kung pao chicken from the asian food area was really good (i didn't try it because i can't eat spicy food).  i liked the little baked char siu pork buns.  the crab rangoons were way too salty though.  the egg drop soup was good, but it's hard to go wrong with that.  \n\nthe italian spread wasn't anything special, but it was edible.  \n\nthe dessert bar had plenty to choose from and i had three or four different desserts that i really liked (flan, <mark>Soft-Serve Ice Cream</mark>, cookies).\n\ni've been here twice and i loved it both times.  i definitely recommend it!", 
            "i personally feel this is really the best buffet in vegas that i've been to so far.\n\nthere's a bit of everything and the dessert station is definitely the highlight. so many choices...a cotton candy machine, fresh crepes, <mark>Soft-Serve Ice Cream</mark>, lots of cake, etc.\n\nservice is usually good. servers lag on drink orders at times, but overall it's alright.\n\nthe line for the buffet can be a pain at times, mainly friday and weekend nights, but i'm sure that's standard with all vegas buffets.", 
            "planet hollywood guests get $5 dollar off coupons to the spice market buffet, so how could we resist!! we went during brunch time and our meal came out to less than 20 bucks! pretty cheap compared to other buffets on the strip. although the price didnt come with bottomless mimosas. \n\nwhat i like best about the spice market is the middle eastern section! the chicken tandor, naan, hummus, etc was great! the chicken wasnt even dry. during brunch they also had made to order omelet's! so delish and you can get whatever you want on them. down the way they have the normal buffet food, rib eye, mexican, italian, chinese, nothing that stood out. \n\ni was disappointed when i didnt see crab legs!! i crave for crab legs in any buffet! the seafood section wasnt to grand. although they have serve tempura shrimp steaming hot out of the fryer. the cocktail shrimp was good and they come already peeled and.\n\nthe dessert! they had everything from soft served <mark>Soft-Serve Ice Cream</mark>, cotton candy, flan, bread pudding, red velvet cake, carrot cake, chocolate cake, tarts etc!! they have made to order crepes ( but the crepes are pre made and not freshly cooked!!)\n\nthe wait is not the long compared to other buffets food is good and the waiters are so friendly! highly recommend to try the middle eastern food and dessert section!", 
            "the air was humid, and it smelled terrible. the food was decent - but for a two and a half hour wait to be rushed out of the buffet 20 minutes after paying. oh my god! the <mark>Soft-Serve Ice Cream</mark> machine was turned off less than 20 minutes after we entered the buffet. i got a migraine from the scent heavy air - it made me nauseous. tons of tables were free, but the staff was so lacking that they couldn't even clear off the tables for the hours of lines. i really should have paid more attention to the reviews on here. i wouldn't eat at this restaurant if it was free.\n\nnote: the smell was very very bad - note, it was very humid, note - it was greasy and ..... auggggh so bad... so so so so so bad.", 
            "this place is not like the wynn or bellagio buffets but it's still pretty good. ridiculous line at dinner so make sure to go a little early if you're not a diamond/platinum player. the prime rib was amazing and they had a brick oven for pizza. they also had a <mark>Soft-Serve Ice Cream</mark> machine. (yay!)", 
            "almost as good as google's free food with more options, way better than old country buffet (actually, old country is not even in the same league), and way better than the buffets at the hilton. def worth it.\n\n1. good price. $18 for all you can eat. plus if you stay at the resort, they give you a $5 off coupon (per room, good for four people). \n\n2. so many options! mediterranean bar. mexican grill. asian grill. salad bar. italian bar. dessert bar (so many cakes, breads, pastries, petit fours, tarts, pies, <mark>Soft-Serve Ice Cream</mark>, etc). omelet bar. etc.\n\n3. great food and drink. the coffee was fantastic (this coming from a coffee drinking seattleite). rich. full flavored. strong. the oatmeal was sweet and creamy.  the <mark>Traditional Eggs Benedict</mark> was great. fresh fruit. loved it.", 
            "had dinner here on a thursday evening. i noticed that most of the station cooked meats were very, very dry. the chef said that especially with the mediterranean meats they were preferred overcooked. overcooked and dry meat? i don't think so. the noodles at the asian station were also dry. sitting out too long, or just not enough liquid in the mix? not sure. the mexican, again, the taco meat was on the dry, overcooked side. most buffets the taco meat is way too oily/juicy. this the complete opposite. the carving station had very good prime rib. desserts were also on the good side. nice variety. good soft serve <mark>Soft-Serve Ice Cream</mark>. being diamond level we were \"treated\" to a special fish dish which was very tasty. also got some chocolate dipped brownie rounds which were so good and such a nice diversion from the standard chocolate dipped strawberries. disappointing, but i'm sure they are still moving over to harrah's standards which means they're almost going for a standard flavor across all their buffets. sad.", 
            "the buffet was not bad, but nothing really spectacular. i like how all the sections are labeled in large letters \"seafood\", \"dessert\", \"italian\", etc. i love sweets so i tend to put a lot of weight on their quality of desserts. here, it was a hit or miss with the items. their <mark>Soft-Serve Ice Cream</mark> custard was good, esp with chantilly cream, which was excellent quality. they make cotton candy, which was something new so that was pretty cool too. their fruit tarts were excellent. however, their flan was too stiff on the outside and was more like jello, as was their banana cream pie. the cream was like a stiff block of jello that had been sitting outside for a few hours and allowed to dry....also, their crepes were too thick for my liking. it seemed more like a pancake. \n\nnow their mediterranean section was delicious, and their salad bar delicious as well. their asian section was ok, some of it was good and some was just bland. their pasta was excellent as well.  seafood wise, the selection seemed ok.\n\ni would come here again if someone suggests it, but my first choice would still be wynn.", 
            "my husband & i always love coming here. they have a middle eastern section that is just delish. the seafood is always fresh and so much to choose from, for those of you that like huge crab legs, this is it. the desserts are so yummy. cotten candy, all different types of cakes, <mark>Soft-Serve Ice Cream</mark>, puddings! this buffet is top of the line!", 
            "i don't get how this place gets good reviews. it's like one of the cheapest (quality and taste wise) buffet that i had in vegas. total was $60 sth for 2 for that quality of food? it's not comparable to any other hotel buffets for that same price. \n\nthe quality of the food is just bleh. everything from decor to presentation to taste is just very whatever. my usual favorite part of the buffet - dessert section just completely turned me down. c'mon..soft served <mark>Soft-Serve Ice Cream</mark>??? (not even comparable to souplantations soft served). it's more like hometown buffet quality but hometown is 3 times less the price. \n\nahh. despite the desserts, other food was just not to my taste. it's true that there are a little bit of everything, from american to italian, asian, middleeastern, mexican, etc, but nothing was really that good. probably the best thing that i had was a piece of prime rib that i got when we first sat down. when i went to get another piece later on, they already got a new chunk of meat, and that second piece was complete raw, dripping blood. \n\ni've been eager to try this place because i think this is one of the few buffets that i haven't tried in vegas and with pretty good reviews. not a good decision. i will probably never go back again unless it's free.", 
            "this buffet was pretty standard, but has a good variety of foods.  they have mediterranean, american, mexican, italian and asian.  they only have a little bit of each though.\n\nwe got there at 6 pm on a saturday in the middle of march.  there was no line, and we waited 5 minutes for a table after them scanning our buffet of buffets pass.  note that at 7 pm, we saw the line filled with people all the way back to the escalator.  so if you're gonna eat here, get there early.\n\nthe food wasn't spectacular.  it was just average, though fairly fresh.  my favorite was probably just the desserts.  they had chocolate covered strawberries and cotton candy.  the kids were all over the cotton candy.  it's the only buffet i've seen so far with cotton candy.  the chocolate covered strawberries were huge, but covered in chocolate that normally covers dipped <mark>Soft-Serve Ice Cream</mark> cones.  it wasn't dipped in pure quality chocolate like i hoped, but was good nonetheless.  i say get those as soon as you see them, since they go quickly.\n\nhonestly, nothing else stood out to me, which was kinda sad. they did have warm crab legs, though it seems like all they did was heat up the cold ones rather than pull them out fresh and steamed.", 
            "day 2 and onto our 2nd buffet, we all decided on coming to the spice market. this buffet is located down a set of escalators just inside the miracle mile entrance of planet hollywood. the cashier desk is located in the middle of the buffet. since we already bought a 24 hour pass all we had to do is show our id's and our total rewards card and we were in!!\nlucky for us, that we were seated at a table that was close to the action. large plasma tv's were hanging in different area's and had either mtv hitlist or espn on.\nthis buffet is on the smaller side but make no mistake it holds alot of yummi foods!!\n\nhighlights of the action:\n\ntandoori chicken, hummus, couscous, stuffed tomatoes with ground lamb, pita bread,lamb skewers,tabouleh, chicken in curry sauce\n\ncrepe-making station \n\nall different kinds of salads\n\ntacos,quesadillas,tortillas, guacamole and salsa\n\nham and prime rib \n\nall kinds of yummi breakfast foods:\neggs, bacon, <mark>French Toast</mark>, pancakes, waffles, hash browns and who can forget the made to order omelettes!!\n\npizza, lasagna, garlic breadsticks and pastas with different sauces\n\nshrimp cocktail, sushi (again i wouldnt recommend),crab legs\n\neggrolls, noodles and dim sum\n\ndessert:\ncotton candy (heck yeah)\n<mark>Soft-Serve Ice Cream</mark>\ncookies\npies\ncakes and the list keeps going and going!\n\nour waiter was kind and our water glasses were always refilled when asked,plates were cleared after we were finished as well! only beef i have is when i went to the carving station there was no one there. i waited along with a couple other hungry customers for about 2-3minutes till one of the servers noticed he had a line. geez buddy, if you know its busy then stay out where we can see you!!!", 
            "some of the food were really good, especially the middle-eastern and italian selections. the mexican section didnt have too much... just tacos and fajitas. the asian food was 'ok' but the snow-crabs were pretty good so i couldnt complain. but honestly... for 35 bucks a person... cant they at least serve steak? lobster? something thats actually worth 35 bucks?! the lines were sooooo long. i think no matter when you go, the line will be long. we got lucky and didnt have to wait long since we had a group of 9 people and ended up seated in the back in like a banquet type area for large groups. there was alot of fruit selections and <mark>Soft-Serve Ice Cream</mark> and cotton candy for dessert. overall is was a 3.5... but i'd rather give it a 3 since it really wasnt worth 35 bucks.", 
            "this place wasn't gross, but it wasn't good. i honestly just got a ton of salad and <mark>Soft-Serve Ice Cream</mark>. i'd be pissed if i spent the full price on it but my friend checked in on foursquare so we got a buy-one-get-one voucher so it was like $30 for the two of us for dinner. i guess it was fun to try a buffet in vegas but maybe my expectations were a little too high? i'd rather have spent twice that and had a real meal at a good restaurant.\n\nthe desserts were the best part.", 
            "incredibly delicious!  i went to a time share presentation where we were lied to for two hours with their so called low pressure sales (all lies), but we were rewarded with two buffet dinners here at the the spice market. this was worth all the pain and suffering we went through.\n\nthe highlights:\n\nthe prime rib.  best i have had at a buffet. ever.\nsweet potatoes. yum!\ncrab legs. presliced! couldn't find any butter for it, but still great.\nflan.\nmushroom ragout.\nshrimp tempura\nveggies with the big carrots\ndessert bar, complete with cotton candy and <mark>Soft-Serve Ice Cream</mark> self serve.\n\n\nokay but can skip next time:\n\nbrisket. no taste.\ncreme brulee\ncrepes. yuck.  premade, the chef just heats it up for you. \nmanapua\n\nstaff frequents the tables every few minutes clearing old plates.  as far as refreshments, you have to stop them, they won't ask you.  \n\n\nwarning: the steel spoon for the steamed rice is super hot!  i'm from hawaii and i need my rice, please put some towels or use a spoon with a plastic handle. \n\nthe going price at the check in was about $28 per person.  i would try to see if there are any coupons out there next time around, but the food would be worth it.", 
            "probably one of the only other buffets in vegas i'm willing to eat at, other than wynn's. don't be fooled by my 4-star rating; the food isn't amazing -- but it gets the job done without breaking the bank. i've been here twice for breakfast and lunch, and everything tasted decently yummy.\n\nmy favorites from here are probably the <mark>French Toast</mark> with real strawberries and syrup, most of the chicken dishes, and the soft serve <mark>Soft-Serve Ice Cream</mark> (one of the best soft serves i've ever had). they also have a great dessert selection, including deliciously soft and chewy cookies and cotton candy. yes, you read right, cotton candy. i forget why but for some reason our buffet came with champagne and we discovered that putting cotton candy in champagne makes a fine (and sweeter) tasting bubbly.\n\nno complaints from me!", 
            "this place definitely deserves 4.5stars. i came here monday night and the wait was less than 20 minutes. \n\nof all the buffet of buffet places, this was my favorite. even though people say dessert is best at casear's lago and seafood is best at rio, i think spice market beats them all. even a few of the workers at casear's told me that spice market is best. when were first go here, we had to walk in the back corner at the seafood station for warm crab legs. sadly the warm butter didn't taste that great... it didn't taste like butter at all. i also liked the tempura shrimp, some pieces had too thick batter. the roast sirloin was good, lamb kabobs were okay, some pieces were dry. the middle eastern section was a few people's favorite in my party. i honestly don't remember what i ate here other than warm crab legs, roast beef, sirloin and fruits. \n\nthe desserts here are awesome though. everyone liked the cotton candy and a they don't even care if you take it out. this place definitely has the best creme brulee. it was warm and the sugar cracked seamlessly. the banana creme pie was good, and cream puffs were delicious. i also wanted the <mark>Soft-Serve Ice Cream</mark> but i was just too stuff.", 
            "we went here for dinner $27.99 +tax per person with total rewards card. they have different sections: seafood, asian, american, mediterranean, mexican, soup, salad, dessert. some of my favs included the warm crab legs with drawn butter, mediterranean kabobs, prime rib, and jasmine white rice to go with all of the above. love that they have cotton candy! nice touch! i wish they would have had <mark>Soft-Serve Ice Cream</mark>. they just had the self-seve soft serve. some of our least favorite choices were the asian noodles & hummus. stay away from those.", 
            "the buffet at planet hollywood was decently priced and while it didn't have a larger variety than bellagio, it was decent.  the best thing here was the <mark>Soft-Serve Ice Cream</mark>.  it was some sort of custard <mark>Soft-Serve Ice Cream</mark>.  either way it was delicious.", 
            "i have been to a couple buffets in vegas, and planet hollywood's spice market kind of falls in the middle. it's not bad, but at the same time, it's not great. maybe i've just been spoiled by the awesome crab legs at rio, but spice market's crab legs seem to be flavorless and small. the crab legs were the main thing that attracted me, but i did try out some of the other food. the clams seemed good at first, but then i kept finding fragments of shell stabbing at my teeth. the desserts were good, but then again, i'm not really a big desserts person- put some <mark>Soft-Serve Ice Cream</mark> in front of me and i'm happen. having been to the spice market twice (on different trips), i'll probably avoid it going forward.", 
            "when you're in vegas all you want to do is eat. there's so many eateries that its hard to choose from. buffets are what you think about next to drinking and getting drunk when you're in vegas. i on the other hand can only think about food so i was trying to figure out which buffets to eat at. \n\nafter asking a few locals their top picks for good buffets are at planet hollywood & at the rio. i've been to spices before & remembered that it was one of the best buffets i've had in vegas as well. so, the bf & i came for sunday brunch [for his first time]. he agreed that it was one of the best buffets that he has had in vegas as well. \n\nunder the seafood section the buffalo fried shrimp was delicious! i kept going back for more. it had a slight kick but just the right amount. they had shrimp cocktail as well but you'll get your hands dirty with all the lemon squeezing. with the buffalo fried shrimp i munched on it as i walked to my next selection. it was a great balance because i got to clear my plate and add more while walking it off! \n\nunder american section they have egg benedict as well traditional & one with apple glaze. as i waited patiently for the traditional which ended up tasting like the one with apple glaze because it had a sweet flavor to it. we didn't enjoy it one bit. they ran out of egg benedict and while waiting the guy in the back asked the meat carver to refill the egg benedict so i think without knowing which was what he placed the apple glazed flavor on the regular traditional.\n\nunder the italian section is the mini waffles, pancakes, pizza, etc. im not quite sure why it is under the italian section but it was. \n\nunder mexican section the carne asada fajita was bomb! the chicken fajita was too dry. \n\nthere's a salad & dessert section too. i didn't get any dessert because i didn't see anything cheesecake related & i wanted to save my belly for jean philippe patisserie. they had <mark>Soft-Serve Ice Cream</mark>, crepes, etc.\n\nservice was fair. you can't expect too much at a buffet. while in line they will hand you a sheet of paper so that you can mark off which drinks you want and you can place it on the table while you grab food. so that's definitely convenient and efficient.  \n\nthey also have tv's where you can watch sports. another bonus is they have their very own close by restroom!", 
            "food was delicious and i love their desserts. i would recommend this buffet to anyone.  love the fact that i can walk out of here with an <mark>Soft-Serve Ice Cream</mark> cone with vanilla and chocolate swirl in one hand and strawberry cotton candy in the other!! plus i got a coupon for 2 for 1 so it was only 20 bucks...", 
            "one of the best buffets i have had.  they have meals from many different parts of the world.  my favorite was the chicken kabobs from the middles eastern station that were cooked fresh.  the mexican bar let you make your own combos, they had the salad bar for the health conscience (why are you at a buffet), also italian, asian, and american food.  the dessert section had cakes, cookies, pastries, fruits, <mark>Soft-Serve Ice Cream</mark>, etc...  the price is cheap and the service was ok.  they did have a deal for i believe for about $15 bucks that let you drink all the beer you wanted, but with all that eating, their wasn't much space for beer at that time.", 
            "probably about 100 or so food options here (brunch).  i'm sure they pull out all the stops during dinner, but from what i experienced, the dessert bar is the only reason you should come here.\n\nthe brunch offerings were pretty basic.  there wasn't an omelet bar so that meant any egg you put on your plate was probably in a carton or powdered prior to cooking.  i was surprised that there weren't more breakfast options, especially with sections dedicated to food from specific regions.\n\nwhat's a mediterranean breakfast like?  i still don't know.\n\nthe most popular station was the dessert station.  there were a dozen varieties of cupcakes alone.  you'd also find cheesecake pops, cotton candy, cookies, soft serve <mark>Soft-Serve Ice Cream</mark>, and various danishes.  the only thing missing was some pecan pie.\n\n<mark>Danish & Breakfast Pastries and More</mark> breakfast items...", 
            "my friend & i were just there yesterday & sunday (we got the 24 hr pass for $44.95, $48ish wth tax), we obviously liked it. here's what i liked: tandori chicken- very flavorful, an itialian style baked chicken, bbq chicken, mashed potatoes-i think they were the best i've ever had at a restaurant, creamy & full of flavor, sourdough bread was soft-perfect wth butter, chicken fajitas-i should know this was good, i'm mexican, mushroom concotion- dnt know what its clld but that sh%$ was goooood, pizza-bothe the vegetable & pepperoni, vegetable eggrolls-just the right amt of spices, the ranch dressing-yes, the ranch is awesome, they have a tomato/mozzarella salad that was pretty good 2. here's what i didn't like: no enchiladas in the mexican section-all they had was chkn or beef fajitas, mexican rice (it was ok), whole pinto beans, street tacos (they looked old) & a selection of salsas, guacamole, sour cream, etc. next, the tortilla soup is more like a chunky, spicy tomato soup, not tortilla-although the flavor was good, its defin not tortilla. the chicken fingers were fatty- i took a bite & that was it, i cdnt even swallow that one. the chinese noodles were dry, blah. i was dissapointed in the location 2, its down the escalator below the casino, no natural light. although the decor is nice, it was a little 2 dark 4 my liking. i am not a seafood person, so i can't rate that. i saw ppl eatin they crab legs, oysters & shrimp. they have several beef & pork selections, like bbq ribs & sm other stuff. but again i ddnt try those so } can't rate them. i dnt know if i wd pay the regular lunch or dinner prices though, get the pass, i think its a btr deal. my frnd & i were able to get 3 meals out of it, pretty good at $48 for the strip. lastly, the desserts, hmmmm? ummm, not much of a selection, all cupckes pretty much. they do have tons of flavors though & the ones i tried were pretty awesome. they also have a crepe section, but a small selection of what goes in the crepes. also, a self serve soft <mark>Soft-Serve Ice Cream</mark> machine. enjoy! oohhhh i almost 4got, the waiter we had yesterday was the nicest i've ever had. i ddnt get his name, but he had an accent. cdnt tell where he's frm though :-(", 
            "this is one of my favorite buffets in vegas and it still has the old buffet name when the hotel use to be called aladdin so caesar's entertainment is still lagging on the planet hollywood renovation. \n\nbut anyways this buffet is located on the basement level of planet hollywood and when the lines get really long particularly on the weekends, it can snake around the casino towards the strip entrance. they even offer you to move to the front of the line for $20! but if you are a highroller for their total rewards program then you have your own line to avoid this cluster fuck. i prefer the mlife program because they have better buffets and nicer resorts (bellagio, aria, mirage, ny ny, monte carlo, mandalay bay  and the lower tier luxor and excalibur).\n\ni always experience great service here except for a few that are minor, the food is just your typical vegas buffet and not over the top like the buffet at bellagio and wynn also the new bachannel buffet at caesars (really impressed).\n\nthe decor is just plain with movie posters all around the buffet and the staff has their favorite movie posted on their name tag i thought was pretty cute. the dessert station was the best with the fresh made cotton candy, lollipops, crepes and the usual cakes and gelato <mark>Soft-Serve Ice Cream</mark>. this isn't on the top of my lists for buffets but i wouldn't mind coming back.", 
            "the best buffet!!! the crab legs are already opened for you and they taste great!! they have 3 different types of sushi. they have spicy tuna (the best roll there), california roll (i think), and crab (eh, not my favorite). the sushi was pretty good i must say. \n\nseafood like meter: 98% \n\nthey have lamb there, it tasted delicious!! they also have squash. by the way, they have a variety of \"fancy\" meats and squash on swords. you should definitely check that section out!\n\nfood on a sword score: 10000000%\n\nomg, the deserts are like your swimming in a pool of hot fudge chocolate with cotton candy trees and chocolate bunnies surrounding you!! they have like 100 different cupcakes. i recommend getting the s'mores, that is the best cupcake i've eaten in my life!! they also have <mark>Soft-Serve Ice Cream</mark>. chocolate and vanilla. and they have cotton candy! yummy!\n\ndesert score: 100000000%\n\noverall, the spice market buffet is the perfect buffet for anyone who has a big appetite. you are going to have to check this out yourself to see if you like it! i am for sure coming back here!\n\noh i almost forgot $20 bucks a person... it's worth it! :)", 
            "cotton candy......... prime rib....... put them together..... well.. i don't recommend you putting them together.. (it does sound good tho) i just wanted to emphasize two things that stuck out when i was there ;) \n\nyet another place to check out while on your gluttony/ sinful vacation in vegas... \n\nlocated downstairs of the planet hollywood hotel is a buffet with a lot of spice appeal with different sections of countries like: american, middle eastern, mexican, asian, etc etc.. its not as big compared to other buffets i saw but its not bad at all. lots of flavor, lots to choose from.  u gotta try the steaks and prime rib.. hella tender and lots of fat content.. ;) the desserts with their cupcakes, <mark>Soft-Serve Ice Cream</mark>, cakes, cookies and the cotton candy was a pretty nice touch as well.. my daughters favorite.", 
            "the food was pretty good for an american buffet. yes, i say american because even though there were different \"countries and styles\" they did not feel ethnic enough. \n\nyes i'm that picky ;p. my family got there early on a saturday around 6-7, the line wasn't too bad then, but later on....ehh. \n\nthe most interesting and colorful display was the desserts. it had a crapload of cupcakes, cotton candy, <mark>Soft-Serve Ice Cream</mark>, and those key desserts on separate plates. the cupcakes were the only things i was disappointed in, they have so many! they look so good! but the red velvet didn't taste that great :(\n\nif that groupon did not exist, i don't know if i would be able to eat here and not feel bad for my wallet!", 
            "this was the 2nd of our buffets on our 24 hour pass.  we got there about 4pm.  place was super dead on monday, and now i know why.  i also know why i hadn't been there before, and probably won't be back.\n\nfirst, it's in a basement, and feels like it.  very dark and not very inviting.  they had a lot of food, but nothing super special, except the crap legs.  the deserts are mainly cupcakes.  lot of the them.  different flavors.  they were labeled.  cupcakes everywhere.  ok, they did have some cookies and soft serve <mark>Soft-Serve Ice Cream</mark>, but every chinese buffet has that.  \n\nthe service was extremely lacking.  they lost our receipt so had to ask for our drink order again and then it took awhile for it to arrive.  they weren't paying attention to us so i never received a refill on my diet coke until i was ready to leave, even after trying to flag someone down.  again, they weren't that busy so not sure what the problem was.  \n\nthe biggest thing for me though was still the environment.  it just didn't contribute to a pleasant dining experience.", 
            "we dined here monday september 9 for dinner & all you can drink using a groupon. \nas far as strip buffets go this one is a keeper! the staff is friendly & service is attentive. we opted for champagne & glasses were kept full. the space is large but cozy with no overpowering lighting & the food selections are amazing. i wish we could have sampled more but it is wise not to overindulge at a buffet though this one is surely tempting. the selection of pre split crab clusters both hot & cold is a highlight. i prefer the cold as the heated can be a little dry. however if you like it hot the asian section has some spicy hot crab (not pre-split) that is out of this world. another highlight is the shrimp tempura which is done just right & delicious. desserts excellent as well if you have room but maybe addition of some premium <mark>Soft-Serve Ice Cream</mark> or gellato would be a plus. generally do not like background music but the version here is less annoying than usual. highly recommended", 
            "my wife and i were looking for a buffet on the strip and saw this discount ticket for the buffet so we decided to try it out without doing any research. \n\nwe waited in along for a reasonable time (for vegas), about an hour  in the early evening. however, after paying we waited a long time to be seated. there were only three employees seating customers and they were also also doing things at the register, helping with drink orders, and things like that. there were many open tables that were ready to go. \n\nfinally seated, we went to the food and it was quite lackluster. it's divided by cuisine (middle eastern, american, seafood, etc) and many of the items just looked like it had been sitting for a while.  it was just very disappointing. \n\nfunally desserts. we love desserts and a big portion of the desserts are cupcakes. not everyone is a fan, and also no one wants to eat a full size cupcake. buffets are about sampling lots of items. crepe station seemed okay. soft serve only, no real <mark>Soft-Serve Ice Cream</mark>. \n\ni think i would've been happier just eating at mcd's. i hate mcd's.", 
            "we weren't looking for something hoity toity.. and we didn't want to spend $50+ for a buffet meal on new years day. this was a solid option aside from the long wait that we experienced to get a table. we were disappointed to peek over the wall and find entire sections of 10-12 dirty tables with one busser slowly working each table, as we stood and waited for a place to sit. the drink servers/table clearers do hustle but they are likely overwhelmed with the amount of tables they have. our server kept up on drinks once we were able to order them.\n\nour group didn't do the drink package as we didn't feel it was needed or worth it. \n\nthe food? it was just fine.. split crab legs, prime rib that was tasty and not chewy, good fried chicken and plenty of salad options/toppings. they tried to do a little of this, and a little of that.. but it's possible that their quality diminishes because of it - ie. sushi. sushi shouldn't be on the buffet unless it's an entire station of just sushi and it's made fresh in front of you by a sushi chef. one platter of sushi on the seafood spread is a little scary to me. \n\ndesserts were all delish.. we had cupcakes and cotton candy and <mark>Soft-Serve Ice Cream</mark>, as well as flan, mousse cups <mark>Danish & Breakfast Pastries and More</mark>.\n\nwhile in line, i chatted with the ladies in front of me who indicated that they'd been at the buffet a couple of years ago and it was good. i had hope! it's not horrible.. but it's not like some of the top rated buffets on the strip. of course, it wasn't $65 for a meal either.. :)", 
            "this is not the fanciest buffet in vegas but it is one of our least expensive favorites.\nlocated inside the planet hollywood casino spice marked puts on a good spread at a reasonable price.  the food is good quality and average to good in taste.  the real star of spice market is the large variety of moist yummy cupcakes in the desert station.  there is at least a dozen varieties of cupcakes!  the soft serve <mark>Soft-Serve Ice Cream</mark> is the same custard type of <mark>Soft-Serve Ice Cream</mark> served in the paris buffet and it is simply my fav.\n\nthere is also a groupon currently available for two including \"all you can drink\" alcohol :)", 
            "we tried the brunch buffet in ph on saturday afternoon. the wait was there - around 30 mins. in many ways this is your typical vegas buffet, but i loved the food and the service. \ni almost paid double the amount for the cosmopolitan buffet the last time and there was, double the wait, half as much variety, poor service and they stop refilling items after a while. the drink service here was prompt and great. they included all sorts of beer, wine, mimosas, sodas, ice teas, etc. in the brunch. mimosas were really nice. the staff was friendly and efficient.  \n\nfood - i am usually not a huge buffet fan, but everything that i tried was tasty. they have seafood, breakfast, mexican, mediterranean, italian, country and an asian section and a huge desserts variety. the mediterranean section had some succulent lamb and chicken options. tons of vegetarian options overall - , nachos, hummus, soups, salads, 3 types of veggie pizzas, noodles, rice, tofu, veggie spring rolls and much more. the desserts section was fantastic - exquisite cupcakes, candy floss, <mark>Soft-Serve Ice Cream</mark>, cheesecakes etc. there were also made to order eggs, crepes, pancakes and fresh waffles. \n\ndefinitely give this place a try and don't think twice if you are a vegetarian, you will have plenty of options. if you want a good buffet for a good price, spice market is the place to try!", 
            "after waiting in two separate lines, one to pay and another to be seated, for what seemed like forever, we were finally able to sample the food from the various ethnic stations. i believe there was a mexican, italian, asian, middle eastern, american, seafood, soup and salad stations as well as dessert. to keep this review on the shorter side i'll say that the food i tried from the various stations were all pretty good for the most part but there were one or two items from the various sections that i didn't think were that good compared to other places. the pork fried rice in the asian area, was one let down. it had a weird taste and there was little to no pork in it at all. definitely a dish that needs to be revamped. the pork buns were very delicious and for me, it was the highlight of the asian area. each station only has a few items to choose from which was pretty disappointing. i guess i just expected a little more variety from each station than what we were offered.\n\n the dessert station was pretty nice in my opinion. the variety in this area was satisfying. there were various flavors of cupcakes as well as different mini cakes, pastries, tarts, cotton candy and even <mark>Soft-Serve Ice Cream</mark>. there was so much i wanted to try but had to keep my sugar intake to a minimum. most of the delicious treats they offered i just took a bite of just to say i tried it. there was something there to satisfy anyones sweet tooth for sure. now back to the food stations for a sec. if i had to choose a station i enjoyed the most it would definitely be the middle eastern one. most of the offerings at that station were just delicious! i had the tandoori chicken, lamb, beef kabobs, curry chicken and curry lamb and they were by far my favorites in the entire buffet. oh, and the mac n cheese in the american section was the best i've had out of the two buffets i've visited in vegas. \n\n the service here was pretty good. our server was great about keeping our cups filled and our empty plates off the table. overall it was a satisfying experience and i would come here again in the future but they should definitely try to add a few more dish options in a few of the stations that were lacking.", 
            "we went because of a groupon it was only $45 for 2 which included unlimited beverages including alcohol ( you also need to pay tax at the restaurant $3.65).  i gave it 3 stars because of the price otherwise i may have given it 2 stars.  the food was adequate - the ribs were dry with an unnecessary kick, fried chicken was flavorless, general tso's chicken was as dry as we every had, the ham from the carving station was dry, and many items were just too ordinary.  having said that for less then $49 you got unlimited drinks and food.  the mexican and salad stations were good as was the pizza from the italian station.  we don't eat seafood but there seemed the be a lot of choices including crab legs.  desserts were mostly assorted cupcakes that were okay.  they also had a crepe station and soft serve <mark>Soft-Serve Ice Cream</mark>.  the stations included chinese, american, italian, mexican, mid-eastern, and dessert.  i could recommend with a groupon but not for full price.", 
            "i kind of don't understand the negative reviews if you compare it with \"the buffetts on the strip\". now i have not tried the caesar palace buffets which seems to be a good one. but i have tried a handful abd this one seems to be pretty good. i give it a four and not a five because i specifically wanted the tandoori chicken skewers and was there for dinner yet they only had lamb. it would help to remove the sign as well.\n\nfood selection is versatile and very satisfying. they have two different salad bars which include healthy choices and a good variety. entire seafoid bar. the middle eastern food was very well executed and the variety was so fresh. the mexican food was fresh and the chicken fajitas were so tasty. their breads on both sides of the restaurant are so delicious.\n\nomg the dessert!!! crepes made to order. fabulous creme brule, and a variety of cupcakes that is so overwhelming. cotton candy, <mark>Soft-Serve Ice Cream</mark>, other tours if cakes, cobbler, bread pudding. if you want to try one buffet this should be it.", 
            "out of the 3 buffets we ate at from our buffet of buffets tour while in vegas, this was the best one out of the three.\n\nthe variety they has wasn't bad and i especially liked the prime rib the most since it was served medium rare and wasn't tough or chewy like the one at paris buffet. the crab legs were also good and i was only able to eat a few since i was so tired of eating the same foods after three buffets.\n\nthe interesting new items i tried were the country fried chicken in little small baskets which was tasteless and very bland. it was moist and juicy, but lacked any flavor. i also was able to try the fish and chips also served in small baskets and it also lacked any real flavor. it seriously needed some tarter sauce to help give it some taste.\n\nthe dessert area looked great with the many different kinds of cupcakes they had with multiple flavors to choose from. too bad i wasn't able to sample any, but i did have the vanilla <mark>Soft-Serve Ice Cream</mark> and it was just terrific. i'm not sure how they make it from custard cream, but it makes a big difference from your standard <mark>Soft-Serve Ice Cream</mark>. it was very smooth and creamy like. my gf had the cotton candy from here and it was a nice big size plus i was surprised she was able to finish it after her meal. \n\ngood buffet option for me to come here again the next time in vegas and to come here first on my next tour of buffet of buffets.", 
            "we arrived a little after 3pm with a group of 20, including 16 with special needs.  no line, plenty of empty tables and we gave our groupons and had to pay $2.49 per person extra ( tax?).  they wanted us to pay $100 for gratuity to sit together in the same empty area; another union rule.   more later on that.  i said no problem, we aren't moving since we were already seated, but told them they just lost any additional tip we were planning on leaving above the $100.  this is union policy, i was told again.  well, keep your union policies.   those are the workers the union protects..  good for the union.  the service was awful, the food was just as bad and i would never recommend this place to anybody who has any food taste/class.   as soon as we finished, i had two vomit ( un- sweetened tea must have been off temperature).   none of us ate more than a bit of anything.  most items weren't labeled so the one with a seafood allergy, ended up with seafood in the pasta.   not labeled.   chicken noodle soup isn't a selection of soup.  it was the only choice.   desserts were just awful.   the best was the <mark>Soft-Serve Ice Cream</mark> and it can from a machine.   don't go,  not recommended; rather stay hungry than eat this rubbish.  service was terrible, but then again, unions only hire the best workers...wrong...least motivated.... yes!   fool me once...never again.", 
            "fast line for the food since it's a tuesday. went here for lunch and i'd recommend this for people who love to eat american/ comfort foods. fish and chips, ribs, and quesadillas. definitely try their couscous!!! so delicious the flavors exploded in my mouth. top it off with their glazed carrots. waiter was kind but kinda slow. it's okay since the buffet was $20/ person. they have lots of pasta like seriously lots. lasagna, mac and cheese, penne pesto, pizza, etc! plus lots of vegetarian choices including mexican. i dare you to make yourself a milkshake. ask the waiter for a  separate cup and run to the dessert section. their vanilla soft serve is surprisingly different and creamier. toppings are glazed strawberries, oreos, and heath. my favorite. put strawberries on the bottom of the cup then swirl up the vanilla <mark>Soft-Serve Ice Cream</mark> til the top and put more strawberries and finish it with whipped cream. try it!!!! they have a lot of cupcakes too. it's decent. go for the couscous.", 
            "each time my family frequents the las vegas strip on holiday, we set aside one night for a dinner buffet & this time, we finally visited the spice market buffet! \ni really liked this one because of its wide layout & full selection - to me, it seemed longer/ larger in size than most other vegas buffets... meaning that the various kitchens were seen stretched out across a huge plain in a way that actually took some time to get through \nluckily, we spent some time walking around the shops in the miracle mile before coming here, to make sure were hungry & super ready once we got started :p\nas far as the food options here, i found that there were plenty of non-meat dishes alongside the meat ones, so it was, i.m.o., an acceptable buffet for someone with a vegetarian diet (and perhaps somewhat accommodating for a vegan). the title categories in this buffet include, seafood, salad (on both ends of the room), italian, asian, american, mid-eastern, & mexican. the seafood seemed traditional (paella, crab legs, stuffed fish, sushi, etc.) but very decent in presentation, salads were mostly prepared mixes, next to some free toppings & leaves, & the rest housed all the usual/ popular items you'd expect: pizza, pasta, lasagna, dried meats & cheeses, lo mein, fried rice, thai eggplant, egg rolls, dumplings, fried chicken + biscuits, steamed vegetables, prime rib, (mashed and au gratin) potatoes, tabbouleh, hummus, stuffed grape leaves, curry, naan, curried cauliflower, lamb, & veggie kabobs, rice, beans, tacos, tamales, quesadillas, salsa, guac, & other toppings, with tons of bread! i found almost all the food i tried to be pretty good but i specifically went back for the eggplant, curry sauce, & veggie kabobs more than once :)\ni was, however, sad to find that the soup (both miso & tortilla varieties) were way too salty for my taste, even though i love salt & i love soup! lol i was also disappointed with the dessert table, as it strongly lacked creativity or any sense of variety compared to all the other buffets i've been to. besides the watery bread pudding & some nasty-looking, canned fruit crumble thing, there were not many other plates laid out. i saw cr\\u00e8me br\\u00fbl\\u00e9e, mini cheesecakes, small parfaits, & <mark>Soft-Serve Ice Cream</mark> but other than those... there was nothing more than 10 different kinds of cupcakes. for the cupcakes, they had some very simple flavours like mint choc chip, chocolate raspberry, cannoli, bananas foster, strawberry shortcake, keylime pie, s'mores, & cookies + cream... which may sound good to some people but i would have liked to see something other than cupcakes... since it is a buffet & people will most likely be returning to the dessert bar more than once, i think they would do better with a bigger selection (i.e. fruit, custards, cakes, brownies, & other crap that people only allow themselves to eat on vacation :p). however, they do offer a \"chef's special selection\" that i'm guessing they change frequently, which happened to be some pre-cooked (then reheated) cr\\u00eapes w/ nutella & sugared-bananas that night\n\nwe came around 10 p.m. (1 hr before closing) on sunday night & were treated very well in the v.i.p. section - plates cleared often, drinks constantly refilled, social/ talkative waitress, & all food items present & filled as if it was still an early dinner hour... so we really enjoyed ourselves at this buffet & would easily return even with our plans to make our way through all the others on the strip :d", 
            "i read several reviews on here before going to try the breakfast buffet on sunday. the whole process to pay and be seated was horrible and staff was rude. i should have left then. at 10am they started to put up the breakfast items, which was strange for brunch. mimosas were so disgusting. they did have a small omelet station with 4 pans. the chef was only making one omelet to completion before starting another. several angry people in line. desserts were all stale and even the <mark>Soft-Serve Ice Cream</mark> was runny and tasteless. i could not even put it in the sugar cones. this experience should have foreshadowed the food poisoning i got. by 3 o'clock i had to lay down and did not wake up till 10pm to be physically ill. this was all that i had eaten and i washed my hands/ used hand sanitizer after playing machines. bad service, bad choices and selection, poor quality, and the food makes you sick. avoid! no buffet should be able to ruin breakfast. attaching a pic of my burnt <mark>French Toast</mark>.", 
            "this was a bummer. we got a groupon and came at the right time (5pm) so it wasn't too pricey and we had almost no wait but our waitress really sucked. also the soups were cold coming out of the pot. the food in general was eh. the carrot cake was dry. my two favorite things were berries in cream and the strawberry short cake. the <mark>Soft-Serve Ice Cream</mark> was good too, and i liked the ribs alright but my husband didn't. ironic for a place to be called spice market but lack in flavor.", 
            "so-- i'm a pretty laid back eater... there's not much i don't like and i'm truly not picky... that being said, i thought this buffet was mediocre at absolute best!!! :-/\n\nreading the mixed reviews, i decided most people giving bad reviews were picky. (lol) \nand i went anyway. after all- i purchased the buffet of buffets pass for $60 w/tax and this was one that was included in the price. so why not go see for myself? \n\nwell.... i went here specifically because i was interested in having some middle eastern cuisine. \nin this section, they offered basmati rice, tabouli, couscous, lamb kebab, chicken curry, roasted cauliflower, as well as pita bread, hummus, and tzaziki sauce. \nmy first plate at the buffet was a full plate of all these things. everything was average and the curry was a notch above average. i tried everything. didn't hate it but wasn't impressed. and the basmati rice, which is usually my favorite part, was crunchy. flavor was good, but i definitely needed to be cooked longer. :( \nthe lamb was pretty dry and gristley too, which was disappointing after reading one review about how tender and amazing it was. \nthey also offered a mexican, italian, and chinese section of which i couldn't find one thing that looked mildly appealing. \n\ni tried out the american section and had the prime rib and \"yukon\" mashed potatoes (i read a review to try them... not sure what yukon style potatoes are and i didn't find out by eating them...? (just mashed potatoes with a yellow tint) \nthe prime rib was decent and they offered horseradish and horseradish cream \n\nthe seafood seemed to be a pretty high traffic area. crab legs, mussels, shrimp, etc... \ni tried the three of these things. crab legs were good, the shrimp and mussels.... :-/\none thing that i found alarming-- they were piling new crab legs and shrimp on top of the ones that have been just sitting there. sure, i said it's a high traffic area, but what happens at the end of the day when i get the bottom of the barrel crab leg that's been there for hours... ? ew.\n\nthen there's the dessert bar. sounded promising from fb reviews. and looked promising(see pics) \nbut it was not as promised. not at all. \ni found myself picking up dessert after dessert and taking only one bite in order to find something that wasn't golden corral bland!!! \ni must've tried eight different items and opted to save the calories for something satisfying and tasty. \nalso, the coffee i got to go along with it was absolutely horrid. so strong that i added the whole carafe of cream and it was still completely undrinkable.\ni finished my meal, and then one last time checked the reviews on yelp to be sure that i had tried every item people talked about being worth anything. \n\nthen i remembered-- the cotton candy! \neveryone raved about them having cotton candy. so i questioned myself. could i have possibly missed it? \nright back to the dessert section i went. still didn't see it. well i asked the lady working behind the counter and she was very friendly. she quickly went to the cotton candy machine (located behind the counter and behind the <mark>Soft-Serve Ice Cream</mark> soft serve machine) and made me my very own cotton candy puff. :-) yay! \nthe only thing that saved this place from getting one star is the cotton candy!!! \n\ni forgot to mention... my server was rude and short with me, but did keep my tea full and my table cleared. \nand the oj tasted funny too. \nhahah did i say i was a laid back eater?????", 
            "very disappointing!  this used to be a great buffet but after having dinner here last night, i would not return. it's basically a large old country buffet. the food quality is average at best and while they have a variety of international stations, the offerings are very basic.   i normally clean my plate and leave little waste, however i barely ate half of the foods that i selected. additionally the service is poor - none of their workers from the cashiers, to the waitstaff, to the line cooks seem to care about the customers. they barely go thru the motions and are very slow.  an example is i grabbed a creme br\\u00fbl\\u00e9e (which wasn't very good) for dessert and i asked the attendant at the dessert area for a spoon as they only provide a fork and knife at the table. she told me they were by the soft serve <mark>Soft-Serve Ice Cream</mark> machine., but there were none. i told the attendant and she told me to go to the soup area. the soup area also was out. ended up tying to eat dessert with a fork. \n\nthis buffet brought me back to old vegas where you'd get a somewhat crappy buffet for $9.99 - expect that now it's $30. \n\nskip this and go next door to the buffet at paris or spend a few dollars more and go across the street to the buffets at aria or bellagio."
        ], 
        "dish_name": "Soft-Serve Ice Cream"
    }, 
    {
        "text": [
            "sbc vegas series: 6 of many reviews\nwhere to eat where to eat? i remember back in the day that this used to be reputedly the best buffet in vegas.... hmmmmmm\n\npeople wake me up to head downstairs for some grub... a lil too much grub. i finally realized why i gave up buffets in the first place.. i can't stop knowing that there's more <mark>Danish & Breakfast Pastries and More</mark> for the taking. grant it there is a lot of food... enough food for days of binging. they got asian, mexican, italian, and then some. looks like one of the the boats off of dangerous catch off loaded here. \n\nbut honestly, i wasn't that excited by it all. nothing really grabbed me by the taste buds and kicked me in the face. i am much more about quality than quantity... most of the time that is. the most appetizing item in the whole place walked out as i walked in wearing next to nothing in 2 inch stilletos. \n*sigh of resignation\no_0", 
            "for $14.99 for a breakfast buffet, this place was a great deal for the quality! and they had everything.  on top of that, it was an even better deal since we had a $25 voucher from the hotel.  they had everything from eggs any way you want them to french crepes.  except the french crepes were filled with a lot of preservatives. :(  there were sausages, oatmeal, smoothies, bagels, fruits, pastries, ham, potatoes <mark>Danish & Breakfast Pastries and More</mark>!! \n\ni wish i was able to eat a lot more physically.", 
            "got the \"buffet of buffets\" 24-hour pass to harrah's buffets back in may 2010, and tried:\n1. le village buffet @ paris\n2. emperor's buffet @ imperial palace\n3. carnival world buffet @ rio\n4. spice market buffet @ planet hollywood\n\nour last stop before heading out of vegas.  we felt like we hit rock bottom after having experienced the emperor's buffet.  and it was a definite improvement to revisit a sure-thing at rio.  the buffet at ph seemed much cleaner <mark>Danish & Breakfast Pastries and More</mark> modern than the rest, so our anticipation was higher.\n\nwe were promptly seated, and there were even tvs that showed the game.  and they even had real cloth table napkins!\n\nthe selection wasn't amazing, but the quality was a half-step up from rio, and a whole flight of stairs above imperial palace.  and yes, i referred to the buffets by their hotel name.\n\nmy friend really liked the chicken soup.  ok, she loved it.  but i suspect she \"loved\" it cause she was hungover, and the ambience was such an upgrade from imperial palace.\n\ni had to glance at the photos i took to jog my memory, and i got a dessert plate with 4 things.  it looked good, and i remember finishing the plate (instead of leaving it half-eaten like the dessert at paris).  the next pic was of us standing at the exit giving a thumbs up.  good way to round out the weekend.\n\ni'd go back... if i had the 24-hr pass.  again, not good enough to warrant a trek over and at that price.  oh, and, again, i'd have given this place 3.5 stars if i could, but... well, see my review on le village buffet.", 
            "stood in line for about an hour after a long nights drive <mark>Danish & Breakfast Pastries and More</mark> on the strip, i was starving! we waited upstairs and were let onto the escalator where i thought we were to be seated, but nope! there was about another two hour long waiting line downstairs! i immediately left very hungry and pissed off and could tell the others in line were just as mad as i was. p.s. the service is lousy. the guy letting people downstairs was a jerkoff. went to cabowabo instead.", 
            "i love how there was a variety of stations of food to choose from, like american, asian, italian, middle eastern, mexican, soup <mark>Danish & Breakfast Pastries and More</mark>. every thing that i dumped on my plate was delicious, well mostly... \n\nit was pretty disappointing when it came down to the crab legs, damn it those were the ones i was looking forward to. & i couldn't find any \"buttah\"... the hot and also the cold crab legs were just too salty. and trust me i love to sprinkle my food with salt, to the point that i should \"halt the salt\", but this one i just had to push it away to the side.   \n\n& since i was hung-over after my first night... lol i asked for some apple juice. i don't know if it was just me hella hung-over, but that was the best fxckin' apple juice i ever had, ever!!! it was so good, it quenched my thirst and i love how the waitress put some ice in my apple juice, even when i asked for a re-fill. heeey, most people just don't do that... so i tipped her. see it's the little things that count too and i do take notice of, ya know.\n\nanyways... if your planning a trip to vegas, i highly suggest you get the buffet pass, all access to eat at 7 different buffets, valid for only 24 hours, for $49.99 (non- member)!!! com'on, you can't bet that offer. this buffet pass saved me $$$ and it will for you too!\n\nbuffet pass info: http://www.caesars.com/buffets/faq.html", 
            "it pains me to say this...but this buffet experience (december 2011) was really not good. \n\nwait:\ni've been to spice market a half dozen times over the last decade and this meal was a far cry from the flavorful buffet i remembered from past visits. the wait was long, which i expected, but we were briskly instructed to move along in the downstairs maze by a cashier, which i found to be unnecessary (felt a little like cattle!). once i paid for two dinner buffets ($67 for two adults...dang), we waited another 10 minutes before being directed to our table. \n\nservice:\nwe loaded up on our first plates...no utensils initially required since we went for mexican fare. good thing, since no server came by. i had to ask one of the employees directing people to their seats for our silverware. halfway through our second plate we finally managed to wave our server down to get drinks. which were never refilled. \n\nfood:\ni used to love the spice market for its good quality and variety (which one should expect for the price). mediocre at best, truly. lots of lukewarm, borderline bland dishes. the middle eastern station was best, with decent dolmas <mark>Danish & Breakfast Pastries and More</mark> vegetable dish. dessert were also fine, but italian, seafood, and mexican were pretty crummy. big bummer, since i'd been awaiting a gigantic, amazing feast after a 10 day climbing trip - and it was nearly the equivalent of my entire food purchases over the previous week of adventures. \n\nwill definitely avoid this buffet on future trips.", 
            "probably about 100 or so food options here (brunch).  i'm sure they pull out all the stops during dinner, but from what i experienced, the dessert bar is the only reason you should come here.\n\nthe brunch offerings were pretty basic.  there wasn't an omelet bar so that meant any egg you put on your plate was probably in a carton or powdered prior to cooking.  i was surprised that there weren't more breakfast options, especially with sections dedicated to food from specific regions.\n\nwhat's a mediterranean breakfast like?  i still don't know.\n\nthe most popular station was the dessert station.  there were a dozen varieties of cupcakes alone.  you'd also find cheesecake pops, cotton candy, cookies, soft serve <mark>Soft-Serve Ice Cream</mark>, and various danishes.  the only thing missing was some pecan pie.\n\n<mark>Danish & Breakfast Pastries and More</mark> breakfast items...", 
            "we weren't looking for something hoity toity.. and we didn't want to spend $50+ for a buffet meal on new years day. this was a solid option aside from the long wait that we experienced to get a table. we were disappointed to peek over the wall and find entire sections of 10-12 dirty tables with one busser slowly working each table, as we stood and waited for a place to sit. the drink servers/table clearers do hustle but they are likely overwhelmed with the amount of tables they have. our server kept up on drinks once we were able to order them.\n\nour group didn't do the drink package as we didn't feel it was needed or worth it. \n\nthe food? it was just fine.. split crab legs, prime rib that was tasty and not chewy, good fried chicken and plenty of salad options/toppings. they tried to do a little of this, and a little of that.. but it's possible that their quality diminishes because of it - ie. sushi. sushi shouldn't be on the buffet unless it's an entire station of just sushi and it's made fresh in front of you by a sushi chef. one platter of sushi on the seafood spread is a little scary to me. \n\ndesserts were all delish.. we had cupcakes and cotton candy and <mark>Soft-Serve Ice Cream</mark>, as well as flan, mousse cups <mark>Danish & Breakfast Pastries and More</mark>.\n\nwhile in line, i chatted with the ladies in front of me who indicated that they'd been at the buffet a couple of years ago and it was good. i had hope! it's not horrible.. but it's not like some of the top rated buffets on the strip. of course, it wasn't $65 for a meal either.. :)", 
            "we bought a groupon, two dinner buffets, with unlimited drinks, and that day groupon special, $36.75 not bad. the food pleasantly surprised us, better than kumi in mandalay bay (sad to say). but the unlimited drinks such as the wine, was kind if nasty. they come in water glasses so they don't have to bring you more <mark>Danish & Breakfast Pastries and More</mark> and the wine tastes dirty, like cheap wine does. but the food was totally worth the money. they had a lot of things vegetarians would eat, since i have recently become one ( 6 weeks now), with salad and pastas, grilled veggies and seafood, even cheese quesadillas. of course they do have the standard meat options and some brazilian style skewers as well. worth the try, very underestimated.", 
            "spice buffet is located in planet hollywood. they have stations split by cuisine from italian, mexican, american,  mediterranean, seafood, <mark>Danish & Breakfast Pastries and More</mark>. don't think i ever tried from the italian. i pretty much stick to the rest of the stations, mainly seafood. at one time was my favorite buffet, but each time we come here the food has just been ok. on the bland side really. i like the fact that the crab legs are already kind of cracked for you. i could eat my weight in crab and the prime rib is delicious!", 
            "in vegas for breakfast and in the mood for some delicious steak, bacon and custom eggs?  looking for blueberry pancakes, waffles and crepes?  in the mood for some elote, tandoori, prime rib and a plethora of other random food choices?    \n\npurchase the travelzoo to get all this <mark>Danish & Breakfast Pastries and More</mark> for two people for only $40!  \n\nif you're staying at ph or walking distance, spice market buffet (originally choices buffet) is worth a visit.  with so many places to eat in vegas, spice market buffet was surprisingly satisfying and didn't break the bank especially with the travelzoo, giving me some extra cash to put on red/black."
        ], 
        "dish_name": "Danish & Breakfast Pastries and More"
    }
]