[
    {
        "text": [
            "this is a small california based chain. the atmosphere at the sushi bar is ok but needs work. for example, when you first arrive, you are greeted loudly (good). however, after that most of the sushi chefs are silent. only one chef (left most, perhaps the most senior) was a little talkative. on the positive side, the patrons were very friendly; i don't know if this is normal, or was just a coincidence.\n\nin my two meals at the sushi bar, i've tried:\n* ankimo (steamed monkfish liver). five medium slices; firm, with a very rich texture. excellent.\n* uni (sea urchin). pretty good, but wasn't as firm or tasty as it could be.\n* ama-ebi (raw shrimp). good overall. the heads were served tempura style, but were not as juicy or as crispy as they should be.\n* awabi (abalone). good\n* unagi (barbecued eel). pretty standard. it should have been hotter and a little crisp.\n* hamachi (yellowtail). good.\n* smoked salmon wrapped ankimo topped with toro tartar, uni and caviar. it also included a layer of spinach, and gold leaf was placed on top. there were three pieces, each piece too big to eat in one bite, so eating it was tricky. other than that, it was very tasty. \n* bincho maguro (albacore). seared, topped <mark>Accompanied with your choice of one</mark> and a vinegary sauce. good to very good.\n* kohada (shad) served with shiso leaf. moderately strong flavor, but milder than other similar fish (like saba/mackeral). very good.\n\n\nthe sushi was generally very good, but not quite up to the standards of hyakumi or okada. it was cheaper than hyakumi but no cheaper than okada. keep in mind that i'm comparing sushi roku to my two favorite sushi bars in all of las vegas.", 
            "japanese food + fine dining = usually not a logical mix unless we're talking omakase or kaiseki. however, sushi roku did a pretty good job of taking care of my friends' birthday dinner here. \n\nrecommendation #1: chilean sea bass with truffle miso glaze. though it's listed as an appetizer it was big enough to be an entree.\n\nrecommendation #2: kurobuta kakuni. i ordered this for myself, but the rest of the birthday party descended on it like a flock of vultures before i even got a bite.  the plate came back to me <mark>Accompanied with your choice of one</mark> the veggies and brown rice :( but i'm guessing the pork was really good?\n\ni would recommend sushi samba at the palazzo over sushi roku only because samba has a more unique menu that imo is worth shelling out a few extra bucks for.  but if you're looking for more traditional japanese flavors, roku gives you more bang for your buck in a similarly high end setting.", 
            "i rarely give places a five star. a five star place is the perfect model which all other places aspire to be. sushi roku is that place.\n\nobviously the top criterion for any sushi place is the quality of the fish. it tasted fresh--and i mean out of the ocean fresh! i still am having a hard time trying to get my head wrapped around the fact that las vegas is nowhere near an ocean and yet it was the freshest sushi i ever had.\n\nwith that out of the way, the service was impeccable. more than one person had their eye on me to see if i wanted anything else. what i was impressed by was that they balanced the way to be immediately responsive without being too imposing. all i had to do was make eye contact <mark>Accompanied with your choice of one</mark> of the restaurant staff anywhere and they seemed to master communication by gesture among the staff so the right person could address whatever it is i was looking for.\n\nfinally, what is a sushi place without a master sushi chef? this guy was good. i even asked if they had things that were not on the menu and he still produced them in less than three minutes.\n\ngranted i did drop 80 dollars by myself here, but with this kind of service and this kind of food, i find it is worth the money.\n\nif you are in vegas, and you really like sushi, there is no excuse not to go here.", 
            "i gave an extra star, or a second star for the decor. very nice place and view. otherwise, the food is so bad and skimpy that one star is too much.\ni don't mind small and tasty portions, but these were embarrassingly skimpy and notg so good. <mark>Udon <mark>Hakata Ramen Noodle Soup</mark></mark> came with tempura on a side, as we requested. tempura consisted <mark>Accompanied with your choice of one</mark> shrimp split in quarters and you only get two skimpy quarters of that one shrimp. nada mas. \nmy sushi box should have had four slices of sashimi, but what they did, they took one piece of tuna and split it in four pieces. so the four slices are paper thin and see through! it also came with beef, which was overcooked and not good. \ni was still hungry and went ahead and ordered a sushi roll. it was decent size but not great tasting. \nthey should be ashamed of serving such food for such price. but even if it was cheap, which it wasn't, they should be ashamed, you don't serve two quarters of a shrimp as your tempura.", 
            "this is another 2 star 4 star averaging out to 3 star type place.  \n\nthe 2 star stuff.... don't get me wrong, the food was awesome.  but i walked out feeling like an idiot for paying what i did for what i got.  eighteen bucks for <mark>Spicy Tuna</mark> with shrimp, cilantro, and avocado?  ouch.  it did have 10 pieces, but they were the size <mark>Accompanied with your choice of one</mark> of those budget happy hour california rolls you get for 3 or 4 bucks at a normal sushi place.  the baked lobster roll only had 6 pieces, barely fit for an appetizer (and the asparagus spear inside was about half of the volume of the interior of the roll). \n\nthe 4 star stuff.... the view of the strip was pretty sweet, although it was predominated by the caesar's palace tv thing.  the decor was nice, very dark and trendy/classy.  the service was great, they were very attentive and even brought out some cheesecake for my friend's birthday.  the fish was very fresh (impressive, being in the middle of the dessert) and everything tasted very good.  simple, elegant flavors with a lot of attention to presentation.  the sake selection was extensive and had a decently priced and very good house sake and a 3-sake tasting flight with big pours.  \n\nthe funny thing is, i'd come back.  it's hard to find good sushi and even though i felt pretty dang close to being ripped off, this was good sushi.  i'll probably try some other places nearby first.  oh, and this would be a fantastic date place.", 
            "ok, ok, i'll give you 5 stars sushi roku.  i'm not a sushi fan at all but i was invited to attend a private birthday dinner here <mark>Accompanied with your choice of one</mark> of my closest friends, how could i say no?\n\nall aspects of the evening were planned in advance and i'm quite impressed with the level of professionalism each memeber of the staff here at sushi roku possessed. on point from start to finish!\n\ni experienced some new eats on this night including sashimi (sp?)!  much to my surprise the sashimi (tuna and yellowtale) was one of my favorite items tasted this evening. still not a fan of actual sushi rolls, we're still making progress people.\n\nshould the taste buds have a calling for sushi (or sashimi), sush roku would be at the top of the list."
        ], 
        "dish_name": "Accompanied with your choice of one"
    }, 
    {
        "text": [
            "first thing: 20% off entire check for locals!\nsecond: birthday desserts (yes that is plural) are complementary!\n\nso we had a pretty good waiter, we got the strip view table, and waters were regularly refilled.  everyone at the table (party of 6) had very different meals - some had the special <mark>Chef's Sushi Assortment</mark>, one got the seabass (supposedly the best ever), one had tempura, my bf had salmon and scallop entree (he thought the salmon was dry), and i had the complicated order.\n\nmy boyfriend and i split the crudo roku appetizer (all 6 sashimi specials in mini format): halibut with chili paste, yellowtail with diced chile, tuna carpaccio with ponzu, albacore with crispy onions, salmon with fresh greens and truffle, and octopus with salsa.  yum little flavor fest.\n\nthe menu had daily specials which had japanese and spanish mackerel, and the regular sushi menu had regular and spanish mackerel.  they were out of all of it (the waiter said new owners are too lazy to swap out daily menus.  he also said previous owners made poor cocktails...thanks for the commentary) - instead i got whole scallop sushi (hotate), softshell crab roll (very nice, not too fried, lots of yummy sprouts), a yellowtail scallion handroll (good quality fish, but not fresh nori), and miso eggplant appetizer (good sauce, yummy, hot).\n\nalso, i had the ginger yuzu martini - very refreshing with the meal...yuzu juice, ginger vodka, and ginger-vanilla something.\n\noverall, it was very pricey but tasty and delicious.  for our birthday girl in the party, they brought out two desserts on the house: wonton wrapped ice cream with tropical fruits, and chocolate lava cake with ice cream and berries.  those were polished off fast.  then i told our waiter that my bf and i were locals and he gave us 20% off the entire 6-person check (we saved $60).\n\ndon't think i would rush back because of sheer cost, but i would recommend the experience."
        ], 
        "dish_name": "Chef's Sushi Assortment"
    }, 
    {
        "text": [
            "ehhhhh.... its okay.\n\ngots to give it to them for the decor and ambience they've got going on.  the service was fabulous and they checked on us, refilled our drinks and what not.  \n\ni had a <mark>Special Executive Bento Box</mark> with <mark>Spicy Tuna</mark> sushi rolls and the food for some reason tasted mediocre to me.  \n\nbut what really impress me about this joint is that the decor was very nice, but i hate it when i go to a restaurant where the food isn't up to par with the restaurant though.  i like the factor that they used real bamboo as their coverings in the window as tourists would walk by, and the atmosphere was very relaxed and somber like.  \n\ni wouldn't mind coming back here, but i just think that you could've found a better place compare to here.  its just overrated.", 
            "cool decor. good sushi.. colorful <mark>Special Executive Bento Box</mark>. i loved their mushed <mark>Spicy Tuna</mark> over rice.. apparently only they have that dish bc i havent been able to find it elsewhere. and when other places try to make it, it doesnt taste the same.", 
            "great sushi, but expensive!! then again unless you're buying a hot dog for dinner, everything in vegas is expensive!! we loved our meal. we had salad, one cocktail, 1 <mark>Spicy Tuna</mark> roll and a <mark>Special Executive Bento Box</mark>...are you ready? $100!! yes. but worth every penny. every dish was flavorful!! worth it!!", 
            "it was a nice surprise when we found out that they have lunch special! <mark>Special Executive Bento Box</mark> with teriyaki salmon and 4 pieces of sashimi priced at $19, super delicious! my friend ordered unagi donburi and it was to die for, sweet and melt in your mouth eel! service was excellent! i recommend to go during lunch time if you come to town with kids, it was nice, quite and still great food and service!", 
            "great sushi. some of the best i have had in vegas.  very creative in their rolls. love there lunch <mark>Special Executive Bento Box</mark>. great portions and very tasty presentation.  the only thing they need to work on is getting the food out quicker.  lunch took a little longer than it needed to be.  however the manager was excellent about fixing the situation.  definitely a place i would go back too.", 
            "i had one of the lunch specials and was very satisfied. in particular i had a <mark>Special Executive Bento Box</mark> with chicken, salad, rice and tempura. everything was very delicious and filling. i also sampled one of the rolls was pleased and wished i'd gotten that as well. to drink i had a sparkling saki which was small but very good if you like sweet drinks. i would come back to try the rolls next time.", 
            "totally coming back here!!  \n\nmy absolute favorite thing to order here is the <mark>Spicy Tuna</mark> crispy rice! it was soo good i ordered two! mmm dreaming about it as i type.\n\ni ordered the <mark>Special Executive Bento Box</mark> too from the lunch special. black cod and short rib? helllll yess!! i loved everything in the <mark>Special Executive Bento Box</mark>! everyyything :))) i would totally order this again! the miso soup was delicious too!\n\nthe people working here were reallyyy nice and the view was incredible! i am definitely coming back here and i am excited about it! yay!"
        ], 
        "dish_name": "Special Executive Bento Box"
    }, 
    {
        "text": [
            "dined here two years ago and haven't found a sushi place as good since. friendly staff, yummy cocktails and tasty rolls.  he doesn't like sushi, so he got <mark>Beef Teriyaki</mark>.  the portion was small for the price, so stick to the rolls and tempura. it was the day after my bday and they gave me a complimentary dessert with a really cool sparkler in it...vegas style, super flashy.", 
            "short story:\nvegas has some good sushi?!  i'm surprised...\n\nlong story:\ni came here for lunch on thursday, and it was not crowded.  we were promptly seated and we ordered the karaage appetizer, the teriyaki salmon, and the <mark>Beef Teriyaki</mark>.  all the dishes were good and they came with sashimi.  i got to say, the sashimi was good, though i didn't have high expectations as this was vegas...and not hear the coast.  it did take a bit of time to get our food, but it was forgivable.  \n\nverdict:\ni would go back if and when i go back to vegas.  though i'm sure there are other good places to go too.", 
            "ag made reservations here (saturday night, 6:30pm) for us to celebrate the end of ym's days as a single lady.  \n\nambiance: dim, sleek and sexy.  we were seated in a booth, which i think is the way to go (although the tables near the ceiling to wall glass windows with a view of the strip lights seemed nice too).  the noise level was low to start the night, but gradually got rowdy-- you could definitely tell that some of the tables were downing liquid courage.\n\nservice: our waitress was super cute/friendly, but did mess up our drink order once.  the gm stopped by our table to say hello, but it didn't seem like we got any special treatment.\n\nfood: average.  i think there was either a set menu, or a previously decided upon order, since our food started arriving course by course as soon as our drink orders were taken.\n\n- edamame: sprinkled lightly with sea salt, i was disappointed the seasoning wasn't evenly distributed.  it also seemed strange that a seemingly nice place like sushi roku would charge for edamame (or include it as one of the charged for courses in a set menu).\n- hamachi carpaccio (1 slice of fish/person): eh.  also slightly disappointing.  the flavors were good (yuzu drizzle, etc), but the fish could've been fresher.  the girls really liked this dish though, so maybe its just me.\n- filet mignon wrapped asparagus (1 roll/person): presentation was nice-- the rolls were stacked up on each other on top of a sizzling rock.  a soy glaze was poured on top before serving, and emitted an impressive amount of steam.  i ended up with a piece that was sitting on top of the rock-- the meat was fairly tough for a supposedly tender cut.  i'm also not a huge fan of asparagus, so this dish was meh for me.\n- crispy miso shrimp (several shrimps/person): my fave of the night, but it was essentially honey walnut prawns, minus the sweet mayo.\n- chicken & <mark>Beef Teriyaki</mark> skewers (1 of each skewer/person): the beef skewers featured nice tender chunks of beef.  the chicken wasn't as good as the beef imo, but at least they were juicy and not dry.\n- assortment of sushi (a couple pieces of sushi/person): eh.  par.\n- dessert trio: cheesecake (thumbs down; it had a really hard buttery crust), cinnamon sugar donut \"holes\" (good, very fluffy, came with caramel and vanilla dipping sauces), and a molten chocolate lava cake (very good, very lava-y).\n\nthe cocktails were hit or miss, but i really liked the bourbon one with cilantro and raspberries.\n\noverall: solid 3 stars.  i actually have no idea how much the meal cost, so my rating may change after i see the bill.  anything more than $40pp would be too much for what we ate.", 
            "went here for lunch and got the <mark>Beef Teriyaki</mark> lunch bento. the beef was very tender and good!", 
            "the food was horrible.  do not go here.  the only thing that was decent was the <mark>Beef Teriyaki</mark> and <mark>Seaweed Salad</mark>."
        ], 
        "dish_name": "Beef Teriyaki"
    }, 
    {
        "text": [
            "another favorite of ours in vegas didn't disappoint us on this trip. \n\nmy wife is not a fan of fish but there is plenty on the menu for her to choose from. \n\nshe chose a cucumber and avocado roll and had them use soy paper instead of seaweed.  and <mark>Chicken Teriyaki</mark>, rice, with <mark>Vegetable Tempura</mark>. \n\ni had an assortment of rolls and a friend joined us late but the restaurant accommodated without any problems.  \n\nas others have said there may be better sushi restaurants on the strip but we live the view, food, and service and will be back on our next trip.", 
            "good lunch.  empty restaurant.  skip the <mark>Chicken Teriyaki</mark> in favor of the salmon and sushi.  everything freshly prepared.  a good choice for a decent meal to break mid-shopping at forum shops."
        ], 
        "dish_name": "Chicken Teriyaki"
    }, 
    {
        "text": [
            "after having a hefty brunch at bouchon, we opted for a lighter dinner of sushi.    we made a 8:30 reservation while we were shopping at the forum shops.  my gfs and i order a couple bottles of sake and a <mark>Mixed Tempura</mark> plate to get the evening started.  we all really enjoyed the pricey sparkling raspberry sake ($34 a bottle!) and the tempura.  we also got a couple of rolls to share as our dinner and all were delicious.  our only annoyance was when we wanted to order more food and drinks our server could never be found.", 
            "j was dizzy from low blood sugar when we walked in. i was still stuffed from breakfast but i figured i'd have a nosh. she ordered a cornucopia of sushi (salmon, toro, one handroll with tempura shrimp and asparagus) that she devoured and was highly pleased with. i had the 'new' <mark>Chicken Salad</mark> and some <mark>Mixed Tempura</mark> (veg and seafood). both were good but i really liked the <mark>Chicken Salad</mark>. the dressing is that sweet miso-y dressing you can some times get at some japanese restaurants. \n   the service was really wonderful. our waiter was highly attentive to our needs and my water glass wasn't allowed to be less than half full. we appreciated it.\n   the price was pretty high for a couple of women on limited budgets. my salad was $16 and the tempura was $12. i have no idea how much j's platter o'sushi was but it wasn't for the faint of heart. but you are paying for quality, not quantity.", 
            "for what it cost, sushi roku was just okay.  lunch for three of us ran nearly $250 (with no alcohol).  we ordered the <mark>Mixed Tempura</mark>, three of the signature rolls and three of the sashimi choices.  with just one sashimi selection costing nearly $40 and signature rolls hovering at $30 each, it didn't take long to run up the tab.\n\nthe sushi rolls fell apart way too easily.  the rice didn't have the right texture and there's no excuse for that at these prices.  the service was also spotty.  again, not cool at these prices.\n\nthe decor is fine, but i am sure this place benefits from candlelight.  it was a bit dark and spare in the afternoon for lunch.  it also smelled like fish.  a sushi place that is this spendy shouldn't smell like fish.\n\nfrankly, i think you can get better sushi for the money in vegas.", 
            "delicious food with a great little view of the strip.\n\na co worker and i came here while journeying on a business trip. we were hungry and this menu looked good. the place was fairly empty and peaceful on wednesday at about 1:30 pm. the view is small, but you see the imperial palace and a bit of the strip. the interior is beautiful and incredibly comfortable, i really loved it.\n\nour waiter was kind and courteous and service was great. our warm sake was delicious and my <mark>Mixed Tempura</mark> donburi bowl had delicious shrimp and impeccably cooked rice in it. i was filled and happy by the time i left and i wish i could go back daily and that it was closer to me!"
        ], 
        "dish_name": "Mixed Tempura"
    }, 
    {
        "text": [
            "first, i'll start out by saying i'm a big sushi fan and have made it that i have to try a new sushi spot each trip.  this time around my friend and i picked sushi roku for lunch on christmas day.  sushi roku is located in the forum shops at caesars palace third level right next to boa steakhouse.  we had reservations and once we got there was seated right away and the place is beautiful.  the decor was very nice which gave this place a great atmosphere.  the view was looking right down the strip which was very nice.  they get an a+ for the design and setup for this place.  the staff there was very friendly and helpful.  by no means the best service i've had but water and drinks were always filled.  answered any questions we had when we asked.  first thing to know we had the yellowtail at social house at ti and have been looking for anything anywhere as good as there.  nothing has lived up to it yet.  we started off with the mixed seafood & <mark>Vegetable Tempura</mark> and it was pretty good.  i've never had tempura before so i can't compare to anything else.   got the yellowtail and i was very disappointed it just lacked much flavor and was not impressed.  i also ordered the <mark>Spicy Tuna</mark> cut and this was some of the best <mark>Spicy Tuna</mark> i've had.  little buddha was the best before i went to sushi roku.  the <mark>Spicy Tuna</mark> was so fresh and just melted in your mouth.  overall i would go back if i run out of sushi spots but still have koi, yellowtail, and wazuzu to try in the near future.  the prices at sushi roku are on the high side and in my opinion not worth it per say.  for just the 2 pieces of yellowtail and <mark>Spicy Tuna</mark> it was 18.32 plus another 13.00 to split the tempura with my friend.  overall a good spot to go but not the best sushi in vegas.", 
            "loved it! came here for lunch.  ambiance was nice and the view of the strip was beautiful as well.  the sushi was very good, but the sashimi was what was memorable.  we had salmon and toro sashimi.  the toro sashimi was absolutely delectable.  it was like butter!  the california roll was very good considering we were in vegas.  i loved the options for <mark>Vegetable Tempura</mark> (considering my sister is a vegetarian) and the fact that they don't use peanut oil to fry it (my sister is allergic to peanuts)...when they found out that it was my mom's birthday they brought out free dessert and a sparkler (an actual firework). that was nice. this was a very pleasant experience and if i am ever at caesars again, i will come back.", 
            "dined here for my boyfriends birthday on vacation in vegas. i chose this restaurant based on the price vs. reviews and we were not disappointed! both of us eat sushi regularly, and tend to be a bit picky, but sushi roku delivered. after finally locating the restaurant (we got lost in the huge ceasars hotel), we were greeted by the super cute and friendly door girls. i was pleased that we had a table with a great view of the strip. our server was helpful in recommending drinks, and we both started off with an order of miso soup and <mark>Vegetable Tempura</mark>. the soup was the perfect amount and so flavorful, the tempura hot, fresh, and delicious. for sushi, we decided on the yellowtail, salmon, crunchy <mark>Spicy Tuna</mark>, and tuna. everything was spectacular! the yellowtail was fresh and melt-in-your-mouth delicious. i wasn't a huge fan of the crunchy tuna, only because i don't really like 'hot' rolls, but it was still yummy and hit the spot. for dessert we had the creme brulee trio, which topped off the meal perfectly. i would definitely return, the service was great and for the price (especially in vegas), you cant go wrong!", 
            "if you are coming for the view you will be very happy, if you are coming for the sushi you will be mostly happy.  my husband and i snuck away for a dinner from our group and based on reviews ended up here.  we started with mixed <mark>Vegetable Tempura</mark> and kobe beef potstickers....wonderful choices for appetizers. \n\nthe katana roll was delish and we were very happy with our choice here.  after all that we decided to do one more roll...we shouldn't have.  the crunchy <mark>Spicy Tuna</mark> disapointed. it was warm which we were warned about but it was just bad and not crunchy. overall good experience but was hoping for amazing sushi which was not here.", 
            "another favorite of ours in vegas didn't disappoint us on this trip. \n\nmy wife is not a fan of fish but there is plenty on the menu for her to choose from. \n\nshe chose a cucumber and avocado roll and had them use soy paper instead of seaweed.  and <mark>Chicken Teriyaki</mark>, rice, with <mark>Vegetable Tempura</mark>. \n\ni had an assortment of rolls and a friend joined us late but the restaurant accommodated without any problems.  \n\nas others have said there may be better sushi restaurants on the strip but we live the view, food, and service and will be back on our next trip."
        ], 
        "dish_name": "Vegetable Tempura"
    }, 
    {
        "text": [], 
        "dish_name": "Grilled Salmon"
    }, 
    {
        "text": [
            "i know-sushi, vegas? what? um...\n\ni have to say the west hollywood location is way better. \n\ni had the hamachi and scallion roll, crunchy <mark>Spicy Tuna</mark> (fried, over cooked the tuna) and the hamachi jalapeno sashimi. \n\nover all is was an \"ok\". i wouldn't go back based on this experience. but next time i'm down in the west area, i'll go there.", 
            "another overpriced sushi joint in vegas where you pay for ambience, this time in caesar's.  i ordered one of their lunch specials, for $18 i got 7 sushi pieces and <mark>Spicy Tuna</mark> roll.  it was lunchtime so hardly anyone was in there, i can see this place banging at 10pm on a saturday night.  ambience is pretty and loungelike, paying for ambience here kids.  sushi is fresh and made right.", 
            "i live very close to a sushi roku in santa monica, california so its a bit strange that my first experience with the restaurant was so far from home (in the middle of the desert no less). on the brighter side, it was a business lunch so the price tag didn't hurt as much as it should have.\n\nall in all, the food was really great. it wasn't the best sushi i've had, but it was pretty close.  i really dig spicy food, so the <mark>Spicy Tuna</mark> with jalapeos really hit the spot! also had a \"shima roll\" which i highly recommend... <mark>Spicy Tuna</mark>, shrimp, soy paper, and hot sauce. yummy!", 
            "sushi is my cuisine of choice, so needless to say i walked into sushi roku with a discerning palette. i had heard excellent things from friends in la who dined at the original quite often, but i had to see how the vegas location panned out.\n\nit was excellent, excellent, excellent. my boyfriend and i looked at each other at least four times throughout the meal and said \"this is the single greatest sushi experience of my life.\" in my opinion, it's that good.\n\ntheir rolls are extravagant and fresh. i highly recommend the crunchy <mark>Spicy Tuna</mark>, rock shrimp tempura with jalapenos, and the shima roll. we unfortunately noticed the kobe beef roll after we had ordered five rolls or so for ourselves. next time...\n\ngreat mojitos, too!", 
            "i was recommended to go to sushi roku by one of the guys serving the big yardstick tropical drinks on the strip.  it is very chic looking, excellent decor and the sushi chefs are quite funny yelling out something in japanese whenever hot chicks come or go.  they were also very accomodating, allowing us to bring our large drinks in from outside.  the sushi was fantastic, excellent portions, very fresh and quite tasty.  i had the <mark>Spicy Tuna</mark> and dragon rolls and loved them.  service was great and the manager came out and introduced himself which is always a nice touch.", 
            "ehhhhh.... its okay.\n\ngots to give it to them for the decor and ambience they've got going on.  the service was fabulous and they checked on us, refilled our drinks and what not.  \n\ni had a <mark>Special Executive Bento Box</mark> with <mark>Spicy Tuna</mark> sushi rolls and the food for some reason tasted mediocre to me.  \n\nbut what really impress me about this joint is that the decor was very nice, but i hate it when i go to a restaurant where the food isn't up to par with the restaurant though.  i like the factor that they used real bamboo as their coverings in the window as tourists would walk by, and the atmosphere was very relaxed and somber like.  \n\ni wouldn't mind coming back here, but i just think that you could've found a better place compare to here.  its just overrated.", 
            "one of the most fun nights i've ever had was spent at sushi roku.  ambiance excellent, service excellent, food excellent, experience excellent!  the 50 minute wait even with 7:00pm reservations -1 star.  \n\nwe were a group of 8.  cold and hot/ filtered and unfiltered sakes came out very fast.  on to the apps.  everything ranging from edamae to homemade tofu to traditional house salad with ginger dressing was ordered and everything was delicious.  for dinner everyone was there for sushi except for one couple.   the meat eater chose the japanese kobe wagyu dish which almost made me wish i got that instead of sushi and his wife chose the chilean sea bass dish..... beautiful presentation on both.  \n\nas for the sushi goers:  blue fin tuna, i've never had it before, fresh and amazing!  all of the basics... toro, yellowtail, salmon, snapper, halibut, eel, etc.  (don't hate my review because i'm using the american names... i don't want to screw up the spelling......) and then the rolls.....<mark>Spicy Tuna</mark>, spicy california, rainbow roll, caterpillar roll.....mmmmmm.mmmmmm good!\n\nthis was an excellent dinner......the server was really upbeat and even did a sake bomb with us!  next time i'm in sin city i'm definitely coming back to roku.", 
            "yum! summer picked sushi roku for her vegas birthday celebration dinner and i'm so happy that she did! the six of us were seated at an awesome round table with a super view of the las vegas strip.\n\nwe started with a large order of sake-bombing materials (two of the six were sake-bombing virgins!) and a couple of the signature cocktails. i tried the lycee mojito which was good but not lycee-y enough and the other girls loved the tropical peach passion and lycee martini. \n\nwe ordered a wide variety of dishes to share and for personal consumption. i liked the crispy chicken appetizer with yummy dipping sauce and the <mark>Spicy Tuna</mark> and california rolls. i usually love eel sushi but our eel was overly fishy. summer tried a signature roll with tuna, cilantro, and more which was yummy though wasabi-infused and spicy! the salty edaname were also very good and rachel couldn't stop raving about the sea bass main dish. \n\nour sweet waitress gave us a complimentary birthday sake jug and a fun mini-birthday celebration of molten chocolate cake and a crazy sparkler. for about $65 each, we all left satiated and ready to party!", 
            "here's a perfect example why i am hesitant about fine dining sometimes. you get great service, pretty looking food but it doesn't even taste good. so what are you coming for? the food itself or the service and food presentation? \n\nif i had to describe the food here in one word, bland!\na few more words, expensive food court food.\n\nand the walk here is such a pain in the @$$ from the front entrance of caesars.\n\nok, the place is very nice. the service is excellent. food presentation is wonderful but that does not mean it tastes good.\n\nthe calamari was way overcooked. i sent it back and the chef said that's how it is. it's supposed to be dry and rubbery? i should take the cook over to cheesecake factory and let him try to calamari there. i couldn't even chew it. spat it out and they were willing to take it off our tab. thumbs up!\n\nprime rib was so so. i wanted to ask for some a1 sauce so you know the marinade wasn't flavorful enough.\n\ncrunchy <mark>Spicy Tuna</mark> roll and lobster specialty rolls were absolutely bland. no one at my table tasted a single thing. of course, there was no way they could mess up a regular tuna roll so that was fine.\n\nsea bass was probably the best dish and when i say the best, i'm being generous. it was still so so.\n\n$6 extra for miso soup and rice to add to your entree? ehh...\n\n$160 including tip for 4 people. never again. social house @ ti is a bit more expensive but at least the food tastes much better.", 
            "came her for lunch after a crazy huge dinner experience, sushi sounded perfect! this place did us just right. the fish was fresh, the service was cool, but then again...there weren't very many people there eating lunch=) toro was and has always been delicious to me, but one thing you should get is their japanese snapper? not too sure what it's called, but it's a fish that's hard to find...sashimi wise....almost as good as toro!=) but worth every penny!=) and their <mark>Spicy Tuna</mark> mixed with something (a recommendation by our waiter) was really good too!!.. so do your homework before dining at vegas, so you won't regret not losing it on a crap table=)", 
            "first, i'll start out by saying i'm a big sushi fan and have made it that i have to try a new sushi spot each trip.  this time around my friend and i picked sushi roku for lunch on christmas day.  sushi roku is located in the forum shops at caesars palace third level right next to boa steakhouse.  we had reservations and once we got there was seated right away and the place is beautiful.  the decor was very nice which gave this place a great atmosphere.  the view was looking right down the strip which was very nice.  they get an a+ for the design and setup for this place.  the staff there was very friendly and helpful.  by no means the best service i've had but water and drinks were always filled.  answered any questions we had when we asked.  first thing to know we had the yellowtail at social house at ti and have been looking for anything anywhere as good as there.  nothing has lived up to it yet.  we started off with the mixed seafood & <mark>Vegetable Tempura</mark> and it was pretty good.  i've never had tempura before so i can't compare to anything else.   got the yellowtail and i was very disappointed it just lacked much flavor and was not impressed.  i also ordered the <mark>Spicy Tuna</mark> cut and this was some of the best <mark>Spicy Tuna</mark> i've had.  little buddha was the best before i went to sushi roku.  the <mark>Spicy Tuna</mark> was so fresh and just melted in your mouth.  overall i would go back if i run out of sushi spots but still have koi, yellowtail, and wazuzu to try in the near future.  the prices at sushi roku are on the high side and in my opinion not worth it per say.  for just the 2 pieces of yellowtail and <mark>Spicy Tuna</mark> it was 18.32 plus another 13.00 to split the tempura with my friend.  overall a good spot to go but not the best sushi in vegas.", 
            "it's on the 3rd floor of the forum shops, a little stuffy and haughty, but what can you expect?  we popped in for lunch, around 1:30pm.  if you like attentive service, that would be the perfect time to go.  there were exactly 4 other customers in the restaurant...despite the few customers, there was a hostess, a waiter, a water guy, an appetizer/plate clearing guy, 2 sushi chefs, and a manager.  no wonder a vegetarian roll is $14!  great view of the strip from the booths, and the decor was modern, comfortable and elegant  (think low backed leather couches and natural materials).  my sweetie and i had the chef's sushi combo, a harvest roll (skip it), and the <mark>Spicy Tuna</mark> roll.  all of the fish was like butter (yellowtail, salmon, tuna, shrimp).  really fresh, better than some i've had here at home on the the west coast.  i had a cocktail called the tokyo cooler--a very delicious, refreshing, dangerous cocktail.  i could have gotten prom-night drunk on those, no prob.  rolls were $13-26  (approx 4 pieces)each, sashimi $13-24 for 4 pieces.  handrolls $6.  all in all we spent $55 on lunch.  we were satiated--not overly so--i wanted to save room for gelatto.", 
            "not bad not bad at all. if you're looking for \"asian fusion\" cuisine: sushi with spicy sauce and fried stuff, teriyaki steak and expensive sake - you'll like this spot. cool, dark, trendy decor overlooking the strip - perfect for a dinner date or group dinner. feels like you stepped into a different world from the shopping mall exterior - well, cause you technically did.\n\nexpect to spend $50 min for some food (enough to make you full but ready for late night pizza later) and a drink. my sushi combo - <mark>Spicy Tuna</mark> roll and about 7 basic nigiri was about $28, glass of rombauer chard was $18. yes, a little pricey on the wine, but oh well, it's vegas.\n\na fair comparison to this place is sushi samba in the venetian...would i go back? sure, if it were suggested. no, if i had my choice. too many other places to check out in vegas!", 
            "cool decor. good sushi.. colorful <mark>Special Executive Bento Box</mark>. i loved their mushed <mark>Spicy Tuna</mark> over rice.. apparently only they have that dish bc i havent been able to find it elsewhere. and when other places try to make it, it doesnt taste the same.", 
            "came for lunch and got the <mark>Spicy Tuna</mark> don buri.  they did it with the brown rice risotto for me, instead of the usual white.  it was great, i've never had <mark>Spicy Tuna</mark> this way.  it was mushy-style and spread over the rice and topped with some vegetables.  they forgot my miso soup though.", 
            "good sushi makes me cry.  this night, i was a baby that couldn't stop.  seriously, wow.  hot damn.  more please.  expensive? yes, but who really cares when it is mind blowing good.\n\ni started with a lychee mojoito (tasty) and miso soup (average to good).  my world officially became rocked when the hanabi: <mark>Spicy Tuna</mark> over a crispy rice cake came to the table.  i'm sure if i saw a video of my reaction, i would be completely embarrassed but i can honestly say it was one of the best hot appetizers i have ever had. my poor waitress had to put up with me through all this.  i'm so sorry.\n\nwe ordered two rolls, shima roll: <mark>Spicy Tuna</mark> & avo w/shrimp, cilantro & wrapped with soypaper; and the baked lobster roll: lobster & asparagus on the inside and a baked yellow sauce consisting of sweet miso & egg.  i was in sushi heaven.\n\ngreat service, awesome atmosphere, pretty good chill music for the environment.  all this with a beer and another mixed drink, approx $150.  \n\nyou can not stop me from going back the next time i'm in vegas.", 
            "we came here for my cousin's birthday. it was a good experience. \n\nthe atmosphere and d\\u00e9cor was exceptional, very trendy and posh. the view of the strip was gorgeous! the service from our wait staff was impeccable and they made sure that we had a great experience. \n\nwe had ordered the following dishes, of course i had to try a little of everyone's dishes.. with some exceptions... hee hee..: \n\njapanese yellowtail sashimi with diced chilies: yummy!! the yellowtail just melted in your mouth. \nchilean seabass with truffle miso glaze & sauteed spinach: this was my dish...it was seared just right and the truffle miso glaze was so delicious!! i would definitely order this again. \nsauteed salmon & hokkaido scallops; xo sauce with asparagus & potatoes: scallops were cooked perfectly, not chewy or tough. \nkatana roll: tuna & yellowtail atop <mark>Spicy Tuna</mark> & shrimp tempura: great presentation, and the fish was really fresh \n<mark>Spicy Tuna</mark> hand roll: i wasn't able to try this as it was only for one person. \ngrilled ji-dori chicken with sauteed mix mushrooms & mashed potatoes: chicken was extremely tender, great combination with the sauces. \n\nthis restaurant is a little pricey but c'mon it's vegas. the ambiance, the delicious food, and the service is definitely well worth it.", 
            "came to sushi roku with a bunch of friends and was able to secure the private room for a private dinning event. located on the 3rd floor of the forum mall, sushi roku is probably one of the best japanese restaurants that i've been too offering a beautiful view of the strip. \n\nwe got here and the room was all set for the 20 of us that would be dinning that night. as i mentioned before the private dinning has a great view of the strip. the atmosphere here is definitely hip with low lighting. you have the high end modern japanese with lots of dark wood used throughout with hints of red and stone accent pieces. we had a prefix meal sampling meal served family style so all we had to do was sit down, drink several rounds of saki bombs, and let the food come to us. \n\nfirst up was the edamae. fresh with a touch of sea salt was just the right way to start off a night of eating and doing saki bombs. next up was a chinese <mark>Chicken Salad</mark>. good, nice fresh mixed green lettuce with a dressing with a nice blend of balsamic and sesame to it. the shredded chicken was also very good. chicken skewers were next up on the menu, again, very good. chicken was done perfectly and the sauce that i had was a sweet sauce with a little bit of heat at the end. after the chicken out came the rolls, there was a traditional california roll, (good but not mind blowing), the <mark>Spicy Tuna</mark> (though small, everything here tasted really fresh and with perfectly cooked sushi rice and a nice amount of heat, really really good) and probably the one item that everyone raved about was the fresh soft shell crab roll. while simple, it was just very fresh and outstanding. this alone i would come back for again. we got two desserts for the nice a chocolate lava cake with a vanilla cream sauce (second best i've had with the best being at roy's in maui) and ice cream mochi which was pretty good. \n\nthe service here was excellent. very professional and friendly especially considering how rowdy this group can get. overall all the food and saki cost around $80 a head which seemed reasonable for the amount of food and drinks we got that night. no one in our group of 20 left hungry and there was plenty of food left over. i have to say, this is one of the best japanese restaurants that i've been to and will give sushi roki a rare 5 star rating!", 
            "the main reason i'm giving 5 stars is for the bluefin sashimi that they do topped with shaved black truffles, truffle oil, microgreens, and parmesan cheese. it's an unexpected flavor combo, but it is downright euphoric and should not be missed. i can actually say that this is the best sushi dish i've ever eaten and it's hard to go back to eating sashimi sans truffles. when bluefin is not in season, you can get it with regular tuna or salmon and they are both amazing. it's not always on the menu, but if you ask, they'll make it. i've tried ordering this dish at other sushi roku locations, but instead of using shaved black truffles, they use a measely amount of these sorry crumbled truffle bits. it just doesn't compare.\n\nthe other 5 star dish is the tempura fried green tea ice cream. its a chunk of ice cream encased in a little  spongecake \"box\" which is then dipped in tempura batter and deep fried. it's also topped with a little raspberry sauce drizzle and garnished with fresh berries. the cake insulates the ice cream so it doesn't melt when they fry it. not only is the flavor outstanding, but the crunchy tempura combined with the softest spongecake i've ever had is pure heaven.\n\nsome of the other dishes here are just kind of so-so and they are usually quite salty. i love the <mark>Spicy Tuna</mark> on crispy rice at katsu-ya, so when i saw that item on the menu here, i was excited to try it. unfortunately theirs is extremely greasy so be prepared to blot the hell out of it.", 
            "the sushi roku empire was built out in los angeles, but the trendy vibe was transported across state lines to be featured in their las vegas location.  the third floor digs inside the forum shops at caesar's palace provide expansive views of the strip.  being only a few flights above ground, you are able to enjoy the towering lights of the hotels, as well as the entertaining antics happening on the busy street.  the dim lighting and asian-inspired decor make sushi roku a seductive spot.  however, the high ceilings and open dining room can get quite loud when full of larger parties.  (our meal was continuously disrupted by a rowdy birthday celebration.)\n\nsince we were grabbing a late dinner, we decided to opt for some light courses.  i ordered the mixed <mark>Sashimi Salad</mark>, which was a mound of fresh field greens topped with radish slices and served over thinly cut raw fish.  the platter included tuna, salmon, yellowtail, and more.  a snappy ginger vinaigrette was drizzled over the dish, providing a gentle spicing.  each piece of fish was light, fresh, and tender.  i also sampled their eel avocado roll, which contained eel slices so warm that the maki easily fell apart, one of my pet peeves.  my friend ordered the special katana roll.  the massive portion contained about 10-12 slices of a mixed <mark>Spicy Tuna</mark> and shrimp tempura maki, topped with tuna and yellowtail slices.  it was a fantastic concoction that she reminisced about for days.\n\nmany hip japanese spots that provide fun atmospheres and innovative cooking styles, such as nobu, often do not provide the same food quality as more traditional spots.  however, sushi roku scores 4 stars on all of points - style, creativity, and taste.", 
            "went to sushi roku for dinner last week with some friends and family, i frequent this place often for lunch when i'm in town.  this was the first time i've actually been there for dinner.  \n\nour dining consisted of the following items:\n\nappetizers (compliments of the host):\n\nfilet mignon asparagus w/soy mirin sauce 16\nthis was ok, didn't leave a lasting impression on me.\n\njapanese yellow tail sashimi w/diced chilies 17\nthe yellow tail is a must have.  the fish was fresh and melts in your mouth. \n\nkaraage with cilantro mayo 12\nthe chicken was prepared just right and with the cilantro mayo, it was quite yummy.\n\nrolls:\nshima roll: shrimp wrapped <mark>Spicy Tuna</mark> w/cilantro & avocado 18\nthis roll was quite heavenly.\n\nentrees:\ngrilled fillet mignon w/homemade terriyaki sauce and mashed potatos 36\nthe fillet mignon was tender and cooked to perfection.  \n\nchilean seabass w/truffle miso glazed and sauteed spinach 28\nthe seabass was pure perfection, cooked medium w/the truffle miso glaze... my mouth waters just thinking about it..\n\nsauteed salmon & hokkaido scallops; xo sauce with asparagus & potatoes 26\n\nthe presentation of this entr\\u00e9e was pretty cool.  the fish and scallops were cooked just right.\n\ndesserts:\nthe chocolate volcano souffle was quite delectable.  \n\ni was surprised with a some sort of fruit cup birthday dessert which had blackberries, carmelized bananas, strawberries, and raspberries.  \n\nthe ambiance and d\\u00e9cor is quite appealing.\nas always the service is impeccable.  i would like to thank kenji for being such a wonderful host and great dining experience.", 
            "this was for my girlfriend's 30th birthday and she loves sushi so i wanted to treat her to a place that is nice. as we approached the front entrance of sushi roku, we were greeted by two skinny cold looking hosts. as one of them escorted us to the table, she nonchalantly asked how i was doing but it wasn't very sincere. she seated us right in front where we can see ... the outside to the mall. i caught a quick glimpse of the darker area of the restaurant that supposedly have a great view of the strip lit up.\n\nneedless to say, at least our server was nice. i told him we had a show to catch (peep show) and the order came out very quickly. we ordered:\n\n- foie gras wrapped in yellow tail sashimi (foie gras was over powering and salty)\n- toro (don't remember what it even tastes like, not impressed)\n- japanese yellow tail sashimi with diced chiles (too salty)\n- chilean seabass w/yuzu butter (this was a flavorful dish. the bass was very well cooked)\n- kobe beef skewers w/ black pepper sauce (flavorful and tender; thumbs up)\n- <mark>Spicy Tuna</mark> and rainbow roll (rolls were pretty good size and tasted fresh)\n\ntotal for 2 people: $216 including 1 mojito and 1 cocktail\n\nwould i go back? only if i get a chance to have a nice view of the strip at night but besides that, not really.", 
            "i made reservations on opentable a month or more in advance and we still got a table basically in the mall.  we watched other people that had put their name on the list and waited get seated by the window and the view.\nstrike 1.\n\nservice sucked.  the waitress actually didnt talk.  she would walk up to the table and look at us and wait for us to talk.. she would walk by and we would say excuse me and she would clearly hear us and keep walking.  she never checked on us once during the meal and believe me her tip showed how unhappy we were.\nstrike 2.\n\nwe ordered a sampling of items.. we had the shrimp dim sum, which was the best item we ordered.  does anyone else think thats funny?  the best item was a chinese dish.. haha\n\nwe ordered chicken yakitori which was pretty good but kind of overly yuzu'd up.   way too overpowering on some bites.\n\nwe ordered a scallop dynamite which was ok, again overpowered by a flavor, which this time was the bonita flakes on top.  and halfway through eating it you could see oil puddling at the bottom of the dish, signaling we should be done and we were.\n\nlast and least we ordered the <mark>Spicy Tuna</mark> crunchy roll (or something to that effect)  it was undercooked on the tempura outside, yet somehow overcooked on the tuna inside.  once this got a little cold it was disgusting...\nstrike 3.\n\nprice is outrageous really for the quality of food and quality of service.  it showed us that they really dont care if or when we come back and we wont.\nstrike out.", 
            "i needed a little snack to tide me over until an evening event at caesar's palace, so i stopped in for a quick graze at the sushi bar.  i ordered a couple pieces of tuna and salmon sushi, as well as a <mark>Spicy Tuna</mark> hand roll, which i use as a measure of any sushi restaurant i visit.  both were excellent, but the hand roll was a real surprise.\n\nmany times i have had a hand roll that was acceptable, but this restaurant went the extra step to crisp the nori before wrapping the <mark>Spicy Tuna</mark>.  the result is an extraordinary crunch of the seaweed before biting into the perfectly seasoned tuna.  \n\nexcellent atmosphere and great staff coupled with the food made me want to bail on my appointment and stay for a major feed.  next year i plan to do just that!", 
            "i ate at sushi roku along with two other people last sunday at around 5:30pm.  it wasn't crowded so we got a booth overlooking the window.  the waitress was attentive and the asian-influenced ambiance was nice.\n\n\nwe ordered just enough food to feed the three of us.  the cost was around $120 dollars for three people, including two small sakes.  the dishes we ordered included:\n\nappetizer\nhanaki <mark>Spicy Tuna</mark> on crispy rice cakes - this was quite good with a nice amount of <mark>Spicy Tuna</mark> on top of individual rice cakes.    the tuna had just a touch of spiciness.  there were about 5-6 pieces.\n\nsweet potato tempura (two pieces) - we had to send it back the first time because the sweet potato wasn't cooked enough.  it came out better the second time.  i probably won't order the tempura again.\n\n\nsushi\nunagi hand roll - it was a standard unagi hand roll, which is my favorite sushi.  the sauce wasn't overpowering like some unagi hand rolls.\ncalifornia hand roll - it was tasty since they included generous portions of real crab meat.\n\nmain entrees\nchilean sea bass with sauteed spinach entree (added miso soup and rice for $6 which was a bit pricey) - i felt the fish was moist but had a fishy aftertaste but one of my guests thought it was perfectly cooked.  \n\npan-fried  spicy jumbo shrimp with homemade potato chips - the shrimps were good-sized and were perfectly cooked. the sauce was not overly spicy.  the homemade chips were an interesting addition and tasted good with the sauce.", 
            "when going to this restaurant you need to know what to order to get the greatest experience, my friend of a friend was server and when i went i knew just what to order which was the... \n-chilean sea bass with yuzu butter sauce (amazing) \n-yellow tail sashimi with diced chile's on top and ponzu (came out super fast and was really refreshing) \n-lobster or popcorn tempura, it comes in a sweet miso sauce which is to die for! ( i got the lobster) \n-katana roll (lots of fresh fish and tempura in it, it was large so we were able to share) \n-shima roll,( if you like spicy this roll is the way to go) \n-salmon carpaccio with truffles ( anything with truffles and i'm in!) \n-hanabi , which is <mark>Spicy Tuna</mark> on thees rice cakes ( takes a little while to come out but worth the wait) \n-filet mignon wrapped around asparagus it had a sweet sauce on top almost like teryiyaki but better (not a huge portion but perfect for an app with a couple people to share) \n-banana flambe, its on the dessert menu but the menu doesn't do it justice( i might come back for that alone!) \nso i went with 4 people and we all shared everything i think that was best way to go by far because we were all able to try so many different things, oh and i cant write this review without mentioning the cocktails which were absolutely delicious ,my friend and i got the tokyo cooler and i could have drank about 10 of those! i will for sure be going back as soon as i can!", 
            "i'm mainly giving this restaurant 4 stars for its awesome view of the strip and hip interior.  medium to high noise level.  me and my friend had miso soup, edamame, beer, the \"hanabi\" <mark>Spicy Tuna</mark> on rice cakes appetizer and shared the katana roll.  my desert was the most memorable part of the meal.  i got the flambe fruit desert.  mixed sauteed fruit, served in a crisp pastry shell with vanilla ice cream.  very good.  everything else was fresh and good, however, i feel it was rather pricey for the amount of food that we had.   you probably pay for the view.", 
            "sushi roku, good reputation in la. sushi roku in las vegas should be called sushi fooku, because that's what they're going to do to your wallet and your palate.\n\na group of 5 of us came here around 9:30pm on saturday night, in need of pre-late night nourishment. yelping before leaping, this place had a decent review on yelp. this is one of the only times i have  been steered wrong...but it was oh so wrong.\n\nthe problems started when we began to select rolls to order. usually i'm a sashimi girl, and i shy away from rolls. but i knew i wanted something to fill us all up. so i started everyone off with the <mark>Spicy Tuna</mark> on crispy rice, and the first roll spicy canadian rock shrimp with asparagus. the tuna w/ crispy rice was great, but this is a standard for any sushi restaurant. the roll, on the other hand, was so tiny, 6 small pieces with even smaller ingredients - 11 dollars down.\n\ni asked our waiter what he suggested in terms of rolls, and wouldn't you know it, the rolls he told us about were both the most expensive rolls on the menu, 26 dollars a piece. a-hole.\n\nwe ordered three more rolls, all small and average tasting and then were told that the kitchen was closing - wtf, 11, this is vegas? but whatever, that's fine, we're done anyway. one round of drinks for 4 people, 2 edamames and four of the cheapest rolls was $150 dollars. i'd happily shell out twice this if i didn't think i was merely paying for the overhead of the restaurant, because i know the food didn't cost 1/4 of that.\n\nif you do go here, don't expect anything great from the rolls.  it's an expensive tourist joint, plain and simple. the worst part is that it's now highly unlikely i go to this place in los angeles. i was so sad to have this experience because of roku's great name out in la, but i have to say, this location is the king of meh.", 
            "sushi roku is very elegant and romantic. the perfect spot for a date, really. it has an awesome view, is dimly lit, and it just makes you want to cuddle a little closer together. \n\nmy experience here was great. if i had been the one to pay, though, i probably wouldn't feel the same way. we ordered 2 miso soups with tofu, a sashimi combo (6 pieces), the crunchy <mark>Spicy Tuna</mark> w/ avocado roll, the katana roll, green tea fried ice cream, and some banana dessert. the portions were smaller than usual, but the quality, i would agree, was also better than the typical. the total came out to be a little over $100, not including tip. \n\nthanks, bug, for such a romantic and fun date. swooooon. :)", 
            "if it wasn't for yelp i wouldn't have found this place, it's tucked away in the shops and on the third floors.  \n\nthe atmosphere is definitely \"uppity.\"  very dark modern feel to it.  \n\nok, so as far as sushi goes, this place is pricey.  but, we went to vegas for a friends bday and wanted a nicer place to dine. \n\nstarted with the edamame hummus - which had a more watery consistency to it than i am used to.  there was edamame beans in there, which added textures.  i did not, however liked the chips that came with it for scooping.  \n\ni tried the <mark>Spicy Tuna</mark> and spicy scallop roles.  they were good, i guess.  i think i've had better sushi elsewhere.  my friends raved about the crab dynamite roll, but i didn't try it.  the portions for the bbq chicken special was so tiny for the price - i couldn't see anyone getting full by it.  \n\nthe best part of the meal was the dessert.  we told our server one of us was having a bday and they brought two sufferer deserts, and a cool flaming firecracker type candle.  considering the place was dark, it lit up our table and made for a fun presentation.  also the desserts were very delicious - a very rich chocolate brownie with ice cream and strawberries, and a fruit blend type of tart, i can't describe too well.\n\ni think this place is more presentation than food quality.", 
            "just had a business dinner here the other night.  it is located in the shops at caesars palace.  this is the second time that i have at there, but i will focus my review on this past visit.\n\nwe had a sample menu with a variety of different appetizers and entrees, so we really ate much of the menu.  for sushi on the las vegas strip, this place would get four stars from me.  i normally hate <mark>Spicy Tuna</mark> rolls, but i absolutely loved this one!  the rest of the food was just as impressive. \n\nnow the bad.  first, the service was only ok.   there wasn't anything that stood out as really horrible, but for the price of the restaurant i would have expected more, especially in las vegas.  also, i am really into my wine, and this place gets an \"f\" for  their wine list.  there was nothing that really was appealing, and the cab i ended up trying was so bad that i changed to sapporo.  \n\noverall, nice place to have some sushi while you are in the caesars area.  maybe you would have a little better experience than i did with the service only focusing on 2-4 people instead of 20-25.", 
            "as a purveyor of all food fine, my wife and i ate here this past friday night.  the serviec was friendly and not stuffy.  our server louis was great, very knowledgeable on the menu and a fellow foodie.  \n\nthe decor was very hip and the strip view from the main dining room were amazing.  we sat at the large couch-like tables and seating area, which are the best seats in the house.  \n\nwe ordered the <mark>Spicy Tuna</mark> on cripsy rice, which was very good.  the jalepenos were diced and mixed into the tuna which was much better than most places that just place a sliver of the jalepeno on the rice.  very tasty.  we also ordered the peppered kobi beef skewers which were tender and flavorful. perfectly grilled.  \n\nwe also ordered the baked crab handroll...which were the best we've ever eaten and we've had the ones at katsuya and koi. these by far were the best as the crab was flavorful and was stuffed in there...unlike katsuya where they have the tendency to skimp on the ingredients.\n\nthe best part of the night was the chilean sea bass with miso glaze. that fish was cooked to perfection, it was light, flaky and ever so sweet.\n\nthis place rocks!", 
            "sushi roku is, simply put, delicious.\n\nmy husband and i are huge (and i mean huge) supporters of katsuya. sushi roku took them down a notch. if i could, i'd put a picture of sushi roki over katsuya with the verbage \"owned!\"\n\nluis, our server, was friendly, personable, full of knowledge, and a fellow foodie. no wonder why we loved him so much. his service was impeccable.\n\nlet's talk about the ambiance first. immediately, you are greeted with a smiling pretty face. our host walked us through the restaurant to the table. the decor was awesome. very mellow, chill, and fun. all the waiters and sushi chefs smiled and greeted you as you walked by.\n\nwe had an incredible view of the las vegas strip from our ridiculously comfortable table. the couches were amazing. i could've taken an afghan, my lychee martini, and been perfectly comfortable all night. we had, in my opinion, the best seats in the house.\n\nmy husband and i both had lychee martinis. mmmm. i can still taste it. mellow, light finish, perfectly sweet. it tasted like watching a sunset - it made me feel blissfully happy and warm inside.\n\nthe food..... wow. let me say that this is based on hot food, not the sushi. so i can't judge there... however....\n\nour entire meal consisted of hot appetizers. oops! they were just that good. we had kobe beef skewers, <mark>Spicy Tuna</mark> on crispy rice cakes, baked crab handrolls, and chilean sea bass in a truffle miso glaze.\n\nthe kobe beef skewers were delightfully tender. they melted in your mouth. the glaze was a perfect compliment - not overpowering, not weak. the <mark>Spicy Tuna</mark>.... i liked that it was a perfect square and no rice was showing (i'm strangely anal like that). the <mark>Spicy Tuna</mark> had the jalapeno's diced and mixed in. that was so much better than the slice on top and for some reason, my stomach handled it better han the thin slice on top.\n\nthe baked crab handrolls deserve a huge o-m-g. the crab meat was fresh and busting out of the handroll. we couldn't believe how much meat they stuffed in there. i could live off these things. i love the contrast of the cool soy sauce/rice wrapper/crab meat with the warm rice. (i'm drooling now. nice work, self)\n\nand finally, the chilean sea bass - perfect perfect perfect. 5 stars. i didn't really taste the truffle in the glaze, but the light tender fish more than made  up for that.\n\ni'd go back again in a heart beat.\n\nand luis - thanks, man!", 
            "great sushi, but expensive!! then again unless you're buying a hot dog for dinner, everything in vegas is expensive!! we loved our meal. we had salad, one cocktail, 1 <mark>Spicy Tuna</mark> roll and a <mark>Special Executive Bento Box</mark>...are you ready? $100!! yes. but worth every penny. every dish was flavorful!! worth it!!", 
            "went for lunch recently and the place was empty! so we ordered the chef's special, a combo of sashimi and rolls and it was alright. the <mark>Spicy Tuna</mark> had a strange, mushy texture-i was not a fan. we also ordered the shrimp tempura roll which was great. i may have been expecting too much; i was not impressed with this lunch. with two cocktails and tip it was over $80!! ouch! i do not think i will return-there is better sushi out there for less money. only go here if you want to over spend on sub-par sushi. the view was nice!!", 
            "we were a little scared from the front since it was a thursday night and it seemed empty, but after walking to the back of the restaurant, we realized everyone wanted to sit by the view over looking the strip-romantic.\n\nhonestly, i could live off the <mark>Spicy Tuna</mark> here. it's perfectly spicy, perfectly textured, and perfectly great. try the spicy scallop hand roll and yellowtail sushi too; all their fish is extremely high quality, and it obviously reflects the steep prices.\n\nwe ordered a bottle of saki (can't remember the name, probably because i couldn't  pronounce it at the time), and it went down extremely smooth and had a great, light flavor.. our waitress would run over everytime she saw our shot glasses empty and pour us another round; royal treatment.", 
            "warning!!! do not order the chef's omakase menu! \n\nmy husband, cousin, and myself were staying at caesar's palace this past weekend and we were craving sushi. since sushi roku was located inside the hotel, we decided that it would be convenient to go there. \n\nwe decided to splurge a little and try the chef's omakase menu ($90 per person). we were super excited. they even offered a complimentary glass of champagne which was so delicious.  \n\nthe meal started off strong. we were served a piece of halibut sashimi w/ shiso leaf & yuzu gelee, a piece of king crab w/ caviar, and a piece of seared toro with a piece of truffle on it. all three of us were in ahhhh. this alone deserves two stars. we immediately thought that if the first course was an indication of what was to come....we definitely were in for a treat.\n\nunfortunately...it was all down hill after wards. our second course was a seared albacore salad. it was good, but nothing special. the third course was 4 pieces of red snapper sashimi (this was one of our least favorite dishes). the 4th course was a miso glazed halibut (so common). then came the sushi course. i was expecting this  to be the best course, but it ended up being the worst. we were served <mark>Spicy Tuna</mark> rolls topped with pieces of sashimi (kind of like a rainbow roll), and three pieces of sushi (toro, mackerel, and yellowtail). all of this was followed by a chocolate lava cake for the dessert. \n\nour bill came out to $377 and it was a major disappointment. i've eaten at other sushi roku locations and they were good, but this meal just pissed me off. when someone orders an omakase menu....it pretty much represents what the restaurant has to offer. if i knew i was going to get <mark>Spicy Tuna</mark> roll for $90, i would never had opted to splurge. \n\nnote: the rating that i give sushi roku is 2.5 stars. the half star is simply for the complimentary champagne that comes with the omakase menu.", 
            "amazing sushi!  everything in vegas is pricey, and this is no exception.  however, when the food is amazing and the sushi chef is knowledgeable, it's worth it!  prices weren't too bad...  i usually check the prices of the <mark>Spicy Tuna</mark> roll (since every sushi place has them) for comparison.  the <mark>Spicy Tuna</mark> rolls at sushi roku were $11.  again, expensive, but not over the top.  and for delicious sushi, i'll take it any day!  make sure you go here - much better than yellowtail sushi in the bellagio, and less expensive too!", 
            "had my bday dinner here. i had a <mark>Spicy Tuna</mark> octopus roll which was so good. i love octopus. also, for dessert they gave me chocolate souffle with a sparkler on top. love it", 
            "happened upon sushi roko when looking for lunch options with my boyfriend. the modern, zen-like decor beckoned us in. this place is hip, right in the midst of the strip with sweet views. our server was very nice and extremely helpful. gave us a run down on the sushi and offered great recommendations. \n\nthe sushi concoctions here are unique but a bit on the pricey side ($20-30/roll). we ordered the katana roll (<mark>Spicy Tuna</mark> and shrimp tempura on top of tuna and yellowtail), the shima roll and the baked lobster with miso sauce. the shima roll was excellent with a nice melding of flavors -- shrimp, <mark>Spicy Tuna</mark>, avocado and cilantro. the katana roll had a funky sauce drizzled on it -- not a big fan. my boyfriend loved the lobster roll -- generous pieces with a mouth-watering taste. \n\nsushi roko is a nice choice for couples, friends or large groups.  the atmosphere is fun, hip and elegant. just be prepared for a big lunch/dinner tab. our lunch bill topped $100 with no alcohol and i still had a little bit of an appetite when we left. awesome sushi and vibe though!", 
            "went here for lunch. ordered lunch sized teriyaki chicken with salad and <mark>Spicy Tuna</mark> roll and a specialty roll of shrimp tempura, <mark>Spicy Tuna</mark> and tuna and yellowtail sashimi. i thought it was waaaaay overpriced for the quality. i eat sushi at least once a week and this was not good. the chicken was over cooked and the <mark>Spicy Tuna</mark> had the consistency of baby food. moreover, we spent $50 on lunch and left hungry. i would not recommend this restaurant.", 
            "one of the best sushi restaurants in vegas.\n\nrolls are a bit pricey but are very creative and have much more fish than most of the other \"fine dining\" sushi restaurants on the strip. \n\nwe had the katana rolls which consisted of tuna and yellowtail on top of a roll with <mark>Spicy Tuna</mark> and shrimp tempura, these were fantastic, the shrimp was perfectly tender and the flavors worked well together.\n\nalso had the crunchy <mark>Spicy Tuna</mark> with avocado which was perfect. and the spicy scallop roll which we really enjoyed.\n\ni was quite hungry and wanted something hot so we tried the chicken yakitori  skewers, awesome, and the kobe beef skewers, alright but not as good as i would have hoped.\n\nservice was excellent and the bar makes some very innovative cocktails, i am not much of a cocktail drinker myself but my better half ordered the tokyo cooler which i tried as well and agree with her opinion that it was fantastic.\n\ntab was just over $160 with three rolls, the chicken and kobe skewers, a shared dessert, two cocktails, and a couple beers. not bad for vegas.", 
            "great, especially better at the happy hour. been here several times before, and we love it each time. pricey, but good. ambiance was great, and great location, you can shop after too work off the calories. <mark>Spicy Tuna</mark> as usual was the bomb, juts enough flavor not too greasy. volcano dessert was awesome.", 
            "lovely little spot. i ventured out for a solo dinner while friends were snoozing. \n\nwhile i am a vegetarian, i cheated with a few seafood items while in vegas, and sushi roku was one. i went with a sashimi app ($26 for eight pieces) and a <mark>Spicy Tuna</mark> roll (with add ons). \n\ni agree that it was overpriced, but the service and location were stellar. i do wish they'd had a larger selection of specialty rolls.\n\nthe fish was of seriously impressive quality - it was worth my one-time cheat. \n\nback to vegetarianism, now and forever!", 
            "i can't go to vegas without hitting up sushi roku...i love everything about it, from the service to the drinks (my favorite is the tokyo cooler, although the pineapple upside down cake martini is a close second) and the view and the food (hanabi, i dream about you!).  \n\non my most recent visit, my husband and i went for happy hour on a monday afternoon.  happy hour is only available at the bar, but it is an amazing deal!  we had a <mark>Spicy Tuna</mark> roll and the rock shrimp and jalapeno roll.  roku has the best <mark>Spicy Tuna</mark> of any sushi place i have ever visited.  we also had the popcorn shrimp - ask for a side of spicy mayo to make this even more delicious - and the miso eggplantt.  they even have dessert on their hh menu and how can you go wrong with a mini chocolate volcano cake?", 
            "meh, sushi is not that great and they raised their prices over the last few years.   i get that commodity prices have risen but $15 for a sub par <mark>Spicy Tuna</mark> roll?  no thanks.  also, the servers are not very professional and don't seem to communicate.  we were asked to order drinks and dinner twice and we paid our bill then a different server dropped off our bill asking us to pay when we are ready.  total bill was $100.  i would rather eat at a fine dining restaurant like mastro's or del frisco's.  twice the price but better service.", 
            "this was our second thanksgiving dinner here (weird, i know).  we came back because the food is good and the decor is nice for a dress-up family dinner.  i'm from hawaii, so my standards for raw fish are high (which explains the lower rating for some of the sushi items). \n\n<mark>Spicy Tuna</mark> roll w/ avocado: 3 (boring)\nhottate (scallop sashimi): 4\nikura (salmon roe): 4\noysters: 4\ntofu 3 ways: 5 (served with truffles, caviar, and ginger with delicious sauces and red dipping salt)\nmiso eggplant: 5 (so good!)\nshishito peppers: 5\ntuna tartare: 4.5\n\nservice was a-ok, no problems.", 
            "yum. i went recently and was very happy with not only the food, but the service. my water glass was never empty, and they often came by to check on us. \n\nthe food: i had the yellowtail sashimi appetizer with diced chilies. for an appetizer, $17 is a bit high--the portions were a bit small, but this was so delicious. the chilies did not seem spicy to me /at all/ but the whole thing was really flavorful. i could have easily eaten a pound of this. \n\ni got a few sashimi pieces (maguro, hamachi), and the crunchy <mark>Spicy Tuna</mark> roll. yes, i evidently love tuna. at any rate, these were all really delicious and i was totally happy with my selections. \n\nthe restaurant itself is beautifully decorated, and its location inside the forum shoppes is convenient. \n\nwould definitely eat here again!", 
            "good food, very overpriced because of location and the view. servers were knowledgeable but had an air of pretentiousness. i had the 6 piece chef choice, 2 pc bluefin, uni and <mark>Spicy Tuna</mark> rolls. all good, but much better ayce places for $60 for two exist in the valley. but if you are in the ceasar's shopping this is a good sushi spot. 4/5", 
            "cute place. the interior is very upscale, and intimate. it's a nice place to have a nice romantic dinner with the love. i would suggest to request the strip view when dinning in because the strip view is just lovely. \n\nthe menu is ok. i personally prefer authentic japanese cuisine at a local area (spring mountain!), but there are a few things here that i like. their signature martinis are good! i would definitely recommend the lychee martini. you get a big piece of lychee as a garnish, and you can taste the lychee flavor of the martini. so if you are all for a nice sweet taste to your martini i'd definitely recommend it.\n\nour group ordered the seared tuna tataki, <mark>Seaweed Salad</mark>, yellowtail sashimi, crunchy <mark>Spicy Tuna</mark>, rock shrimp tempura, and chicken yakitori skewers. to me, it was nothing special or anything that stands out to where i feel like this place might be the only place to satisfy a distinct craving. the food is very light, fish is fresh, and the portions are small. \n\ni haven't tried the omakase yet, but i would like to actually try it once to see if it is worth spending $90 for. the omakase might be the only thing worth gambling on. all in all the experience was nice and the service was wonderful. if you don't mind burning a big hole in your pocket for a nice fine dining experience, and a small stomach and appetite then i would recommend it.", 
            "we went for lunch and had a really good time.  the tempura was so fresh as was the eel and avocado roll and the <mark>Spicy Tuna</mark> roll.  the beer was so fresh and the atmosphere was perfect for lunch. the seating is super cozy and it made us want to stay all day and eat sushi and drink beer! :)", 
            "for a place that i have expected to be trendy with amazing food, this place falls flat.  \n\nthe cocktails were mediocre, and food was mediocre.  the only thing that was sort of ok was the atmosphere.  \n\nwe were first there for drinks, but later decided to have dinner.  the bartender that day didn't seem too happy and had a straight face the whole time.  he didn't try to make any kind of conversation and just made drinks and took our order.  ok, i don't mind it too much because as long as he made great drinks and didn't mess up our orders i didn't mind.  the drinks as i said, were mediocre.  \n\nwe had a couple rolls and it was still mediocre, which was very disappointing.  i had hanabi with <mark>Spicy Tuna</mark> which i thought the flavors just didn't mesh well at all.  the tuna itself was amazing, but with the fried cube of sushi rice dipped in sweet soy sauce... it just doesn't fit.  the <mark>Seaweed Salad</mark> was a little bit on the salty side, and that it was nothing more special than the ones i can get from a japanese market.  \ni also had shima roll, which was shrimp wrapped with <mark>Spicy Tuna</mark>, avocado, and cilantro.  it was not bad, but not good either. just bland i guess.  not impressed. \n\noverall i thought with the price i paid i could have better sushi elsewhere.  if i wanted mediocre sushi i didn't have to come all the way to vegas.", 
            "stopped in here on a tuesday night after hoofing it through the forum shops for a while. super friendly hostess met us at the door and walked us past the sushi bar where all the chefs hollered out a welcome.\n\nloved the decor--dark, rich, invitingly modern and warm without being dreary. never having been here before, what did we do? a little of everything. edamame beans as well as edamame hummus served with wonton crisps. husband had salad with a delightful peanut-based dressing; i had crab miso soup that was good, but not worth the money. better off just ordering standard miso soup.\n\nthen came the rolls. a <mark>Spicy Tuna</mark> with a serious kick, and very good flavors. but my favorite? the takana roll, which was draped with the most perfect, buttery yellowtail i have ever had in my life. it melted with each bite, and was the highlight of the meal...so much so that when we finally launched into our baked lobster roll, i did the unthinkable--i sent it back. it was positively bland and flavorless compared to the takana roll, and was a real let-down following that amazing yellowtail. the manager, gary min, came over and removed it without batting an eye, and was incredibly gracious and accommodating from beginning to end. our waitress, tina, was also delightful, and very helpful and present without being overbearing.\n\noverall, a really good meal. we'll be back for sure!", 
            "i'm pretty happy with what he had here. we considered going to shibuya, since i knew it to be good, but since we're in the venetian and it's in mgm grand, that's a serious hike. so we headed down to ceasar's for this spot, and were well rewarded.\n\nservice is very friendly - we walked right in and sat at the bar. we ended up ordering a decent selection of nigiri, as well as a <mark>Spicy Tuna</mark>, spicy shrimp, and white lotus roll. i also had my standard <mark>Seaweed Salad</mark>, which was excellent, although tasted a little like there was a fruit dressing, which i could have done without. maneki in seattle still has my all time favorite sunomono.\n\nrolls were very good, especially the white lotus roll, which, if i'm remembering right, was crispy shrimp, avocado, and asparagus inside, with yellow tail on the outside, fresh hot peppers, and some various sauces. awesome. i'm really starting to like the fresh peppers in sushi, which i'm seeing in more and more spots. also worth mentioning, the hamachi i had here is maybe the best i've had. super tender, super flavorful, just awesome.\n\nprice was excellent too - they left an item off our bill by accident and when we reminded them, they just waved it off. even with that on the bill, for two people including a couple drinks, the total came to under $100. no, not cheap, but it's sushi...in las vegas...and we ate ourselves full. definitely a would return.", 
            "this is another 2 star 4 star averaging out to 3 star type place.  \n\nthe 2 star stuff.... don't get me wrong, the food was awesome.  but i walked out feeling like an idiot for paying what i did for what i got.  eighteen bucks for <mark>Spicy Tuna</mark> with shrimp, cilantro, and avocado?  ouch.  it did have 10 pieces, but they were the size <mark>Accompanied with your choice of one</mark> of those budget happy hour california rolls you get for 3 or 4 bucks at a normal sushi place.  the baked lobster roll only had 6 pieces, barely fit for an appetizer (and the asparagus spear inside was about half of the volume of the interior of the roll). \n\nthe 4 star stuff.... the view of the strip was pretty sweet, although it was predominated by the caesar's palace tv thing.  the decor was nice, very dark and trendy/classy.  the service was great, they were very attentive and even brought out some cheesecake for my friend's birthday.  the fish was very fresh (impressive, being in the middle of the dessert) and everything tasted very good.  simple, elegant flavors with a lot of attention to presentation.  the sake selection was extensive and had a decently priced and very good house sake and a 3-sake tasting flight with big pours.  \n\nthe funny thing is, i'd come back.  it's hard to find good sushi and even though i felt pretty dang close to being ripped off, this was good sushi.  i'll probably try some other places nearby first.  oh, and this would be a fantastic date place.", 
            "came here for happy hour and nosh on a thursday night and had a great time!\n\nwe ordered appetizers off the happy hour menu but skipped the happy hour drinks because it looked boring.  instead, we ordered a bottle of sake and hendricks cocktails (gin, lime juice, simple syrup, cucumber).  these are the appetizers that we loved and would order again:  shishito peppers, green beans, <mark>Spicy Tuna</mark> rolls, shrimp & jalapeno rolls.  the fillet with asparagus, albacore rolls, popcorn/tempura shrimp were just okay and not worth reordering.\n\nmy hands down favorite were the shishito peppers!\n\nservice was impeccable!  i can't remember our server but we were there awhile and had 2 different servers and both were excellent!", 
            "i loved this place.  probably the best place i ate at all weekend. lets see what we ate:\n-crunchy <mark>Spicy Tuna</mark>: had avocado, <mark>Spicy Tuna</mark>, spicy mayo sauce and a crunchy topping it was amazing! i loved it\n-baked lobster roll: baked lobster, rice paper roll, asparagus, miso sauce.  it was all wrapped up and then baked and the miso sauce is nice and toasted and warm it was soo delicious\n-spicy scallop roll: i had the cut roll not the hand roll. honestly it was just okkay. nothing super spectacular\n-shrimp <mark>Fried Rice</mark>: pretty yummy just your basic <mark>Fried Rice</mark> we all shared it and it was good\n-miso soup: perfect not too salty but just right\ni mean lets be honestly everything in vegas is expensive so i don't think the prices were outraged compared to everywhere else. i think for the price it is way better then anywhere else that we went.  if u are a sushi lover like i am then i think you will enjoy this place and bonus its air conditioned inside the mall so its nice!", 
            "dined here for my boyfriends birthday on vacation in vegas. i chose this restaurant based on the price vs. reviews and we were not disappointed! both of us eat sushi regularly, and tend to be a bit picky, but sushi roku delivered. after finally locating the restaurant (we got lost in the huge ceasars hotel), we were greeted by the super cute and friendly door girls. i was pleased that we had a table with a great view of the strip. our server was helpful in recommending drinks, and we both started off with an order of miso soup and <mark>Vegetable Tempura</mark>. the soup was the perfect amount and so flavorful, the tempura hot, fresh, and delicious. for sushi, we decided on the yellowtail, salmon, crunchy <mark>Spicy Tuna</mark>, and tuna. everything was spectacular! the yellowtail was fresh and melt-in-your-mouth delicious. i wasn't a huge fan of the crunchy tuna, only because i don't really like 'hot' rolls, but it was still yummy and hit the spot. for dessert we had the creme brulee trio, which topped off the meal perfectly. i would definitely return, the service was great and for the price (especially in vegas), you cant go wrong!", 
            "much better than some other outlets in this chain. the trick here is to order appetizers, such as the tuna sashimi with crispy garlic chips, or yellowtail and <mark>Spicy Tuna</mark> on crispy rice, not conventional sushi and rolls, which are just so-so.", 
            "2012 fall restaurant week lunch #1. i'm going to try pump these reviews out fast. just in case people had a hard time choosing where to go... like me!\n\nmy friend and i wanted to find a sushi place who offered a lunch course for restaurant week. we both never dined at sushi roku previously. it's located on the strip side, 3rd floor of the forum shops. for restaurant week, they're offering a 3-course lunch for $30.12. we ordered each option. i've posted pictures of all our food.\n\nfor lunch:\n\n1st course:\nchoice of: <mark>Spicy Tuna</mark> hanabi (crispy rice cake) or \n<mark>Seaweed Salad</mark> (cucumber sunomono, plum vinaigrette)\n\n2nd course:\n\nchoice of: sushi (tuna, yellowtail, salmon, albacore, whitefish, <mark>Spicy Tuna</mark> roll, miso soup) or grilled petite filet (homemade teriyaki sauce, steamed rice or mashed potatoes, miso soup)\n\n3rd course:\nchoice of: mini chocolate cake or fresh fruit & sorbet \n\nthe appetizers were nothing spectacular, not even spicy. the sushi fish and miso soup did taste fresh. they didn't ask us how we wanted our filet cooked, it came to us medium-well. my friend didn't mind it, but i'm more of a medium-rare steak lover. not only was i confused that a sushi place was serving mashed potatoes, they were pretty dry and ordinary. <mark>Spicy Tuna</mark> roll was pretty standard. \n\nthe chocolate cake was good, a bit too rich and dense for me. \n\nthe tastiest thing was the mango sorbet. i'm not a big sorbet person, but this one was truly delicious. it wasn't mango-flavored. you could actually feel the strands of real mango in the sorbet. best i've ever had. \n\nthe presentation was great. the service was on point, from the hostess, bussers, our server, and the sushi chefs who greeted us hello and farewell.\n\ni had a good time, it was one of those lunches where nothing went wrong, yet your tummy wasn't doing the happy dance when you left. the service and presentation, (and of course the sorbet!) made this 3-stars for me. i wonder if i would've had a better experience if i had come to order off the regular menu. other than it being an opportunity to donate to charity, if restaurant week is a chance for establishments to show what they can offer, sushi roku didn't impress me that much...", 
            "if you are coming for the view you will be very happy, if you are coming for the sushi you will be mostly happy.  my husband and i snuck away for a dinner from our group and based on reviews ended up here.  we started with mixed <mark>Vegetable Tempura</mark> and kobe beef potstickers....wonderful choices for appetizers. \n\nthe katana roll was delish and we were very happy with our choice here.  after all that we decided to do one more roll...we shouldn't have.  the crunchy <mark>Spicy Tuna</mark> disapointed. it was warm which we were warned about but it was just bad and not crunchy. overall good experience but was hoping for amazing sushi which was not here.", 
            "stumbled on this place while on a shopping excursion at the forum shoppes.  the timing couldn't have been better since we arrived during the afternoon happy hour.  nothing we ordered from the happy hour menu was over $6, including\n- stella artois\n- blue moon\n- <mark>Spicy Tuna</mark> roll\n- rock shrimp w/ ja roll\n- shrimp tempura roll\n- whitefish tempura roll\n- eggplant tempura roll\n- albacore tuna roll\n- filet wrapped asparagus\n- crispy chicken\n- chocolate volcano cake\n\nthe sushi was fresh and the tempura was crispy.  the true testament to this place is that my wife, who does not each sushi, actually enjoyed most of the sushi!  we both thought the eggplant tempura roll was inventive and as good as any of the traditional rolls.  you'd be wise to skip the crispy chicken completely as it was tasteless and dry.  the chocolate volcano cake was...amazing and i could drink the vanilla bean sauce that came with it with a straw!\n\nkeep in mind, this is basically a happy hour review, so there are probably much cooler and fancier offerings on sushi roku's full menu.\n\nlastly, a shout out to james our great bar tender!", 
            "the ambiance (dim lighting and japanese modern furniture) and view of the strip really drew me in on my first visit here.  \n\nthe sushi was good.  i really enjoyed the <mark>Spicy Tuna</mark> hand roll, california roll, & the shima roll.  everything we had was fresh and delicious.\n\ni highly recommend calling ahead and booking a reservation.  also, plan to spend at least $75 for a dinner for 2, and that is without drinks.", 
            "i adore sushi roku and try to make it there for dinner every time i go to vegas.  every time i've gone the service, food and ambiance have all been wonderful.\n\non my most recent excursion my friend and i selected the sake sampler to start as well as a slightly seared albacore sashimi appetizer that was delicious. \n\nafter pursuing the menu we ordered a few more delicious bites including the <mark>Spicy Tuna</mark> hanabi (my personal favorite), filet-wrapped asparagus and tuna belly sashimi. all were rich and wonderful. we may have had a few other items, but those are the ones that really stood out.\n\nit was a little pricey for the two of us, but with the sampler, a few beers and all that food it was soooo worth it.", 
            "i normally would give this type of restaurant 4 stars, but because of the fact that it's in vegas and it was a valentine's dinner, i will go all out and give it 5 stars! \n\ni had sushi roku as one of my bookmarks, and as i was sitting around waiting for my boyfriend, i realized that we didn't have reservations anywhere on valentine's night. we had a show that night at the caesars hotel, so i figured this would be perfect! i called and they took us in no problem. she did ask for my credit card to hold my reservation, but the machine was broken at the time. i wonder if they charge you if you don't show up..?\n\nanyway, it took us awhile to find this restaurant and i am pretty sure we went around and found every place you can eat at before we got to sushi roku. so for any future diners, the best thing to do just go through the forum shops since it's located there, rather than the actual hotel. the atmosphere and decor is absolutely beautiful, from the lighting fixtures to the bathroom doors. we were sat at a table that had the view of the entire strip on one side and the other side looked out to harrah's.. sooo cool! this is worth a visit just for the view alone!\n\nthe service was great but the food was even better... \n\nfor the appetizer we got the tuna sashimi carpaccio - i have never had anything like it before. it was delicious and so fresh that the tuna pieces just melt in your mouth. for our entrees, we split a few rolls:\n\n-makoto roll - it's a spicy yellow tail & shrimp wrapped with seared tuna in a creamy spicy sauce. it's probably one of the best rolls i've ever tried in my life.\n\n-rainbow roll, crunchy <mark>Spicy Tuna</mark>, and one more that i don't remember. every roll was unbelievably fresh and done to perfection. \n\nfor dessert, we both had cappuccino's and split a dessert - raspberry bread pudding with carmel... oh my! \n\nthis was definitely the best meal of the trip and a perfect place for a date!", 
            "i come here every time i'm in las vegas and have done so for years. there is one close to me in los angeles, but i truly believe the vegas location is the best of them all.  yes, it is expensive, but the fish is flown in daily and it is consistently the best tasting fish available.  \n\ndo yourself a favor and order the shima roll with <mark>Spicy Tuna</mark>, shrimp, cilantro and sriracha.  it is fantastic. other must-try menu items are the garlic green beans, tuna carpaccio with garlic chips, the baked miso black cod, yellowtail sashimi with diced chilis, anything from their sushi/sashimi menu and their specials are always great. whenever foie gras is on the specials menu, my partner always orders it because he can't get it in california and he always enjoys what he orders.  \n\nwhen you make your reservation, request a table by the window for a spectacular view of the strip. this makes an already romantic setting even more special.", 
            "sushi roku is inside caesar's palace on the third floor of the forum shops. the inside is a mix of modern and asian design. it looks sleek and posh. \n\nthe food is a little pricey, but it is understandable since it's on the strip. the view from the dining area is really nice. i ordered the <mark>Spicy Tuna</mark> roll because i am a huge fan of <mark>Spicy Tuna</mark>. it did not disappoint. the tuna was very fresh and it was obviously much better quality than other sushi places. \n\nthis is a good place to go for dinner before a night out. nice and classy.", 
            "totally killed my feet while treking through the forum shops at caesars to get to this place, but hey i had to look flyyyy and wear my oh so unomfortable heels =\\\n\nanyhoo, on yelp it says this place is located though caesars palace, and maybe that is the easiest way to get there, but damn it is far!  and in heels the walk seems so much further.\n\nmy so and i came here for our anniversary dinner.  we were seated by the window, and had an amazing view of the strip.  \n\nwe ordered:  \n\nstarters\n\n-chinese green beans with garlic  - super delish.  i could eat these all day.\n-tuna sashimi carpaccio - reallly fresh, and tasty.\n\nmains\n\n-baked lobster roll - this roll was so dissapointing.  the lobster was chewy, had an unusual taste to it.  i couldnt stomach more than 1 bite. \n-<mark>Spicy Tuna</mark> roll - so delish!  it was fresh, and melt in your mouth good.\n-panko double shrimp roll - my favorite!  so good!\n\ni've been to the sushi roku in arizona, and that location was so superb...i was hoping this location would be just as good, but turned out to be just okay.", 
            "i'm sure there are other great sushi spots in vegas, but, if it ain't broke...\n\nthe most recent trip to sushi roku is 4-star worthy, just like all the others. wonderful sake and lots of different sushi selections. i still stand behind the <mark>Spicy Tuna</mark> hanabi and filet-wrapped asparagus. i'll also add the <mark>Seaweed Salad</mark> to the list of winners at sushi roku.\n\nservice was super friendly as always, and the nigiri and sashimi was very tasty and fresh.", 
            "great sushi in vegas..not a prime location, but if you go for happy hour (until 7 m-th), the prices are super reasonable. i recommend the tuna tataki app, fried mushroom app, filet wrapped asparagus and <mark>Spicy Tuna</mark> roll. note, you have to sit at the bar to get happy hour prices. def give this place a try!", 
            "alright i am not lying when i say sushi roku has the and i will say it again the best filet mignon i have ever tasted!!!!....!!!!! (medium rare). i could take it apart with my fork and sight pressure from my knife.   we had popcorn shrimp too (big portion). i was so full when i left.  the atmosphere of the restaurant is dark  but sexy and has a great view of the strip (so ask for a window seat).  my girlfriend had the <mark>Spicy Tuna</mark> roll which was good. \n\n the app menu is long so don't get confused like i did, but i was impressed with  popcorn shrimp, so no telling how large the other apps unless i hear it from you yelpers. but there was some stuff that sounded good.", 
            "yes yes yes!  amazing happy hour sushi.  the bartenders are friendly, the expensive far east mule cocktail was to die for, and the sushi rolls were phenomenal.  \n\nrock shrimp tempura jalapeno and <mark>Spicy Tuna</mark> rolls were amazing, as were other i tried.  small seating area for happy hour, but force yourself in because it's well worth it.  \n\ni was able to get the free wifi from the close coffee place while eating.", 
            "pretty average sushi nothing too special. the restaurant was pretty empty on wednesday night. we ordered multiple roles the best role what's a <mark>Spicy Tuna</mark> the little piece of jalapeno on top of each roll. i've had a lot better sushi at better prices but i guess this is what you can expect in vegas. at least i can say the fish tasted fresh", 
            "i ordered the crispy <mark>Spicy Tuna</mark> ($16) with chicken <mark>Fried Rice</mark> ($15), both were filling and well prepared. service was great, ambiance was excellent. well priced considering you're in vegas.", 
            "delicious fresh sushi! got the <mark>Spicy Tuna</mark> roll and absolutely loving it! the sashimi is a bit pricey, but everything is very well done. highly recommend!", 
            "we had miso soup, crab dynamite roll and the sushi mix with <mark>Spicy Tuna</mark> roll.  the <mark>Spicy Tuna</mark> roll tasted very fresh.  miso soup was also excellent!  in comparison, the food prices seemed very reasonable.", 
            "we ate here mainly because the online menu looked like \"normal\" sushi. although when we got there, it was mostly japanese entrees with some sushi. i personally like the americanized sushi rolls that contain very little raw fish. i know that's not what real sushi is, but i'd rather not eat a moving octopus.  anyways, they had some good stuff. we had the crunchy tuna roll and the katana roll. the crunch roll was amazing, it had <mark>Spicy Tuna</mark> inside. the katana roll had raw tuna on the top that was like warm, not a fan of warm raw fish. but it looked nice. \n\nthe atmosphere was interesting. it was super dark inside like a fancy restaurant but the techno music was so loud that i couldn't  have a conversation at all. the staff was super nice and very helpful though. \n\ndid i like it?; sort of. would i come back?: no.", 
            "our group had a fabulous meal here. it was pretty easy to get reservations, even for our group of 14 people. we ended up splitting the table \"in half\" and have each side order their own food to share (family style). i think our side won:\n\nfor appetizers, we ordered:\n\ntuna sashimi carpaccio: 4 out of 5 stars\nyellowtail diced chilies with olive oil & garlic ponzu: 4 out of 5 stars\norganic garden salad with yuzu ginger dressing: 5 out of 5 stars (as far as garden salads go)\n<mark>Seaweed Salad</mark> with cucumber sunomono: 3 out of 5 stars\nshishito japanese peppers in soy garlic: 5 out of 5 stars (so much flavor!)\nbrussel sprouts with bacon and yuzu kosho: 5 out of 5 stars (it's bacon!)\n\nfor entrees and special rolls, we ordered:\n\nuni udon creamy pasta: this was actually more like fettuccini, not udon noodles. it was definitely very creamy and heavy. i liked it, but i wouldn't say it was my favorite dish of the night. 3 out of 5 stars. well, let's make it 4 out of 5 stars, since the uni pieces were huge.\nfilet mignon wrapped asparagus: it comes on a hot rock. 4 out of 5 stars.\ncrunchy <mark>Spicy Tuna</mark> roll (this is typically deep fried, but there is an option to just get the deep fried crunchy flakes on top of the roll). 4 out of 5 stars.\nkatana roll: <mark>Spicy Tuna</mark> & shrimp tempura topped with tuna and yellowtail. 5 out of 5 stars.\nmakoto roll: yellowtail & shrimp tempura wrapped with seared tuna, spicy creamy sauce. 5 out of 5 stars. these rolls were pretty similar actually...oops.\n\nthe other side ordered the prime rib eye steak to share, and we each tried a piece. if i go with a large group again, we are ordering that fosheezy.", 
            "my experience here has left me with no words. bad service. mediocre food. i can definitely say i'm never coming here again. it took over 20 mins to get our table some water and the waitress didn't own up to her mistakes and blamed the busboy for not bringing the water. when we got the water, it tasted horrible. our hotel room sink water tastes better than that. the food came so late as if they left to catch the fish we were going to consume. the waitress then forgot to put in one of our rolls and apologized in the most stand offish way possible saying it was a \"human error\" as if she wasn't even sorry about it. as we received the bill, my friend realized she got <mark>Spicy Tuna</mark> when she had wanted yellowtail. all in all worst place ever! the only decent person was the busboy. avoid the waitress with a feather tattoo behind her ear.", 
            "we went to sushi roku on their 10th anniversary day for the special menu.\n\n- shima roll: shrimp wrapped <mark>Spicy Tuna</mark>, cilantro & avocado\n- katana roll: <mark>Spicy Tuna</mark> & shrimp tempura topped with tuna & yellowtail\n- filet mignon-wrapped asparagus\n- popcorn shrimp tempura with spicy creamy sauce\n\na solid americanized sushi joint, priced high-end. although it was good, i would say katsuya and nobu are better.", 
            "pleasant atmosphere, stunning view, the staff is ultra friendly and helpful, and they'll do a huge portion of their menu gluten free!! this the first time ever that i have been able to order gluten free <mark>Spicy Tuna</mark>.  also their sashimi is melt in your mouth good!", 
            "like many of the reviews i thought the sushi was very fresh and the <mark>Spicy Tuna</mark> was actually spicy which u very much enjoyed. i also ordered the ramen and it was on point in terms of the broth being rich and flavorful. this is my new go to spot for sushi in vegas!", 
            "came here for lunch may 2015 and had the <mark>Spicy Tuna</mark> roll with avocado. \ni am the person who gave no tip because of the following bad service:\n- my server was basically not existent.  \n-i asked for brown rice instead of white rice and they said it's impossible to do brown rice because of the it all the time.\n\n-i got no avocado on it at all when asked. \n\n-no condiments on table or offered. \n-my food took forever to come and when it did it was luke warm/cold (it's deep fried) so it must of been sitting around for ages. the place was very quiet and after the lunch rush time. 2.30\n- the serving size was not worth the price\n- after i was finished, i was still hungry but there was no one around to get a menu off. frustrated at waiting, i went to the front desk and checked out", 
            "because the buffet at the flamingo i'd originally chosen to go to had closed that day for remodeling (lucky me), i had to find an alternative. i ended my search at sushi roku. i sat at the bar and my server, an inked young lady whose name slips my mind, cordially suggested their happy hour menu. i obliged and quite honestly, i had ten very good sushi rolls and a drink for around $15, a 1/4 of what they wanted for the buffet at the opposite end of the palace. i had the <mark>Spicy Tuna</mark> and something with salmon. both were fresh, not over spiced so much that you couldn't taste the fish, and a nice serving. service was attentive, quick and spot on with the recommendation. i'll stop in here again if i get a jones for sushi while on the strip. the lounge itself is rather nice as well and would make a quality spot for a dinner date too, if i had a date (groan...). maybe next time.", 
            "i had a great dinner last night at sushi roku. i've been there twice before but it's been a few years. i had the salary man cocktail which was good although it definitely could have been stronger. my boyfriend had the far east mule which was very refreshing. we had the edamame hummus which was pretty good, it came with fried pita chips. next out was the baked crab hand roll which was excellent, we actually ordered another one. then came the crispy rice with <mark>Spicy Tuna</mark> which is one of my favorite dishes in general, and it was extremely well done here, one of the best i've had- the rice was perfectly seared and seasoned. the chilean sea bass skewer wasn't anything special, i would not order that again. then we had a special called the titan roll which was phenomenal. the waiter asked if he could bring out more chips for the rest of the hummus so we said sure, but we didn't expect to be charged for it, no big deal though. the service in general was very good, we had a waiter and waitress and both were friendly and knowledgeable, and not pushy. the waiter suggested a wine for me and i was very happy with it. we were disappointed that they no longer offer the 20% discount for locals, not sure why they would stop that. but all in all the meal, service and atmosphere were very good and i would like to come back, maybe to try their happy hour next time.", 
            "5 stars for ambiance, two stars for both food and service. \n\ngreat decor and view looking over the street. service was slow, poorly timed, and not very helpful. food was mediocre - my boyfriend and i got the edamame hummus (pita was great, hummus was bland), <mark>Spicy Tuna</mark> roll (eh) an avacado roll, and pork belly <mark>Fried Rice</mark> (incredibly bland). definitely over priced.\n\nwon't be returning, except perhaps for drinks to enjoy the view.", 
            "this place is located on the 3rd level of the cesar's palace shops.  it was a bit of a walk, but well worth it.  we were craving sushi, so we were looking at all the reviews on yelp and decided to give this place a try.  came at about noon on a tuesday, so it wasn't busy at all. we ordered the following:\n\n- salmon sashimi - the color is a bright orange and the taste was so fresh.  definitely a very good grade of sashimi.  it's buttery and melts in your mouth. \n\n- cucumber roll - this was very good as well.  most of the time cucumber rolls are just ok everywhere, but this was delicious. \n\n- <mark>Spicy Tuna</mark> roll - i love <mark>Spicy Tuna</mark> rolls and this one was very good.  just enough tuna and spiciness to make it a great roll.\n\n- pork belly <mark>Fried Rice</mark> - my husband loved this and so did i.  the <mark>Fried Rice</mark> is already packed with flavors, but when you mix the pieces of pork belly with it, it adds an explosion in your mouth.  so delicious!\n\n- uni pasta - this one was very disappointing. i've had uni pasta before, but this one just tasted like an alfredo sauce with pieces of uni. \n\noverall the sushi was great.  it's a bit pricey, so be prepared, but you get what you pay for.  good sushi doesn't come cheap.  staff was friendly and service was fast with the exception of my uni pasta.  that one took a little bit longer then everything else, but the server did prepare me for that.  i would definitely come back here for the fresh sushi and the <mark>Fried Rice</mark> next time i'm in town.", 
            "i went here for their happy hour, which really cannot be beat for good sushi on the strip. house chardonnay was $5 and was very smooth & drinkable. $4 hand rolls: the <mark>Spicy Tuna</mark> was just okay, but the ab4 fusion was the bomb.com. i'd also order the popcorn shrimp with miso glaze again ($6). you have to sit at the cocktail bar to get the hh specials which was no problem, besides the 10 bar stools there is a separate long table with maybe 15 seats that also counts as the hh area. staff was great and the place was pretty empty, so service was super fast.", 
            "disclaimer:  i've been here 3 times but am a complete sushi noob.  i have a shellfish allergy and tend to avoid seafood altogether, potentially eating fish once every 3 to 5 years prior to coming here (have been here multiple times now)\n\nthe good: the tuna jalape\\u00f1o - yummy!  this is like heaven in my mouth. i get it every time ($23).  it is a <mark>Spicy Tuna</mark> roll with avocado in it that is topped with tuna sashimi, a slice of jalape\\u00f1o, and yuzu olive oil.  i probably lucked out choosing this as my initial dish.  also my buddy had a vegetarian roll that was pretty good...albeit, i was eating it because he didn't like it.\n\nthe mediocre:  eel avocado - this roll could best be described as straight out of the taco bell playbook.  i.e. take ingredients that taste bad or mediocre and douse them in a sauce (in this case soy sauce) completely masking/overpowering the bad/mediocre taste.  seriously this should be on the taco bell dollar menu next to the beefy cheesy burrito, not at a high end sushi place.  taco bell could come out with a soy sauce loaded griller and it was taste no different than this.\n\nthe bad:  the service.  this is seriously the worst service in vegas.  often times the place doesn't seem busy yet the waiter is never around.  i have never ever received a water refill prior to being done with my meal (my glass has always been empty as i dive in trying to suck water out of my last remaining ice cubes).  also ask for your check early because otherwise you are screwed waiting for it.  at most i expect to see my waiter twice before leaving, once to order and once to get my check.\n\nalso, the menu can be confusing, and the staff does a poor job of explaining it.  they mostly just let you fend for yourself guessing what is good and they make no sales pitch or recommendations on any items.  the people that bring the food are not waiters but more like glorified bus boys/girls with bad attitudes and limited product knowledge.  i was confused that there were happy hour food prices at the bar different than if you sit at a table.  there was only one table with people at it.  why can i not sit at a table and get the same product offerings as those who sit at the bar?!?  why would someone not explain the two menus so i can optimally choose whether i want the meals offered at the bar or the meals offered at the dinner tables?  also, the waiter didn't tell me there were daily specials which can be found inside the menu rather than in a separate flyer as is typical at most restaurants. \n\nthe service is so bad here it is most certainly costing them money.  coming to a sushi place as a novice, i was hoping to order a wide variety of items.  perhaps my expectations were unrealistic expecting this to act more like a tapas bar where you order an item, receive it, and continue ordering more items throughout the meal.  this is certainly not possible here unless you have a few hours to burn.  i planned to order yellow tail, and salmon, and other tuna dishes, maybe a skewer but each time i came i only ever ordered one or two items.\n\npro-tip:  walk to cheesecake factory on the other side of the forum shops for dessert.  yes, it's a long walk but well worth it.  guess what?  sushi roku actually has desserts but you wouldn't know it looking at the menu because they aren't on there.  this is problematic because the waitstaff is terrible at explaining anything and by the time they come by you just want to get out because you've been waiting forever.  cheesecake factory has outstanding desserts and they are cheaper.  i always go there everytime i leave sushi roku whose bad service has left me quite hungry needing more to fill my belly.\n\ncliffs:  i'll be back despite the terrible service due to the yummy tuna jalape\\u00f1o roll and location.  however i will explore other options and if i find a sushi place with decent service i am less likely to return here.", 
            "quality sushi that uses top of the line nori for their rolls and it makes a big difference.\n\nthe <mark>Spicy Tuna</mark> roll has a nice kick to it and the katana roll is tasty as well.", 
            "sushi roku was a very fun atmosphere with pretty great food and a fun way to spend a friday night in vegas. we had a group of six eating here and everyone was excited about what they got. everyone at the table had assorted rolls that they were incredibly happy with (especially the dynamite crab roll). the <mark>Spicy Tuna</mark> was very spicy, which i love. we also shared the katana roll and the shrimp tempura roll, all very yummy. they did find out we were celebrating a birthday at the table and brought us complementary desserts to share. really fun atmosphere -- only downgrade would be that the service was a bit slow.", 
            "loved every thing on the menu. the miss soup is the best i have ever had. i had their specialty roll with <mark>Spicy Tuna</mark> and jalape\\u00f1o (it's not on the menu but you can ask for it) the pork belly <mark>Fried Rice</mark> is unbelievable and i'm not usually a fan of <mark>Fried Rice</mark>. i would definitely recommend this resturaunt and come back.", 
            "i made reservations for 7 at sushi roku for a bachelorette party dinner and everything went perfectly. we were seated right away upon arrival and received great service throughout. our server was so attentive and knowledgeable and really made us all feel like he cared about our table. everyone ordered alcoholic beverages, which were strong and tasty, and miso soup to start. we then ordered individual meals and the server happily split up our tab accordingly.\n\ni ordered the katana roll: <mark>Spicy Tuna</mark> and shrimp tempura topped with tuna and yellowtail for $23 and it was delicious. it was spicy, but the roll was large (8 pieces) and plenty to fill me up. the signature rolls all came with 6-8 pieces depending on their contents and the other rolls came with 4-6 depending on their content. \n\ni would highly recommend sushi roku for a romantic dinner, night out with friends, etc. it has everything you need. the ambiance was slightly dark, but worked perfectly with the las vegas strip right outside the window lighting everything up. best meal we had during our stay.", 
            "sort of hard to find, on third level in the caesar's shops, just find an information booth and ask for directions.\n\ncan park for free at caesar's self parking, parking garage is close to the shops.  come out of elevators, take first right, take left one you get to fizz, take another left after  you enter the shops, good all the way down until  you hit a fountain, walk around it and go to the right, walk straight until you get to the escalators, go up, you'll see it in the back to the right after that.  \n\nonly did rolls, tried: \n- crab dynamite (favorite)\n- california\n- popcorn shrimp tempura w/ jalapeno (really good!)\n- shrimp tempura w/ asparagus\n- <mark>Spicy Tuna</mark> (tuna melts in your mouth, one of best i've had)\n\ndoes take reservations, used opentable\n\nnice ambiance, service kind of slow but nice people\n\n3 people, 3 drinks, 5 rolls, $100 bill.", 
            "the sushi had a fishy smell, so we didn't feel comfortable eating it. the <mark>Spicy Tuna</mark> roll appears to have canned tuna instead of fresh. over priced and underwhelming. do not recommend!", 
            "this place is located at cesar's forum shops.  it is a really cute small space with modern decor.  i went there for happy hour with a friend and they have a decent menu.  we were greated right away and sat at the bar because we wanted happy hour.  there were hot and cold appetizers, sushi, sashimi and desserts to chose from.  wine and cocktails were 5 dollars i believe.  we ordered the spicy scallop role, the <mark>Spicy Tuna</mark> roll, the calamari and the albacore sashimi. everything was really good.  my favorite was the albacore.  it came with crunchy onion bits and they gave you really decent size pieces for 5 dollars.  the fish was tender, fresh and delicious.  the calimari was good too.  squid was really small so it was a little over-fried.  i wanted more of a chewy texture.  came with a sweet plum sauce to dip.    \n\nthe rolls were really good too.  i really liked the <mark>Spicy Tuna</mark>.  the bartender told us to order it with rice paper because she likes it so much better and we did.  it was alright..and we got charged a dollar extra for it.  but the fish was good and their sauce was more than just sriracha.  i also liked the spicy scallop roll but it was not as fresh as i hoped it to be.  a little too much mayo in it too.  \n\ndrinks were good as well.  we ordered wines and they have good house selections for the price.  i would definitely come back for happy hour and for their regular menu.  place is not crowded at all so it will be quite easy to get a table if you don't go at a prime hour.  can't wait to visit again!", 
            "totally coming back here!!  \n\nmy absolute favorite thing to order here is the <mark>Spicy Tuna</mark> crispy rice! it was soo good i ordered two! mmm dreaming about it as i type.\n\ni ordered the <mark>Special Executive Bento Box</mark> too from the lunch special. black cod and short rib? helllll yess!! i loved everything in the <mark>Special Executive Bento Box</mark>! everyyything :))) i would totally order this again! the miso soup was delicious too!\n\nthe people working here were reallyyy nice and the view was incredible! i am definitely coming back here and i am excited about it! yay!", 
            "sushi roku is kind of hidden since its on the third floor of the forum shops. few people have told me that this place was pretty good, so i knew it existed. however, we never actually dined here until recently. came here on a saturday night, but the restaurant was empty. there were a few people sitting at the sushi bar and maybe 3 other tables that were occupied. \n\nwe started off with three of their signature rolls - the crunchy <mark>Spicy Tuna</mark>, crab dynamite and the baked lobster. my husband and i liked the baked lobster one the best. they put a creamy miso sauce on top of the roll which was good, but if it had a stronger miso flavor, it would have been perfect! there was nothing special about the other two that we ordered. they were basically your standard <mark>Spicy Tuna</mark> and california rolls that can be found at any sushi restaurant. we also ordered the popcorn shrimp tempura. kind of hard to screw up shrimp tempura, but it was tasty with the sauce. my only complaint is that maybe they should consider having the spicy creamy sauce on the side because after a while, the shrimp seemed sort of soggy.  \n\nservice was excellent. our server was friendly and checked on us often. our drinks were always being refilled and empty plates were taken away quickly. \n\ni'm glad i tried sushi roku, but there was nothing special about this place that makes me want to come back. i think they need more selections for their signature rolls. i'm a snob when it comes to sushi, so i already have my favorite sushi spot! but for a $100 bill for 2 people, there are definitely better places to eat sushi."
        ], 
        "dish_name": "Spicy Tuna"
    }, 
    {
        "text": [], 
        "dish_name": "Chicken Katsu"
    }, 
    {
        "text": [], 
        "dish_name": "Chirashi"
    }, 
    {
        "text": [], 
        "dish_name": "Oyako"
    }, 
    {
        "text": [
            "j was dizzy from low blood sugar when we walked in. i was still stuffed from breakfast but i figured i'd have a nosh. she ordered a cornucopia of sushi (salmon, toro, one handroll with tempura shrimp and asparagus) that she devoured and was highly pleased with. i had the 'new' <mark>Chicken Salad</mark> and some <mark>Mixed Tempura</mark> (veg and seafood). both were good but i really liked the <mark>Chicken Salad</mark>. the dressing is that sweet miso-y dressing you can some times get at some japanese restaurants. \n   the service was really wonderful. our waiter was highly attentive to our needs and my water glass wasn't allowed to be less than half full. we appreciated it.\n   the price was pretty high for a couple of women on limited budgets. my salad was $16 and the tempura was $12. i have no idea how much j's platter o'sushi was but it wasn't for the faint of heart. but you are paying for quality, not quantity.", 
            "came to sushi roku with a bunch of friends and was able to secure the private room for a private dinning event. located on the 3rd floor of the forum mall, sushi roku is probably one of the best japanese restaurants that i've been too offering a beautiful view of the strip. \n\nwe got here and the room was all set for the 20 of us that would be dinning that night. as i mentioned before the private dinning has a great view of the strip. the atmosphere here is definitely hip with low lighting. you have the high end modern japanese with lots of dark wood used throughout with hints of red and stone accent pieces. we had a prefix meal sampling meal served family style so all we had to do was sit down, drink several rounds of saki bombs, and let the food come to us. \n\nfirst up was the edamae. fresh with a touch of sea salt was just the right way to start off a night of eating and doing saki bombs. next up was a chinese <mark>Chicken Salad</mark>. good, nice fresh mixed green lettuce with a dressing with a nice blend of balsamic and sesame to it. the shredded chicken was also very good. chicken skewers were next up on the menu, again, very good. chicken was done perfectly and the sauce that i had was a sweet sauce with a little bit of heat at the end. after the chicken out came the rolls, there was a traditional california roll, (good but not mind blowing), the <mark>Spicy Tuna</mark> (though small, everything here tasted really fresh and with perfectly cooked sushi rice and a nice amount of heat, really really good) and probably the one item that everyone raved about was the fresh soft shell crab roll. while simple, it was just very fresh and outstanding. this alone i would come back for again. we got two desserts for the nice a chocolate lava cake with a vanilla cream sauce (second best i've had with the best being at roy's in maui) and ice cream mochi which was pretty good. \n\nthe service here was excellent. very professional and friendly especially considering how rowdy this group can get. overall all the food and saki cost around $80 a head which seemed reasonable for the amount of food and drinks we got that night. no one in our group of 20 left hungry and there was plenty of food left over. i have to say, this is one of the best japanese restaurants that i've been to and will give sushi roki a rare 5 star rating!"
        ], 
        "dish_name": "Chicken Salad"
    }, 
    {
        "text": [
            "the sister and i took our parents to vegas for their first time, and to also attend paris by night, a vietnamese music production. they're not too crazy on trying strange things, and by strange--i mean anything that strays away from vietnamese cuisine. they have traditional tastebuds, but still willing to try flavors closely related to their usual liking. this led me to choosing japanese, because they've never tried much of it. plus, i wanted to take them to a cool spot, which most trendy japanese restaurants can accommodate to, to end their awesome day of music, and to make full use of their play-dressed-up night--dad in a suit, and mom in a purdeee dress. \n\nservice- 5!\n- i called ahead to set reservation, and requested seating near the window to enjoy the view of the strip since it was my parents first time in vegas--they were so nice and accommodating. i had to call back and change timing since the concert took much longer than anticipated; they were more than glad to meet our request.\n\nas for the actual dining experience, our server was sweet and helpful. took her advice on several dishes and it was on point. she even went along with me when i wanted to get my folks to take 2 plum sake shots [they're the one light drink only people]. she told my dad it was a 'pink juice shot', when he asked her what it was. lol. too bad i forgot her name, but i remember her a very small frame japanese lady. on top of that, the manager [a korean fella] came to our table to greet and also at the end, to see how our dinner went. very nice touch.\n\nambience- 4\n- the decor wasn't what i'd go 'wow!' about, but it was definitely still an artistic and trendy architectural attempt. great view of the strip, mellow, and warm. the way the restaurant was design, you actually don't need a window seat to have a glimpse of the streets down below.\n\nfood- 4\n- our food was great, but the overall effect didn't leave me thinking, \"an amazing dinner!\"\n\napps: 1) yellowtail sashimi w diced chilies 2) mixed <mark>Sashimi Salad</mark> w ginger vinaigrette 3) agedashi tofu [it's off the menu, but can be requested] 4) popcorn rock shrimp tempura in spicy miso glaze 5) miso cod \n- the yellowtail could have been fresher, but the sauce & toppings were delicious/ salad & sashimi was a great blend w the dressing/ soy sauce in the agedashi tofu was so little, but the tofu itself was soft and perfectly battered/popcorn rock shrimp rocked! so delicioussss. much better than nobu's/ miso cod was tender, juicy & fresh, but could use a bit more glaze \n\nentree: 1) ribeye w/ soy garlic sauce 2) chilean sea bass ( in yuzu butter, they have 2 different sea bass dishes, and both sauce are different]\n- ribeye was yummy, had it medium but the little cooked part was quite dry. my folks and sister loved it and the baby green beans & potatoes that came along w it/ the seabass was perfectly flavored, but texture was a bit dry, perhaps an older piece of fish?\n\ndessert: mochi & a 10oz carafe of plum sake \n- no restaurant can possibly go wrong w mochi....and roku didn't. we were too fulll at the end to eat much dessert, so i figure this was an appropriate portion.\n\noverall, we all had a lovely evening. my parents had so much fun and enjoyed the restaurant's experience--along w the kirin light and cocktail i ordered for them [hehe]. i would definitely return, but not before i've tried other sushi joints in vegas [can't help it, there is just too much to eat a one place twice in vegas. unless you live there or go there 50 times a year!]", 
            "the sushi roku empire was built out in los angeles, but the trendy vibe was transported across state lines to be featured in their las vegas location.  the third floor digs inside the forum shops at caesar's palace provide expansive views of the strip.  being only a few flights above ground, you are able to enjoy the towering lights of the hotels, as well as the entertaining antics happening on the busy street.  the dim lighting and asian-inspired decor make sushi roku a seductive spot.  however, the high ceilings and open dining room can get quite loud when full of larger parties.  (our meal was continuously disrupted by a rowdy birthday celebration.)\n\nsince we were grabbing a late dinner, we decided to opt for some light courses.  i ordered the mixed <mark>Sashimi Salad</mark>, which was a mound of fresh field greens topped with radish slices and served over thinly cut raw fish.  the platter included tuna, salmon, yellowtail, and more.  a snappy ginger vinaigrette was drizzled over the dish, providing a gentle spicing.  each piece of fish was light, fresh, and tender.  i also sampled their eel avocado roll, which contained eel slices so warm that the maki easily fell apart, one of my pet peeves.  my friend ordered the special katana roll.  the massive portion contained about 10-12 slices of a mixed <mark>Spicy Tuna</mark> and shrimp tempura maki, topped with tuna and yellowtail slices.  it was a fantastic concoction that she reminisced about for days.\n\nmany hip japanese spots that provide fun atmospheres and innovative cooking styles, such as nobu, often do not provide the same food quality as more traditional spots.  however, sushi roku scores 4 stars on all of points - style, creativity, and taste."
        ], 
        "dish_name": "Sashimi Salad"
    }, 
    {
        "text": [
            "when you are going to be the only male meeting nine pretty girls from new york city,  you know that your 7 o;clock reservation needs you to call at 7 and ask for it to be pushed back to 730 as you leave your hotel at the other side of the strip.  so imagine when to my surprise i still managed to be the first one there with ample time to sit at the small bar and enjoy the company of the friendly bartender and review their nice selection of wine.  only out of california for 24 hours, i still missed it enough to settle on a crisp russian river sauvignon blanc.  \n\nby its name, you know that sushi roku is japanese fare with a lot of sushi options.  if you know me, you know japanese food falls behind korean bbq and anything with \"steakhouse\" in the title as my least favorite dine out experience.  nonetheless, i persevered for my sister's birthday weekend wishes, as i did much that weekend.  i was nonplussed to see that they had a <mark>Seaweed Salad</mark> that i managed to combine with a few other small items for one full meal.  i did not enjoy how both my miso and salad which ended up being my largest course were both served before anyone else received an appetizer.  perhaps the gentleman servers were overwhelmed by the prettiness of the nine ladies while i was appreciating the artistic bathroom doors.", 
            "great ambiance.  they sat us at a two top over by the big window that overlooks the strip.... that combined with the mood lighting(dark) and music, you could really feel the energy of vegas.  the sushi was pretty good too.  lots of fancy rolls along with the basics.  got the <mark>Seaweed Salad</mark> as an app.  good portion for 2 people.  it was different because they mixed in some baby green with the seaweed which added a different dimension to the dish.  the best thing we had was the fresh sweet shrimp(amaebi).  a little pricey but worth it.  it was served along with the deep fried heads.  don't want to disgust anyone but if you been to new orleans, \"pinch the tails, suck the heads\"  seafood perfection!", 
            "sushi roku is tucked way out of sight at the forum shops at caesar's. it is romantic and dark. our server was very professional. we ordered a bunch of apps to start. \n\nthe tuna carpaccio was fresh but lacked in flavor so i had to add soy sauce. the kobe beef skewers were tender and juicy but i am not sure if they really were from kobe. the chicken skewers were ok - afterall it is chicken. i recommend the <mark>Seaweed Salad</mark> and miso eggplant dengaku.\n\nwe were ready to order dinner and then a friend of mine got sick and left and her bf went after her. so my gf and i finished the apps and were full. we explained to the waiter that we had a problem with out friend and he understood but i felt bad for him since the place was almost empty.\n\none thing i noticed in a lot of vegas restaurants is that they are so dark inside. it's draining. liven up and be more fun, it'll increase business.", 
            "service was awesome. my husband and i ate there on 10/17/2010 for dinner and it wasn't too busy.\n\nwe were seated right away, and our server was extremely attentive. she even suggested some sushi that wasn't on the menu and she had good suggestions.\n\nthe sushi was decent but extremely pricey. you're on the vegas strip. you have to expect it.\n\n<mark>Seaweed Salad</mark> = yum\ncrab dynamite = yum\nshima roll = yum\nred sun roll = yum\npremium sashimi special = alright\n\nif you get the crab dynamite, order it first. it takes some time to prepare.", 
            "this place is located in the forum shops at caesar's palace.  the closest entry point from outside the hotel is via the valet parking (actually free, but tip req'd) at the forum shops.  we got there earlier than our reservation (a sunday) and they were able to accomodate us.  we got a table w/ a great view of the strip looking southbound.  very sleek, modern interior, dark, loud modern music.  we ordered: eggplant app (yummy), pork korubata (good but fatty and not for sharing), <mark>Seaweed Salad</mark>, kobe beef and scallop app (beef was too chewy), california roll, unagi avocado roll, and the chicken entree (a bit dry).  the rolls were alright, nothing elaborate for their pricepoint, perhaps the nigiri/sashimi would have been better?  they had a nice assortment of small plates that we should have stuck with.", 
            "cute place. the interior is very upscale, and intimate. it's a nice place to have a nice romantic dinner with the love. i would suggest to request the strip view when dinning in because the strip view is just lovely. \n\nthe menu is ok. i personally prefer authentic japanese cuisine at a local area (spring mountain!), but there are a few things here that i like. their signature martinis are good! i would definitely recommend the lychee martini. you get a big piece of lychee as a garnish, and you can taste the lychee flavor of the martini. so if you are all for a nice sweet taste to your martini i'd definitely recommend it.\n\nour group ordered the seared tuna tataki, <mark>Seaweed Salad</mark>, yellowtail sashimi, crunchy <mark>Spicy Tuna</mark>, rock shrimp tempura, and chicken yakitori skewers. to me, it was nothing special or anything that stands out to where i feel like this place might be the only place to satisfy a distinct craving. the food is very light, fish is fresh, and the portions are small. \n\ni haven't tried the omakase yet, but i would like to actually try it once to see if it is worth spending $90 for. the omakase might be the only thing worth gambling on. all in all the experience was nice and the service was wonderful. if you don't mind burning a big hole in your pocket for a nice fine dining experience, and a small stomach and appetite then i would recommend it.", 
            "for a place that i have expected to be trendy with amazing food, this place falls flat.  \n\nthe cocktails were mediocre, and food was mediocre.  the only thing that was sort of ok was the atmosphere.  \n\nwe were first there for drinks, but later decided to have dinner.  the bartender that day didn't seem too happy and had a straight face the whole time.  he didn't try to make any kind of conversation and just made drinks and took our order.  ok, i don't mind it too much because as long as he made great drinks and didn't mess up our orders i didn't mind.  the drinks as i said, were mediocre.  \n\nwe had a couple rolls and it was still mediocre, which was very disappointing.  i had hanabi with <mark>Spicy Tuna</mark> which i thought the flavors just didn't mesh well at all.  the tuna itself was amazing, but with the fried cube of sushi rice dipped in sweet soy sauce... it just doesn't fit.  the <mark>Seaweed Salad</mark> was a little bit on the salty side, and that it was nothing more special than the ones i can get from a japanese market.  \ni also had shima roll, which was shrimp wrapped with <mark>Spicy Tuna</mark>, avocado, and cilantro.  it was not bad, but not good either. just bland i guess.  not impressed. \n\noverall i thought with the price i paid i could have better sushi elsewhere.  if i wanted mediocre sushi i didn't have to come all the way to vegas.", 
            "i'm pretty happy with what he had here. we considered going to shibuya, since i knew it to be good, but since we're in the venetian and it's in mgm grand, that's a serious hike. so we headed down to ceasar's for this spot, and were well rewarded.\n\nservice is very friendly - we walked right in and sat at the bar. we ended up ordering a decent selection of nigiri, as well as a <mark>Spicy Tuna</mark>, spicy shrimp, and white lotus roll. i also had my standard <mark>Seaweed Salad</mark>, which was excellent, although tasted a little like there was a fruit dressing, which i could have done without. maneki in seattle still has my all time favorite sunomono.\n\nrolls were very good, especially the white lotus roll, which, if i'm remembering right, was crispy shrimp, avocado, and asparagus inside, with yellow tail on the outside, fresh hot peppers, and some various sauces. awesome. i'm really starting to like the fresh peppers in sushi, which i'm seeing in more and more spots. also worth mentioning, the hamachi i had here is maybe the best i've had. super tender, super flavorful, just awesome.\n\nprice was excellent too - they left an item off our bill by accident and when we reminded them, they just waved it off. even with that on the bill, for two people including a couple drinks, the total came to under $100. no, not cheap, but it's sushi...in las vegas...and we ate ourselves full. definitely a would return.", 
            "i had some sushi. i had some sake. i had something with black truffle. oh yeah, i had some <mark>Seaweed Salad</mark> too. let me tell you, everything was delicious. that's all.", 
            "really great <mark>Seaweed Salad</mark>. not too salty like i've had in the past. mama liked her sashimi with eel sauce.they had kirin on tap. very sophisticated looking spot. we only did bar service. bartender was helpful even when we had to return an item. didn't see too much spit on it. \n\nnice location in the \"mall\".", 
            "2012 fall restaurant week lunch #1. i'm going to try pump these reviews out fast. just in case people had a hard time choosing where to go... like me!\n\nmy friend and i wanted to find a sushi place who offered a lunch course for restaurant week. we both never dined at sushi roku previously. it's located on the strip side, 3rd floor of the forum shops. for restaurant week, they're offering a 3-course lunch for $30.12. we ordered each option. i've posted pictures of all our food.\n\nfor lunch:\n\n1st course:\nchoice of: <mark>Spicy Tuna</mark> hanabi (crispy rice cake) or \n<mark>Seaweed Salad</mark> (cucumber sunomono, plum vinaigrette)\n\n2nd course:\n\nchoice of: sushi (tuna, yellowtail, salmon, albacore, whitefish, <mark>Spicy Tuna</mark> roll, miso soup) or grilled petite filet (homemade teriyaki sauce, steamed rice or mashed potatoes, miso soup)\n\n3rd course:\nchoice of: mini chocolate cake or fresh fruit & sorbet \n\nthe appetizers were nothing spectacular, not even spicy. the sushi fish and miso soup did taste fresh. they didn't ask us how we wanted our filet cooked, it came to us medium-well. my friend didn't mind it, but i'm more of a medium-rare steak lover. not only was i confused that a sushi place was serving mashed potatoes, they were pretty dry and ordinary. <mark>Spicy Tuna</mark> roll was pretty standard. \n\nthe chocolate cake was good, a bit too rich and dense for me. \n\nthe tastiest thing was the mango sorbet. i'm not a big sorbet person, but this one was truly delicious. it wasn't mango-flavored. you could actually feel the strands of real mango in the sorbet. best i've ever had. \n\nthe presentation was great. the service was on point, from the hostess, bussers, our server, and the sushi chefs who greeted us hello and farewell.\n\ni had a good time, it was one of those lunches where nothing went wrong, yet your tummy wasn't doing the happy dance when you left. the service and presentation, (and of course the sorbet!) made this 3-stars for me. i wonder if i would've had a better experience if i had come to order off the regular menu. other than it being an opportunity to donate to charity, if restaurant week is a chance for establishments to show what they can offer, sushi roku didn't impress me that much...", 
            "i ordered unfiltered sake, <mark>Seaweed Salad</mark>, toro, albacore tuna, japanese snapper, yellowtail, salmon. huge pieces of sashimi. i should've ordered the specialty rolls but i stuck with simple stuff. i wasn't that impressed but the service  was phenomenal. the waiters soooo attentive. they even packed my leftover sushi on top of ice and gave a to go cup for my left over sake. they were knowledgeable and let me taste two different sakes. i sat at the sushi bar and the chefs were friendly. the main dining area looks over the strip. it's also on the top floor of where the stores are.", 
            "i'm sure there are other great sushi spots in vegas, but, if it ain't broke...\n\nthe most recent trip to sushi roku is 4-star worthy, just like all the others. wonderful sake and lots of different sushi selections. i still stand behind the <mark>Spicy Tuna</mark> hanabi and filet-wrapped asparagus. i'll also add the <mark>Seaweed Salad</mark> to the list of winners at sushi roku.\n\nservice was super friendly as always, and the nigiri and sashimi was very tasty and fresh.", 
            "by the time that i got off the plane in las vegas, i was already starving. after dropping our luggage off in our rooms, we promptly took to yelp to find some sushi for my poor landlocked friend. we ended up at sushi roku and had a pleasant lunch. we each ordered iced teas. the iced tea had some sort of fruit flavor that we couldn't place. it wasn't sweet, but you could taste something tropical. \ni opted for the lunch special which included salmon teriyaki, salad, rice and sashimi. i also added a miso soup. my friend ordered a specialty roll and a <mark>Seaweed Salad</mark>. my expectations were actually kind of low (this place is inside a mall) and they were easily surpassed by this lunch. the miso soup was flavorful and served at an appropriate temperature. my friends salad was really delicious. it was made with the very dark green seaweed and not the weird neon kind. my salad was pretty generic and with the exception of fishing out and munching on the the bitter micro-greens, i basically left it untouched. my sashimi was ok. nothing really special. it could've been a bit colder. my salmon teriyaki was very flavorful, but a tiny bit overcooked. the rice on the plate was plain steamed rice. it was exactly as expected. my friends roll looked pretty good, but towards the end, she just took it apart and ate the fish because the ratio of rice to other ingredients was too high.   \nnot a terrible lunch, but also not the best i've ever eaten. it was definitely ok.", 
            "our group had a fabulous meal here. it was pretty easy to get reservations, even for our group of 14 people. we ended up splitting the table \"in half\" and have each side order their own food to share (family style). i think our side won:\n\nfor appetizers, we ordered:\n\ntuna sashimi carpaccio: 4 out of 5 stars\nyellowtail diced chilies with olive oil & garlic ponzu: 4 out of 5 stars\norganic garden salad with yuzu ginger dressing: 5 out of 5 stars (as far as garden salads go)\n<mark>Seaweed Salad</mark> with cucumber sunomono: 3 out of 5 stars\nshishito japanese peppers in soy garlic: 5 out of 5 stars (so much flavor!)\nbrussel sprouts with bacon and yuzu kosho: 5 out of 5 stars (it's bacon!)\n\nfor entrees and special rolls, we ordered:\n\nuni udon creamy pasta: this was actually more like fettuccini, not udon noodles. it was definitely very creamy and heavy. i liked it, but i wouldn't say it was my favorite dish of the night. 3 out of 5 stars. well, let's make it 4 out of 5 stars, since the uni pieces were huge.\nfilet mignon wrapped asparagus: it comes on a hot rock. 4 out of 5 stars.\ncrunchy <mark>Spicy Tuna</mark> roll (this is typically deep fried, but there is an option to just get the deep fried crunchy flakes on top of the roll). 4 out of 5 stars.\nkatana roll: <mark>Spicy Tuna</mark> & shrimp tempura topped with tuna and yellowtail. 5 out of 5 stars.\nmakoto roll: yellowtail & shrimp tempura wrapped with seared tuna, spicy creamy sauce. 5 out of 5 stars. these rolls were pretty similar actually...oops.\n\nthe other side ordered the prime rib eye steak to share, and we each tried a piece. if i go with a large group again, we are ordering that fosheezy.", 
            "the food was horrible.  do not go here.  the only thing that was decent was the <mark>Beef Teriyaki</mark> and <mark>Seaweed Salad</mark>.", 
            "lunch - <mark>Seaweed Salad</mark>, pork belly <mark>Fried Rice</mark>, sushi sampler lunch with miso soup, all fresh and delicious. beautiful dining room with a view of the strip; excellent and attentive service.", 
            "sushi was good. the <mark>Seaweed Salad</mark> was really good. this was the most expensive sushi place i have dined at. good view of the strip if you sit near the window.", 
            "this is probably the best sushi i've eaten in quite some time. the fish was very fresh and reasonably priced. i had the chef's sushi lunch special, the <mark>Seaweed Salad</mark> and the pinot grigio. the decor was really nice too. \n\nthe service was a little slow, but overall it was a great meal."
        ], 
        "dish_name": "Seaweed Salad"
    }, 
    {
        "text": [
            "my friends thought it was amazing, but i'm asian so my standards are a little higher. taste wise, i've definately had better at numerous other places. but the ambiance is what you pay for. deep, dark and moody just how i like it. umm....the sea bass was very good, but if i wanted high quality, fresh sashimi, i'd probably go somewhere else cuz last time i checked, <mark>Fried Rice</mark> was chinese. service was great though.", 
            "excellent service and ambiance but overpriced. then again, it's vegas and everything is overpriced. \n\neveryone in the group enjoyed their food. my <mark>Fried Rice</mark> and miso eggplant were delicious. we shared the creme brulee and mochi samplers for dessert, which were both decadent. \n\ni don't know what was in the food, but less than 15 minutes after the meal we were all hightailing it to the bathrooms. :p", 
            "i loved this place.  probably the best place i ate at all weekend. lets see what we ate:\n-crunchy <mark>Spicy Tuna</mark>: had avocado, <mark>Spicy Tuna</mark>, spicy mayo sauce and a crunchy topping it was amazing! i loved it\n-baked lobster roll: baked lobster, rice paper roll, asparagus, miso sauce.  it was all wrapped up and then baked and the miso sauce is nice and toasted and warm it was soo delicious\n-spicy scallop roll: i had the cut roll not the hand roll. honestly it was just okkay. nothing super spectacular\n-shrimp <mark>Fried Rice</mark>: pretty yummy just your basic <mark>Fried Rice</mark> we all shared it and it was good\n-miso soup: perfect not too salty but just right\ni mean lets be honestly everything in vegas is expensive so i don't think the prices were outraged compared to everywhere else. i think for the price it is way better then anywhere else that we went.  if u are a sushi lover like i am then i think you will enjoy this place and bonus its air conditioned inside the mall so its nice!", 
            "sushi roku will always have a special place in the heart of my wallet. i was in vegas for a bachelor party. initially my group of 16 was going to eat at texas de brazil, but after a couple days of buffets and steaks the guys in my group couldn't handle it anymore. we made last minute reservations at sushi roku for a party of 16 on a saturday.\n\ni arrived a bit later but when i did some of the guys were getting hooked up big time at the bar with shots and drinks which was real cool. we were seated after taking some shots and just started ordering an assortment of sushi rolls and king crab <mark>Fried Rice</mark>. the king crab <mark>Fried Rice</mark> was simple yet so pleasing. it really hit the spot and filled us up quickly. sushi rolls were all pretty decent. of course we all partaked in sake bombs. \n\nthe service was off the charts. the waitresses were so accommodating and polite. upon getting our check they said we could take $400 dollars off. this was absolutely mind blowing. apparently one of the guys of our party was chopping it up with the general manager unknowingly and complimented the dude on his $1600 dollar armani suit. bam instant savings son. we all suspect he performed sexual favors to get us the discount. you do what you got to do when you are a team player i guess. i kid i kid.\n\nanyway the meal was decent, the service was ridiculously good, the restaurant decor was swanky and chill, and the bill for us, vegas standard wise, was an all time winner.\n\ngeneral manager johnny. compliment the guy on his suit *cough*. the dude is an all time legendary great.", 
            "went here during a visit to vegas. debated the oh-toro (fatty tuna) out loud and even our server commented that it was great and \"just melts in your mouth\". ended up ordering 2 orders (4 pieces) of it along with our entrees.\n\nthe tuna we had looked like they were less than ideal cuts. not only did they taste bad, they were likely the worst tuna i've ever had. a complaint to our server simply resulted in her shaking her head and saying \"not so good?\" with no offer of a remedy.\n\ntwo stars because the <mark>Fried Rice</mark> was pretty good.", 
            "i ordered the crispy <mark>Spicy Tuna</mark> ($16) with chicken <mark>Fried Rice</mark> ($15), both were filling and well prepared. service was great, ambiance was excellent. well priced considering you're in vegas.", 
            "the sushi was average. i found that the eel/avocado roll had muddy taste, like you sometimes get in catfish and talapia. not the most appealing. \n\nthe truffeled sea bass was the highlight of the meal, pefectly cooked and delicious. \n\nthe chicken <mark>Fried Rice</mark> and soba noodles were average as well. not my favorite sushi place, but a decent option if you are staying at caesar's.", 
            "one of the best sushi spots in vegas hands down!! and don't worry, if you don't like sushi, there are so many other options for you. \ni was very impressed with this place. my sister and i dined here for a girls night and they took such great care of us. we got a seat with a view, when it was packed. the manager comped our dessert, just cause. literally, i would give them 10 stars if i could.\nit seemed like the type of place to take care of their regulars, and locals. \na couple of the dishes that stood out to me were the jumbo shrimp, and king crab <mark>Fried Rice</mark>. \nthe shrimp was served with potato style chips, and a creamy sauce. i am still wondering what was in that sauce. it had a savory, yet sweet honey butter flavor. so delicious. \nthe crab <mark>Fried Rice</mark> just hit the spot. there were huge chunks of crab, and the dish was packed with flavor. no need to add soy or hot sauce to this one. \nthere were a dozen or so sushi options, and a variety of small sharable plates, or full size entrees. \npark valet at the forum shops to avoid the tourist traffic. from food, to service, and even price, i was highly impressed all around. i can't wait to return.", 
            "amazing service and food! the sushi tastes very soft and fresh. plus we had the king crab <mark>Fried Rice</mark> which was pretty fantastic! our server was very attentive and polite. the best service we received while in vegas for the weekend.", 
            "5 stars for ambiance, two stars for both food and service. \n\ngreat decor and view looking over the street. service was slow, poorly timed, and not very helpful. food was mediocre - my boyfriend and i got the edamame hummus (pita was great, hummus was bland), <mark>Spicy Tuna</mark> roll (eh) an avacado roll, and pork belly <mark>Fried Rice</mark> (incredibly bland). definitely over priced.\n\nwon't be returning, except perhaps for drinks to enjoy the view.", 
            "great service, view of the strip and food! must try the braised pork belly <mark>Fried Rice</mark> (forgot the name) but here's a picture!", 
            "this place is located on the 3rd level of the cesar's palace shops.  it was a bit of a walk, but well worth it.  we were craving sushi, so we were looking at all the reviews on yelp and decided to give this place a try.  came at about noon on a tuesday, so it wasn't busy at all. we ordered the following:\n\n- salmon sashimi - the color is a bright orange and the taste was so fresh.  definitely a very good grade of sashimi.  it's buttery and melts in your mouth. \n\n- cucumber roll - this was very good as well.  most of the time cucumber rolls are just ok everywhere, but this was delicious. \n\n- <mark>Spicy Tuna</mark> roll - i love <mark>Spicy Tuna</mark> rolls and this one was very good.  just enough tuna and spiciness to make it a great roll.\n\n- pork belly <mark>Fried Rice</mark> - my husband loved this and so did i.  the <mark>Fried Rice</mark> is already packed with flavors, but when you mix the pieces of pork belly with it, it adds an explosion in your mouth.  so delicious!\n\n- uni pasta - this one was very disappointing. i've had uni pasta before, but this one just tasted like an alfredo sauce with pieces of uni. \n\noverall the sushi was great.  it's a bit pricey, so be prepared, but you get what you pay for.  good sushi doesn't come cheap.  staff was friendly and service was fast with the exception of my uni pasta.  that one took a little bit longer then everything else, but the server did prepare me for that.  i would definitely come back here for the fresh sushi and the <mark>Fried Rice</mark> next time i'm in town.", 
            "lunch - <mark>Seaweed Salad</mark>, pork belly <mark>Fried Rice</mark>, sushi sampler lunch with miso soup, all fresh and delicious. beautiful dining room with a view of the strip; excellent and attentive service.", 
            "holy sh*t this place is awesome. first, the atmosphere - it's loud, lots of people, fun music. cool interior design and lots of big windows to look out over the strip. \n\nmore importantly - the food. wow. i don't want to say too much lest i oversell here, but it was soooo good! we started with the shishito peppers - very crunchy and good spice. we also ordered the brussels sprouts - so delicious with chunks of bacon and sweet sauce. then we had the katana sushi roll - the fish just melted in my mouth. we then had the toro roll, which was delicious and had a wonderful crunch from the jalape\\u00f1o (but not very spicy). my friend ordered the pork belly <mark>Fried Rice</mark> - such a delicious, flavorful bite with fantastic texture and yummy egg. she also had the braised ribs which had a wonderful, unexpected melange of flavors. our other friend ordered the chicken, which was delicious if not a little boring in comparison to all of the other amazing flavors on the table.", 
            "we got the shishito peppers, yellowtail dice chilies, hanabi, spicy pork belly <mark>Fried Rice</mark>, and uni udon. the hanabi was perfect. the spicy pork belly <mark>Fried Rice</mark> was ok but a little too sweet. uni udon was not what we expected and more like alfredo but tasty.", 
            "loved every thing on the menu. the miss soup is the best i have ever had. i had their specialty roll with <mark>Spicy Tuna</mark> and jalape\\u00f1o (it's not on the menu but you can ask for it) the pork belly <mark>Fried Rice</mark> is unbelievable and i'm not usually a fan of <mark>Fried Rice</mark>. i would definitely recommend this resturaunt and come back."
        ], 
        "dish_name": "Fried Rice"
    }, 
    {
        "text": [], 
        "dish_name": "Pan Fried Yakisoba Noodle"
    }, 
    {
        "text": [], 
        "dish_name": "Udon Noodle Soup"
    }, 
    {
        "text": [
            "i gave an extra star, or a second star for the decor. very nice place and view. otherwise, the food is so bad and skimpy that one star is too much.\ni don't mind small and tasty portions, but these were embarrassingly skimpy and notg so good. <mark>Udon <mark>Hakata Ramen Noodle Soup</mark></mark> came with tempura on a side, as we requested. tempura consisted <mark>Accompanied with your choice of one</mark> shrimp split in quarters and you only get two skimpy quarters of that one shrimp. nada mas. \nmy sushi box should have had four slices of sashimi, but what they did, they took one piece of tuna and split it in four pieces. so the four slices are paper thin and see through! it also came with beef, which was overcooked and not good. \ni was still hungry and went ahead and ordered a sushi roll. it was decent size but not great tasting. \nthey should be ashamed of serving such food for such price. but even if it was cheap, which it wasn't, they should be ashamed, you don't serve two quarters of a shrimp as your tempura.", 
            "had dinner here and they helped me charge my phone! i like the <mark>Udon <mark>Hakata Ramen Noodle Soup</mark></mark> and salad is good but small. overall a good place to go when you want sth asian."
        ], 
        "dish_name": "Hakata Ramen Noodle Soup"
    }, 
    {
        "text": [], 
        "dish_name": "Steamed Shrimp Dim Sum in a Dashi Broth"
    }
]