[
    {
        "text": [
            "let me just say wow. i ordered the tostada salad. what i got was a salad big enough for the table. i hd no idea how huge this thing was. huge! and i'm from west texas! and yes everything is bigger and better there. . but this place is awesome in its own right. \n\nthe salad had meat, cheeses, so many things i just thought it was so good. and when i took it to go there was still so much left i couldnt even fit it all int he to go box. yes. that big. \n\ni loved it and almost couldnt stop. the salsa wasnt hot but it was yummy. my bf ordered a skillet which was good but nowhere near as good as what i ordered. \ni wanted to order the <mark>Southwestern Cobb Salad</mark> so bad but i already had it in my head that the tostada was what i wanted so till next time!"
        ], 
        "dish_name": "Cobb"
    }, 
    {
        "text": [
            "let me just say wow. i ordered the tostada salad. what i got was a salad big enough for the table. i hd no idea how huge this thing was. huge! and i'm from west texas! and yes everything is bigger and better there. . but this place is awesome in its own right. \n\nthe salad had meat, cheeses, so many things i just thought it was so good. and when i took it to go there was still so much left i couldnt even fit it all int he to go box. yes. that big. \n\ni loved it and almost couldnt stop. the salsa wasnt hot but it was yummy. my bf ordered a skillet which was good but nowhere near as good as what i ordered. \ni wanted to order the <mark>Southwestern Cobb Salad</mark> so bad but i already had it in my head that the tostada was what i wanted so till next time!"
        ], 
        "dish_name": "Southwestern Cobb Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Summer Spinach Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Mandarin Spinach Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Caesar Salad"
    }, 
    {
        "text": [
            "i love egg works, simple as that. the food is always great and the customer service at all of their locations, especially sunset/eastern is top notch! i have tried a lot of the menu and my favorites are: reuben sandwich, the works benny, and the <mark>Bbq Chicken Salad</mark>! seasonally they offer carrot cake french toast which is to die for! our waiter perry was awesome, checked on us enough and was very friendly.", 
            "went here for lunch today.  they were not even remotely busy yet it took over half an hour, almost 40 minutes actually, for the four of us to get two salads, a <mark>Bbq Chicken Salad</mark> sandwich and my denver omlette was <mark>Deli</mark> last!!!  almost 10 minutes after my friends were <mark>Deli</mark> their food.\n\nnot a good experience at all.  i will not be going back and i certainly won't recommend it to anyone."
        ], 
        "dish_name": "Bbq Chicken Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Works Tostada"
    }, 
    {
        "text": [
            "breakfast food is good and i should've stuck to that, but i went to breakfast without much of an appetite so i opted for their <mark>Works House Salad</mark> and muffin. is it so hard to get a fresh salad here in henderson?\n\nmy lettuce was wilted, turning pink at the edges and had some brown spots. i asked them to take it back and the waitress kindly brought me more muffins on the house. \n\nwhy would an establishment ever serve salads that obviously are closer to rotting than being fresh. \n\nhenderson, i give up on ordering salads from any of your restaurants. and egg works, you're on my list of restaurants who rather plate any kind of food than plate quality ingredients and cross fingers that i'll just stuff my face without looking. \n\n5 stars for the muffins though. i'll come back for those and when i'm hungry for breakfast food. \n\nskip the salad. who eats that for breakfast anyways ;)"
        ], 
        "dish_name": "Works House Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Double Down"
    }, 
    {
        "text": [], 
        "dish_name": "Soup & Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Chili Bowl"
    }, 
    {
        "text": [
            "holy potatoes bat man!!!!\n\nmy breakfast burrito was outstanding and the massive order of cubed potatoes was killer!  word to the wise....taste b4 you salt. these babies are already salty and spicey ...just right! they offer an excellent brand of in-house hot sauce and a pretty solid salsa to accompany the burrito, etc. my guest had the corned beef hash and let me tell you, this was not your fathers canned hash. homemade and very meaty, some of the best i have ever tasted. fresh squeezed oj and coffee by the carafe are nice side touches.\n\nonly problem is that much food that early in <mark>Homemade Soup Of The Day</mark> is a perfect recipe for a food comma and i had troubles getting anything done at work!\n\nthe place is not cheap, but for this quality probably worth it. also: you can find a coupon in just about any vegas weekly publication like las vegas weekly that gives you buy one/get one, up to a max value of  $8.00 off. that makes it all that much easier to swallow ;-)\n\nfor all of you out there looking for the perfect vegas morning breakfast cure to aide in your all night indulgence pains...this is the joint!\n\ni will be back!", 
            "service was oddly slow today, but the food is always, i say again, always amazing. they have a really cool concept going here. each table features a little egg that yellow on one side with a sad face or black on the other with a happy face. a sad egg and everyone stops what they are doing and jumps at the opportunity to fix the situation. sometimes i flip the egg just see what will happen :) \n\ni prefer the omelets and sausage links. the coffee isn't the best so i say go with some juice or something else like that instead. i had the biscuits and gravy with some scrambled eggs and sausage patties. the patties were kinda dry which was a total shock. the potatoes that they serve are simply the best breakfast potatoes money can buy. honestly thats what bumped them up to 4 stars from 3. \n\nthe location is pretty busy but they get tables cleared out fairly quick. i have never had to wait too long. if your in the mood for some good breakfast anytime <mark>Homemade Soup Of The Day</mark> this is definitely your spot.", 
            "do you know what's good all the time? breakfast! there's never a wrong time for breakfast food. well, like most breakfast places egg works is only open half <mark>Homemade Soup Of The Day</mark>. that's okay, atleast my friend and i got there 40 min before they closed.\n\ni ordered the crazy chicken omelet, well something like that. it was alright. it didn't \nstand out and the taste didn't amaze me.\n\ndo you know what was amazing though? they had banana bread french toast. i have never seen that at a restaurant! i was pretty excited when my friend said we should share one. if you come here, i definitely recommend it. i love that banana bread isn't that sweet, but very flavorful.\n\nthe service was also very friendly. you know how girls get when they get brunch, it's never ending talking. even though we were almost the only people in the restaurant we didn't feel rushed when we ate and caught up.", 
            "it's hard not to be a fan of egg works.  what you get here is pretty much what you get at the egg and i (their other breakfast joint), cracked egg, and if you're in socal, broken yolk.  breakfast is my favorite meal <mark>Homemade Soup Of The Day</mark> and when it comes this meal, i tend to keep it simple...just an omelet and some carbs. on my most recent visit, i had brunch with a couple of friends.  and for my meal, i had a 6 egg white omelet with spinach and mushrooms.  it was high carb day, so i had a bowl of oatmeal added to my meal.  the food is consistent and for egg whites, very tasty.  oh yeah, i also had some turkey bacon that actually taste like real bacon.  \n\nas for their service, i'd give them 4 stars.  keep in mind that this is one crazy busy egg works on the weekends.  this visit was mid-day and mid-week.  in other words, we were seated right away, got our food right away, and was out of here fairly quick.  overall, you can't go wrong for breakfast at egg works, especially if it's consistency that you're striving for.  \n\n\n\nyelp personal challenge 2013 - (487/500)", 
            "i was uneasy walking in.  it is a huge space with tons of people waiting for a table and the background roar of the hungry breakfast crowd is hard to ignore.  but before we knew it, the hostess is calling our name and we're being shuffled through the restaurant to a more than accommodating table. \n\nchristopher, our server, was great.  he checked on us frequently and was very courteous.  i had the special for <mark>Homemade Soup Of The Day</mark>, the firecracker scramble.  it was cheesy, spicy, saucy, and huge!  everything i wanted.  i actually fed the last of it to my fianc\\u00e9 -- i was defeated.  \n\nthe banana nut muffin is ridiculous.  i don't know what to make of this thing.  the muffin top isn't your run-of-the-mill rounded little top, but a flying saucer of sorts just perched right up there like nobody's business.  i'm upset we didn't get a dozen to take back with us.  ain't no muffin like an egg works muffin!", 
            "i have gone here twice in the last week already, and although they are always busy, they try their beat to seat you right away. both times that i have went, the wait was no longer than ten minutes. their banana but muffin is hands down the best muffin ever. so is their country fried chicken skillet, waffles, pancakes, & island plates. my husband and i are trying to make this our monday morning regular place to go to till <mark>Homemade Soup Of The Day</mark> we grow old together. love this place and their <mark>Deli</mark> breakfast/brunch foods.", 
            "if i want to go to a breakfast restaurant to get satisfied and full,  this is the place. their skillets are really great. i ordered the \"works\" skillet that included eggs, fried potatoes,  onions,  mushrooms,  green peppers, ham and sausage. very tasty.  add some black pepper for some subtle spiciness and you're golden. \n\nas for the service; it's wonderful.\ndonna was our server for <mark>Homemade Soup Of The Day</mark> and she was very courteous to our needs. really great service from her.\n\nthe only reason i did not give a 5 star rating was because of the pancakes that i ordered. i always order pancakes for every meal. my dissatisfaction was that their batter does not seem fresh. the only way i knew that it wasn't,  was because the pancakes were very tough to cut. my only assumption is that the batter is already pre made throughout the entire day and thus the gluten is already activated and hardened. i believe the goal to a good pancake is to not premake the batter and just make a fresh new batter for every pancakes order requested.", 
            "breakfast is the most important meal <mark>Homemade Soup Of The Day</mark>. and in our valley, it seems that really good breakfast joints aren't as abundant as one would like. egg works happens to be one of my favorites due to their friendly staff, comfy atmosphere, and most importantly, their fantastic selection of breakfast goodies. their menu can be daunting to those of feeble breakfast tastes....but to a true breakfast maverick like myself, it is always a joy to peruse the menu on your hunt for a bellyful of wonderful. and you will get a bellyful. large portions abound, from the fresh made muffins, to the skillets, omelettes, and all the other egg creations. larger parties may have to wait to be seated, but good things come to those with patience. for those without, there is a fine mcdonald's in the same parking lot. my latest trip there was last week and donna was our server. she was spot on with getting my coffee, and although my dining companion was a bit tardy, she kept checking on me while i waited and enjoyed their <mark>Deli</mark> morning brew. once my  cohort arrived, we ordered and were served our <mark>Deli</mark> meals shortly after. halfway through, my buddy realized he didn't get his muffin. we asked donna as she passed by about it and after a quick apology brought not one, but two muffins. one was consumed, and the other was taken home for a latter morning treat. kudos to you, donna, and your fine establishment.  :)", 
            "my boyfriend & i dined in yesterday morning and ended up getting food poisoning for the rest <mark>Homemade Soup Of The Day</mark>, which also ruined our plans for <mark>Homemade Soup Of The Day</mark> considering that i'm on vacation. although we had an excellent server, i'm afraid to eat eggs and cheese again!", 
            "my husband and i try to eat here at least three times in the year. ashley was very helpful and convinced my husband to try <mark>Homemade Soup Of The Day</mark>'s special, which was <mark>Deli</mark>. pretty much any form of the eggs benedict is amazing. also, the banana nut muffin.... take a whole loaf of the banana nut bread with you!", 
            "this was the best breakfast i have had in a restaurant in years!\nmy chili relleno omelette was the best mexican breakfast i've had outside of mexico!\n<mark>Homemade Soup Of The Day</mark> before this we spent $50 on breakfast for two people at the aria cafe and had one of the worst dining experiences i have ever, ever had in my life.\nwe paid under $20 for our breakfast at egg works and we're practically licking the plates!\nmy boyfriends corned beef hash was really great and the house made banana nut muffins were amazing.\nbest breakfast i have found in vegas and so cost efficient and family friendly.\nlink to my blog i wrote about our great expierence there.\n\nhttp://hungrymountaineer.com/2015/08/chili-relleno-omelet-ole.html"
        ], 
        "dish_name": "Homemade Soup Of The Day"
    }, 
    {
        "text": [], 
        "dish_name": "Plain Burger"
    }, 
    {
        "text": [], 
        "dish_name": "Cheeseburger"
    }, 
    {
        "text": [], 
        "dish_name": "Cheeseburger n Bacon"
    }, 
    {
        "text": [
            "[review is solely for the awesome <mark>Chili Cheese Burger</mark> i chased down and captured here]:\n\nwhen someone recommended egg works 2 as having one of the best <mark><mark>Chili Cheese Burger</mark></mark> in town, i was dubious.  i mean, it's a breakfast place, right?  who would ever order a burger when there are omelets and pancakes to be had?  but i went out on a limb and tried the <mark>Chili Cheese Burger</mark> that i was recommended.  holy tastiness, batman!  i almost licked the plate it was so good.\n\nfor those of you that haven't indulged in the sloppy mess that is the <mark>Chili Cheese Burger</mark>, let me tell you that the meal lives and dies on the quality of the chili.  under the smothering tomato-meat sauce of a good chili, the burger patty becomes mere textural background.  but given the right chili--an amazing chili--that's not a bad thing.  \n\nand egg works 2 rightly deserves praise for its chili--which is cooked cincinnati style.  cincinnati chili is a little different than what you're probably used to.  it's made with some unusual ingredients (cinnamon, cloves, allspice or chocolate) and you won't find many chili peppers or chili powder in the sauce.  i was a little skeptical when i found out about the lack of chilies, but it's good, really good.  the cincinnati-specific spices make the chili so much richer that you really don't miss the heat.\n\norder it with the works and you'll get gooey cheese and onions that make the burger a sloppy, brilliant mess.  the chili spills over the burger when you pick it up.  you'll need like 45 napkins.  but you won't care.  \n\nman, it's a good burger.  i'd put it in the top 15 burgers in vegas.  why 15?  well, i suspect there's nothing very interesting about the burger patty's taste under all that chili goodness.  but you won't even think of that while you're scooping every last bit of chili off the plate.", 
            "i went there for lunch my brother and i, and we had the <mark>Chili Cheese Burger</mark>, i wanted mine medium and my brother's well done. unfortunately both burgers were well done but the waitress (candice) noticed that and asked me if i would like my burger to be replaced. i didn't want to wait anymore so i just when ahead and started eating it. suddenly, candice came back with our check with a 20% off. she was great about it and apologized about the burgers being messed up.", 
            "donna was a great server. food is exceptional.  awesome variety.  i had the country benny, eggs benedict country style.  biscuits instead of english muffin, sausage patty instead of canadia<mark><mark>Chili Cheese Burger</mark> n Bacon</mark> and sausage gravy instead of hollandaise.  it was excellent!!!  my wife had an omelet loaded <mark>Waffle With Meat</mark> and cheese and guacamole.  i had a bite and let me tell you.  it was awesome.  we search out egg works every time we go to vegas.  you should too.", 
            "five of us went to lunch at the location on eastern.  they weren't very busy, yet it took quite a while for the food to come out.  i liked their fries and onion rings.  i ordered a <mark>Ranch Club Wrap</mark> without tomatoes.  it was a lot of food but i didn't care much for the cheese or the ranch dressing, too runny and sour.  two members of my party ordered the blts and we're happy.  the blts had a ton of bacon on them.  another member of our party had the pancakes and we both thought they tasted more like kfc biscuits than pancakes.  lastly, someone had the <mark>Chili Cheese Burger</mark> and they thought it was awful.  they said it tasted like they put chopped onions and oatmeal or some other type of filler in it.  they may serve up a mean egg breakfast, but i don't think i'll be going back to find out.", 
            "came in for breakfast, blueberry pancakes <mark>Deli</mark>, service perfect with ashley! my son had a <mark>Chili Cheese Burger</mark> with the works style, said it was the best <mark>Chili Cheese Burger</mark> he's had in awhile!"
        ], 
        "dish_name": "Chili Cheese Burger"
    }, 
    {
        "text": [], 
        "dish_name": "Blackened Asiago Burger"
    }, 
    {
        "text": [
            "for a few years, this has always been a favorite of mine -- however --- that changed yesterday. here is my account:\n\nservice is always great. if this were just about the service it would be a 5 star rating. my favorite waitress, candice (enter into drawing) is off on tuesdays so i was served by dolly. dolly is another of many friendly and bright eyed servers with an ear-to-ear smile.\n\ni ordered the \"<mark>Works Burger</mark>\". the first problem was that i was not served one. i'm not really certain which burger i received, but it was not a \"<mark>Works Burger</mark>\". it did have the swiss cheese i selected, and the grilled mushrooms & onions. however, it was missing the bacon! oh no! not the bacon!\n\nthe second issue was that i ordered \"medium\" and this burger was \"well done\". initially i would assume the wrong item was removed from the window, but i will still hold this against the rating as burgers are all served extra-rare or well done. there is no middle ground in this restaurant, so if you want anything in the range of rare through medium well i recommend you not order a burger. (this has been an on-going issue for some time now). also, the bottom of the bun was so soggy i felt it had been dropped into a sink. it was only 1/8\" tall as it was squished down from the burger.\n\nlastly, i have issues with the consistency of their food. some days the <mark>Works Tuna Salad</mark> is dry. other days it is runny mush that even the biggest fan of mayonnaise wouldn't swallow. this holds true for many items, and on this visit the potato salad was so full of mustard i couldn't eat it. bright yellow like an egg yolk.\n\nas a side thought, i will not complain about my food in the restaurant. dolly checked back a few times -- but it was my choice to not tell her about my issues. i won't say that i am not returning (pardon my double negative), but burgers are 100% out of the question.", 
            "candice was super friendly and attentive. she helped us choose the best meal, i had the <mark>Diced Apple & Cinnamon</mark> pancakes and my bf had the <mark>Works Burger</mark>. the whole egg works experience was fantastic ! the food was beyond amazing, it's a definite must ! i love the traditional-style restaurant experience!"
        ], 
        "dish_name": "Works Burger"
    }, 
    {
        "text": [
            "two weeks had passed since the original review and after a couple emails with egg works exchanged i was assured that they had fixed the problem. i had returned on 05/23/14 and ordered the <mark>Patty Melt</mark>. \ni must say i would have instantly traded this burger for one that was well done. at best, triple-extra-well is the best way to describe it. i had noticed that the food was taking a long time to cook -- and the reason was that my burger needed an extra 15 minutes on the grill. if only there was a way to post a picture on an \"update\".\nbriefly described, both the bread and burger were on the grill far too long. one side of the burger patty was blackened and crunchy, like it was forgotten. forgotten, but still served to the customer. the bread was grilled to the crunchy consistency of a cracker. \nafter this visit, it is safe to say i will not return.", 
            "i always like going here or their location on sahara and arville. \nthe menu's items have a good variety, and the food always comes out warm and tasty. \nin the years that i've been frequenting the establishments, i haven't had bad service. this recent experience, going around noon, was no different. the funny thing about going in that time frame is that their busiest period had passed. hahaha... according to the boyfriend, there was like 2 servers to 1 table, constantly checking on their patrons, and still able to have a good time with co-workers. \nanyway, i like their skillets, particularly their chicken fried steak. the boyfriend likes their <mark>Patty Melt</mark>. i think their fries and red potatoes (breakfast plates) are seasoned the same way. it's just yummy. hahaha... i like the way they leave the coffee pot with the table so i can just help myself unless that runs out.\ni think the only thing i didn't like about this experience was paying for the bill... the ladies didn't acknowledge me when i walked up to the desk. they just talked about fixing another table's bill, even though they all made eye contact with me at some point. then when they were done, the cashier just held her hand out for my bill. eh."
        ], 
        "dish_name": "Patty Melt"
    }, 
    {
        "text": [], 
        "dish_name": "3 Way Cincy"
    }, 
    {
        "text": [], 
        "dish_name": "4 Way Cincy"
    }, 
    {
        "text": [], 
        "dish_name": "5 Way Cincy"
    }, 
    {
        "text": [], 
        "dish_name": "Cincy Coney"
    }, 
    {
        "text": [
            "my friend christy and i had an exercise class on the other side of town, so we thought we'd stop for breakfast afterward. although i've been to the egg & i on sahara countless times, i had never been to egg works on sunset. same good food, same crowded environment. and, thankfully, same awesome seasoned potatoes!\n\nalthough it was not quite 11, we both opted for lunch rather than breakfast. christy had the reuben, and i had the <mark>Carlsbad Club</mark>, which was sort of like a regular club but with the addition of avocado and the subtraction of the middle piece of bread. christy loved her sandwich (and it did look pretty good), and my sandwich was good (not great). but we each ordered a side of the aforementioned potatoes, and that is a great thing. i'm sure the \"secret ingredient\" to these little potato chunks is just lawry's seasoned salt (or something comparable), but that seasoning makes all the difference.\n\nthe restaurant was crowded, but we were seated quickly and our food came out fast. they have a little egg-shaped flip card on the table so if you need service, you can turn it from black to yellow and someone will come to your table asap. we used the flip card to ask for takeout boxes, and they were johnny-on-the-spot about responding. and to top it all off, i had a bygo entertainment book coupon, so both our meals (with two iced teas) were under $20!\n\ndepending on which side of town you're on, you can probably find an egg works family restaurant somewhere near you. and i suggest you do, if not for their myriad egg dishes, for -- what else? -- their tasty taters."
        ], 
        "dish_name": "Carlsbad Club"
    }, 
    {
        "text": [
            "i had my farewell breakfast with my guests here this morning and it is now after 5 and i am still full - still can't eat the <mark>Deli</mark> lunch i brought to work - and this is not really a bad thing!\n\ni have eaten here twice - the location is good, service is very good.  the hostesses were so friendly!  the first time i went, i had the fiesta skillet..sooo much food.\n\ntoday i had the works veggie benny...i am so grateful to our waitress who told me i could get a half or a full order.  i got the half...and i am still full like 7 hours later!  it was a beautiful english muffin with grilled tomato, fresh spinach and avocado plus a poached egg and hollandaise.  it came with a huge side of super hot, wonderfully seasoned breakfast potatoes...no grease or mush or anything - crispy and yummy!\n\nmy guests had pancakes and scrambled eggs - a plain short stack was enough for 3 people and the eggs were cooked perfectly.  drinks were refilled and the waitress left the entire pitcher of coffee on the table for our one coffee drinker!\n\nthis is a fun place to go with a group - and they weren't busy on a random wednesday around 9 am.  i am soooo full from my half order but i would definitely return!", 
            "yuuuum!  a friend brought me here for breakfast and i loved it.  i love breakfast foods and it's nice to go to different places other than ihop and places like that.  i had the chorizo scramble or something like that and it was <mark>Deli</mark>!  my bf had the corned beef hash and it's real corned beef!  not the canned kind!  haha.  oh and they have really really yummy banana nut bread that comes w/ the meals.", 
            "who would have thought a place named egg works would have tasted so good. i came here because my dad kept telling me to try this place out, since we were always in the area.\n\nanyways, we went there about 10am and the place was packed! we had to wait for a table that seated 4adults and 1 child, which was about 25mins but that was okay, we had plenty of time to chill outside. we were finally called in and the waitress was pleasant. my bf and i, were still thinking of what to order while dad and cousin already knew what to get. we decided to just share a plate that had fresh corned beef, option of getting that or the canned version (no thanks, fresh is always better), my dad got i believe the egg combo?? i could be wrong i forgot the name. he got a half serving because they have half servings there which is a plus because i don't eat much.\n\nas we were waiting, we seen this egg shape happy face at the end of table, my cousin ex<mark>Plain</mark> to us that there are two faces, one sad and one happy. if you need service you would just flip the happy to the sad face and a waitress will come over. as he was showing us, i kid you not like 2secs later a waitress came by and ask if everything was okay. i was impressed but we just simply told her that we were just curious of what that was. \n\nour food came, it was <mark>Deli</mark>! i tried some of my dads food and it was really great. i liked mine more because my filipino side loves corn beef canned or not ha ha. my cousins daughter had a fresh banana muffin and of course we stole a piece from her when she wasn't looking because she will not let that go, and that was really tasty. of course being such \"tourist\" we decided to take a pic of the egg and flipped it once again and 5secs later the waitress came up and asked what was wrong. still so amazed on how quick she came again! \n\nthe food here is great so try it out (it doesn't hurt to try right?) and the service was just as great. i like this place and would definitely come back again.", 
            "four stars for the food, 3.25 stars for the service:\n\nfood:  \nthe potatoes have me dreaming for them at night.  that seasoning is <mark>Deli</mark> and it has just the right texture.  the first time i went here i had a crepe with avocado and pico.....i can't remember the name of it but it was <mark>Deli</mark>.\n\nservice:\nhmm it was okay.  it could have been better considering that they have eggs on the table to show your server whether you need service or not.  i thought it was genius at first but then began to think of how impersonal it is.  i enjoy servers coming up to me randomly asking how everything is and my water magically re-appearing.  that's when you know your service is good.  the fact that they rely on the clients to passively flip a sign is kind of a turn-off.  come and talk to me... i won't bite.", 
            "saturday morning came quick this week and boy did i want some breakfast, we decided to turn to yelp to figure out this dilemma and what i found was egg works.. we hopped in the car and headed to this joint. upon arriving the parking lot was full and this is sometimes a good sign... if you think about it like a fisherman... if you follow all the birds you will find fish. anyways, we walked in and were sat immediately, now none of us out of the group had ever been there and the waitress informed us because it was our first time there they throw in free banana nut muffins which happen to be <mark>Deli</mark>. i then took some time to look over the newspaper... i mean menu and chose the country benny. how do you go wrong with a biscuit covered in eggs and country gravy.. well a coronary is how you go wrong but the food was great. the food came out very fast. the waitress was crazy friendly and on top of all the drinks. i was extremely happy with this choice and will be back for sure!", 
            "ahhh... i would like to thank my yelp mobile app for helping me find this breakfast joint. wandering around the outskirts of the strip, i found egg works 2 just a few miles away from where i was. a minute after we sat down, our drink order was taken and then shortly after we were greeted by our especially chipper waitress, dolly, i think her name was. i asked her for a recommendation on the menu, and i'm glad i took it. she even mentioned that they did half orders on most items on the menu.\n\nthey have a system set up to grab the staff's attention when you need something. you just flip an egg icon to reveal a yellow unhappy face. we never had to deal with that since everything was perfect. our food came out fast. the half order of the chile rellenos omelet was more than enough! it came with potatoes and a banana nut muffin. everything was <mark>Deli</mark>. we even came back a second time during our visit to las vegas with my mother and brother in law! they thanked us for the recommendation.", 
            "this place is great. it gets swamped on weekends- if you come before 1pm, be prepared to wait to be seated at least 10 minutes, possibly longer for larger parties.  it is worth it, though. my fianc\\u00e9 swears by their biscuits & gravy, i really like their \"hawaiian\" breakfasts- the sticky rice, brown gravy & spam is <mark>Deli</mark>! i've also had their mashed potato omelet (pretty good, huge portion) and a few of their benedicts (homemade hollandaise is great) and have been pleased. also, their coffee is awesome!", 
            "i have been to this place numerous times and it has never disappointed.  it has become a must when my family members from out of town come to visit.  the service is a given considering the yellow/black egg.  the food is great!  i have had a number of their breakfast dishes and the breakfast tostada is by far the best!  the chili omelet is great as well.  their seasoned potatoes are just plain <mark>Deli</mark> and they serve alcohol.  beer for breakfast?  indeed.  i used to live right down the street but have moved further away.  my wife and i still try to hit this place up at least once a month.  i have gone here after my bachelor party and after running the rock n' roll marathon and both times the food helped to ease my pain.", 
            "the banana nut muffin is absolutely <mark>Deli</mark>. :)", 
            "what we had: sunrise mountain. croissant topped with eggs and bacon and cheese. yummy and artery clogging. the potatoes were spicy and flavorful. \nstuffed french toast: <mark>Deli</mark>, sweet chewy\ncoffee: weak and bland. they had hazelnut and regular. both suffered from weakness\n\nservice was quick and attentive. jordan was nice and kind of cute if you care about such things\n\natmosphere is generic breakfast place. lots of tvs to check out news\n\nwould be 4 stars if not for the coffee. \n\n$28 including tip", 
            "a must every time we visit las vegas! \n\nyou know this place sells alot of egg dishes when the <mark>Deli</mark> truck <mark>Deli</mark> eggs by the stacked case - and many of them.\n\nyou can get your egg dishes just about any way you like them and know that you'll have a good experience. i tend to favorite the california omelet which has tomato, fresh avocado and mushrooms, along with melted swiss and hollandaise sauce. the omelet alone is more than enough at 3 eggs, but they include some great potatoes (or another side) and a banana nut muffin which is usually good, but this time tasted a tad off. i didn't mind the muffin, but my kids didn't enjoy them as much this time.\n\ntheir service style is interesting - flip your metallic \"egg\" at the table if you're unhappy to get someone's attention. neat concept!\n\nwarning - portions are large. if you're traveling, you'll likely feel like you're wasting food unless you choose to share (they may charge for that, but it's not excessive). after the muffins, i could only eat \"most of the omelet and a small bit of potatoes before feeling stuffed.", 
            "i'm from st. louis, mo. if a place has biscuits and gravy i have to order it. i have no choice, i am driven! egg works has it and i ordered it with two fried eggs on top (there is no other way!) first off, those fried potatoes they serve are the bomb! crispy and evenly browned, not even remotely greasy. the husband and i gobbled them like fiends. the gravy definitely passed muster with my mid-western heart...rich and loaded <mark>Waffle With Meat</mark> flavor, and no pastiness. my eggs were perfectly cooked, as were my husband's. the biscuits were weird, tough and chewy. no fluffiness here...and they are an odd artificial golden yellow color, throughout. we actually scanned the menu to see what we could get that <mark>Deli</mark> gravy on next time, because i never want to bite one of those creepy biscuits again. we'll be back to try their other offerings, because the plates that sailed by us on their way to other diners looked quite tempting. coffee was just meh.. not yucky, just meh. we'll order tea next time and find something to smother with that gravy!", 
            "i had low expectations for this place to be honest. the name and location itself seemed a bit... eh? but after walking in and ordering omg this place is amazing! the food is <mark>Deli</mark>! my friend and i shared the <mark>Grilled Veggie Pesto Sandwich</mark> with fries. the sandwich had grilled bread, veggies and was soooooo freaking good! though i probably couldn't finish a whole one i want to damn sure try! the fries were crispy shoe string fries and seasoned! yum! my friend and i were full and satisfied. i would definitely come back.", 
            "i love egg works so hard. any place whose regular menu items include green chile and chorizo is good in my book, but everything i've tried here has been <mark>Deli</mark>. \n\nalso, i love that they allow for half orders. additionally, i'm super picky about my steak, but their steak and eggs never disappoint. also also also, many of their waitresses are tattooed cuties and nice as all get out. finally, their bloody marys will kill you. in a good way.", 
            "i am a glutton by nature and the way that egg works ii does breakfast only fuels my sinful constitution. the week before my birthday, i tend to go on a strict diet in preparation for the voracious appetite to come. out of the blue, the craving for eggs benedict manifested, so i succumbed. it was the first time in five years that i have even thought about ordering this dish, so i did my research to find a combination that would best suit my personality. \n\negg works happens to have the veggie works benny with grilled tomatoes, spinach, avocado, and two poached eggs smothered in hollandaise sauce. i almost got this, until i saw the blackened prime rib served on a grilled croissant with sauteed spinach, bell peppers, and eggs covered in the same decadently rich dressing. i could not resist and why should i? the  huge portion was served in a skillet with a a few slices of fresh fruit and home fries. the potatoes are well seasoned and crisp. i started by saying i would only eat half of them and soon the whole side was gone. the eggs benny was <mark>Deli</mark>, but not without some minor issues. the hollandaise is plentiful and salty, ask for it on the side. the prime rib was cooked to well done and on the tough side. what it has going for it outweighs my com<mark>Plain</mark>. the soft, airy croissant gives a texture that is not often associated with this dish, and i appreciated that. the eggs were poached to perfection. with one swift slash of my fork, the center burst out with all the fatty goodness of the yolk. the paprika on top, cut through the dense creaminess of the sauce. \n\nwith my craving subdued, i can go another five years without it and a day without eating. it will take a few hours in the gym to work off this meal, but there is no remorse or regret with this decision.", 
            "amazing! it's off the strip, on the other side of the airport, but worth the 15minute detour from heading home.\n\njust a few points about this establishment:\n\n1.  the entrance to the restrooms is decorated like an outhouse-disturbing, but cute!\n\n2.  if it is your first time, they give you a <mark>Deli</mark> muffin\n\n3.  unlike everywhere else in vegas, they leave the carafe of coffee on the table, and outfit you with all the sweeteners and flavored/unflavored dairy/non-dairy creamers your heart could ever desire\n\n4.  the eggs benedict is probably the best in vegas (not the best ever, by any means, but definitely fantastic)\n\n5.  it's one of those \"pay at the register when you are done\" kind of places; just don't forget to leave the tip \n.\n\nthat's all i got folks, so get out there and enjoy some egg works!", 
            "my wife & i went here during a recent stay in vegas & had one of the most wonderful breakfasts in recent memory.  my wife had some amazing pancakes stuffed with fresh <mark>Banana</mark> and <mark>Chocolate Chip</mark> (special request).  they were so <mark>Deli</mark> she didn't even add syrup.   i had the classic 2 egg breakfast with smoked honey bacon that was really good.  the prices are really reasonable as well i think our whole bill was around 14.00.  well defiantly be going back here the next time were in vegas.", 
            "wow this place is amazing. where do i start? the portions are giant. so if you know you will need to take somthing to go, here is a hint: eat all of the seasoned potatoes first. the do no heat up well at all.  the biscuits and gravy are <mark>Deli</mark>. the banana bread french toast is the best i have ever had.  the staff is usually terrific and is so wonderful to my 8 year old daughter, who changes her mind 10 times before the order comes out--from the type of drink she wanted to the type of toast--they have always accomodated her. this is the best place to eat. the only warnings i have besides the potatoes are that they close at 3 pm and they are usually super busy so there is a wait.", 
            "this place is just exceptional!  its near the airport and a bit of a drive from the strip but worth it. you get a free <mark>Deli</mark> muffin if its your first time. the portions are huge (really too much for one person) but the food is very satisfying, especially the french fries. they even have a happy/sad face egg meter type thing on the table for when you need service or unhappy about something...and they take it seriously! our waiter was very sweet and everyone seems to communicate very well, one server will cover for another if anything is missing. unlike some breakfast places, egg works also takes reservations.", 
            "i got ny steak and eggs for 11 bucks. not a bad price. the steak was a little small. came with potatoes and a free banana muffin. my sis got country fried steak. she didn't like the cfs cause it was all jammed up together and a bit mushy. \nthe potatoes that came with the meal were <mark>Deli</mark>..the seasoning on them were very tasty.\nthe muffin was....well let me just say i finished it in like 3 seconds. prob the best muffin i ever had. \nmy sister didn't eat her cfs so they took the charge off the receipt. i was shocked because i told the waitress not to worry about it, but she refused and took the charge off anyway. \nso the customer service was 10 out of 10 which made the whole experience even that much better. \nyou can't go wrong with this place", 
            "never before had i ordered 'biscuits and gravy' -- until i spotted it on the eggworks menu. when it arrived i thought maybe i'd made the wrong choice. the huge plate of biscuits and gravy was too huge and the pale gravy looked gross. how sorry would i have been if i didn't dig into those biscuits and gravy. that food was <mark>Deli</mark>! and i don't usually do gravy. oh and i also had scrambled eggs. i've never not been able to eat an order of scrambled eggs before. but i couldn't eat what seemed to be a dozen scrambled eggs. they were perfectly scrambled and so beautifully textured -- not hard and dry but moist and solid. the old bay seasoned hash browns <mark>Deli</mark> completed the trinity.\n\new loses 1-star because of the non-dairy creamer.", 
            "another heavenly breakfast place.  busy as hell on a sunday.  :)  everyone was quite satisfied.  heaping portions of heavenly <mark>Deli</mark>.  their potatoes are seasoned with paprika and something else i can't place, it makes them quite friggin tasty.  i wanted to pick off everyone's plate!!  i ordered the omelet with mashed potatoes in the middle and cheese.  top that with banana bread.  i ate like i was feeding twins in my belly (i'm not).  completely egg-gasmic.  i'd do it over and over again if i could.", 
            "i got blueberry pancakes and they <mark>Deli</mark> big time. great food.. the real blueberry and huge cakes made for a feast. looking forward to hitting this place again.", 
            "it's weird how things happen.   i was reading the reviews about egg works on wed and thurs as something i really wanted to try on friday.  i didn't mention it to anyone at work but that's what they decided on doing for friday lunch.\n\ni was actually impressed.  real spacious and nicely decorated barn look!? like the entrance to the restrooms.  there's outside dining area, a kinda private room for large groups, a breakfast counter for solo diners, tv's, wifi.  service was quick, it wasn't that busy because it was a later lunch.\n\nso it looks like most of their menu were breakfast dishes since it doesn't look to be open for dinner. most of the dishes looked really good and were large portions. i had the spinach benny which was really <mark>Deli</mark> but didn't care for the sides, a slice of grape fruit and pineapple, with some works potatoes. server hooked me up with a pretty good banana muffin which i didn't order.  someone had the pancakes which seemed a good portion but heard it taste pretty basic. others had the corn beef hash and some other really good looking breakfast dishes, i'll definitely be back to try more of the menu.\n\ni found a bogo coupon online at las vegas review journal website lvrj.com and printed a bunch for our large group.  they said they don't usually honor these printed coupons unless they come straight from the newspaper but they honor it this time.  i'll probably be going to the other locations and see if they'll also honor the coupon or not.", 
            "banana nut muffin is a must! so good! we were a party of 9, and the wait was about 20 minutes on sunday around noon. place was poppin'. our server was really friendly! we were all first timers at egg works 2, but my boyfriend and i had been to egg & i before. we knew what to expect, and egg works 2 definitely <mark>Deli</mark>. everyone enjoyed their dishes. i really enjoyed the haole moco, which is exaclty like a loco moco, but they use the house gravy instead. yum! my boyfriend got the avocado and bacon omlette with potatoes. omg i forgot how good the potatoes are!!! a must too! my cousin got the strawberry french toast. it was a bit sweet, so ask for the strawberry sauce on the side. i would definitely recommend this place for big or small parties. it a bit off the strip, but worth the drive.", 
            "our waitress was very nice! and the food was great, especially after the gluttony that was the vegas buffets! i got a mashed potato omelet, but i didn't want to smother it in cheddar and jack cheese, so i asked for feta instead. great choice! but the thing that got me, that got the other yelpers as well, was the banana nut muffin...dear god, the muffin...i liked it better than the banana nut muffin at the california grill in whittier, ca. go there and have <mark>Deli</mark> food! definitely having it again when i'm in vegas again!", 
            "huge amounts of fresh and tasty stuff for breakfast, <mark>Deli</mark> by quick and courteous wait staff. all four of our group thoroughly enjoyed our meals, and only one of us got more than half of the food eaten. \ndoggy bags for breakfast?? \nwell worth a try; a hidden <mark>Deli</mark>. \nand if you are lucky enough to get sandra for your waitress, say hi!", 
            "i came to egg works with some skepticism.  i am not a huge fan of eggs.  the only reason i came was to attend a focus group survey meeting.  i came a skeptic.  i left a fan.  i ordered a hawaiian breakfast.  i had rice, spam, eggs, and fresh fruit.  it was great.  i love spam and the egg yolk mixed into the rice was a <mark>Deli</mark> combination.  i have not been back since that time because it is not on my side of town.  if i do make it back though, and i hope that time comes, i want to try the biscuits and gravy.  i saw somebody order that and it looked awesome.  the plate, more of a platter, was huge.  the biscuits, though thoroughly covered in gravy, looked to be big and fluffy.  even from a distance i could see the sausage in the gravy.  i must try this.  the food i got was great.  the food i saw looked amazing.  service was a tad slow but it was a busy saturday morning.  wait staff can only go so fast when the restaurant is near capacity.  that is another sign that egg works is nothing short of grand.", 
            "in my quest to support local businesses, we checked out egg works this morning. since it was after 10 on a sunday morning, i figured it would be crowded and it was. we only waited about 10 minutes. that was a shock. our server was kim and she was outstanding. the food was ok. i had regular pancakes, eggs over medium, and bacon. she asked if i wanted the bacon crisp and it was (crispy and good). the eggs were runnier than i wanted (maybe my fault for not asking for over hard). i am a pancake lover and the pancakes were some of the worst that i've had a restaurant. i didn't like the taste of the batter and they were too heavy and doughy. my partner tried them and liked them. he had waffles, ham and scrambled. he didn't like his waffle and neither did i. something about the batter. anyway...the place is called egg works...i will go back. i liked the atmosphere. i really enjoyed the employees. they were all very nice, helpful, and funny. next time, i will focus on an egg dish which i'm sure will be very good. oh...we did order a banana nut muffin because so many yelp reviewers talked about it. it was definitely <mark>Deli</mark> and i'll stick to that next time. there will be a next time...", 
            "4.5 stars but im going to bump them up to a 5 cause of their banana nut muffin and how quickly we got our food\n\ntheir \"benni's\" are <mark>Deli</mark>.. i love eggs benedict and their take on it is so good.. plus their servings are ginormous so youre definitely getting what you pay for.. we also had one of their omelettes.. <mark>Deli</mark>.. there's not a negative thing i can say about this place.. im glad it's right next to my house but i'm really sad that i only get to go home once a month.. \n\ntheyre not open late so go early.. my friends have been raging about this place and i finally got to try it out last weekend.. definitely added to the list of places i have to go whenever i stop by home", 
            "<mark>Deli</mark> food with a side of super friendly staff is served at this all-american breakfast restaurant. the portions are generous and you get your money's worth. the fresh veggie omelette was good and was glad they offered egg white options as well. along with this came seasoned potatoes and choice of bread (white, wheat, rye, etc...). the potatoes were magical; within a few bites i forgot i was supposed to limit my carb intake in the first place. the french toast is legit and i would be happy to order another plate. \n\nhowever, i can't say the same for the pancakes which caused some aunt jemima-preservative-box variety d\\u00e9j\\u00e0 vu: disappointingly dry, flavorless, and let me feeling like a bloated cow. unfortunately, frugality overcame me and i tried to eat as much as i could and would later regret this decision. d\\u00e9cor is your standard diner than can be seen in new york to pahrump. oddly, giant stuffed animals have taken over part of the waiting area. i'm not sure if these dirty, dust filled monstrosities have a purpose other than to entertain inpatient children, but they need to go. service throughout was great. drinks were poured when needed, food didn't take forever, and the waitress gave us our bill without asking. definitely not the fanciest place to get brunch, but it deserves some love.", 
            "while i found the crepes to be a little rubbery, (yes, i know they're egg-heavy, but that should not mean rubbery, it should mean spongy...) everything else was <mark>Deli</mark>. however, it was not what i ordered. i realize they are busy, and we arrived at 8am on friday. i didn't bother to complain however, as it looked too good to turn down. be aware that it's not real hollandaise, or at least, not the best i've ever had, but whatever it is, it's tasty. portions too large to finish.", 
            "like many somewhat trendy breakfast spots in town, the prices are a tad on the higher end but you do get huge portions and the food itself is really great! we come here about once a month for a morning \"work\" meeting. i typically get the sunrise sandwich and it's <mark>Deli</mark>. the pancakes here are greeeeaat as well. if you are on a super tight budget then i would suggest looking elsewhere...", 
            "so this was our first time. every time we are here in vegas, we always pass by this place. read all the reviews on yelp and decided to try it. just have to say that it was yummie! the portions are big. the kids meal are big enough for two kids to share unless you have a big eater. \n\ni ordered pork and eggs, potatoes, and toast. since i cannot eat eggs, the waitress let me substitute fruit for the eggs. the potatoes were <mark>Deli</mark>. it was seasoned and like the potatoes that you get with hash.  my husband ordered stuffed french toast. he thought they were stuffed with fruit and cream cheese (his mistake), but when it came out it was like a french toast sandwich. an egg scramble <mark>Waffle With Meat</mark> between two pieces of french toast. the waitress was willing to exchange it for the strawberry and cream cheese french toast (which is the one that he was looking at), but my husband's mistake so he kept his plate. he did enjoy his breakfast. the other people at our table ordered the banana nut french toast and the loco moco. they both were happy with what they ordered. our waitress was very nice. she kept our drinks filled as best as she could since the restaurant was completely packed. we didn't mention that it was our first time to the restaurant, but she must have figured it out with some of our questions. she brought some warm banana nut muffin to the table, and they were <mark>Deli</mark>.\n\nwe will definitely be coming here more often on our future trips to vegas.", 
            "great breakfast spot off the strip. it's where the locals go, and for a good reason, the prices are very reasonable and the food is off the hook!! you get a huge yummy banana muffin with your meal. my bf got the country breakfast and he loved it. i got the blackened prime rib eggs benedict, and it's one of the best eggs benedicts that i've had. it's little pieces of steak on top of a croissant with perfectly cooked eggs. we also got a sample of the chili which was also <mark>Deli</mark> so we decided to order it to go since we were stuffed. it doesn't seem like you can go wrong with anything on the menu since this place really knows how to cook breakfast right. \n\nalso, the staff is extremely friendly, very helpful, and patient. i can't wait to go back, and if you haven't been here, it's worth getting off the strip for an excellent breakfast!", 
            "i manage a breakfast restaurant, so i am more  picky than the average joe.  my first impression is a diner, not the best kept up establishment. chipped mugs on the table. coffee tasted old and burnt. i ordered the basic eggs potatoes and sausage and added a plain cake. i was sad i had to pay the full entree price for both (add on cake price where i manage) \n\nwhat was great was the muffin. warm, moist and <mark>Deli</mark>. i contiplated buying the loaf to take back, but didn't think i would be able to keep it in tack during my  flight home. the pancake was moist, huge and tasty.\nthe eggs were not whole fresh eggs, tasted like the carton kind. i guess i should have ordered overhard. the potatoes were over seasoned and covered in paprika the worst thing i tasted on my whole trip. \ni would suggest the muffin only.", 
            "such a great brunch spot!!! i have to say...egg works has become a must-stop every time i visit vegas. there really isn't anything like this in la...[i.e., huge portions, <mark>Deli</mark>, reasonably priced].\n\nmy bf & i usually order a skillet and the original breakfast burrito. both are super <mark>Deli</mark>, all thanks to those lovely potatoes on the side. the skillet actually has the potatoes all on the bottom and then covers them with cheese, eggs, and other goodies depending on what you order. you definitely have to try one!!! the breakfast burrito is my bf's favorite. i'm not sure if i like it as much as him...but i'm always down for a breakfast burrito. i think it's the salsa that makes it really. \n\nwe tried ordering the cabo burrito...that was a bust.. it's a wet burrito...too wet if you ask me..and it just lacked depth of flavor in my opinion. won't be ordering that again. \n\notherwise, the service is good and the staff is friendly. i will be returning the next time i'm in town. you should too!!", 
            "my favorite breakfast place ever! no questions asked. \n\nwhoever thought of the concept of this place, from the decor to the food to everything else in the restaurant, is a bonafide genius! so thank you very very much. \n\ndecor: this is an extremely family oriented restaurant. with a large dining hall with silly pictures that features eggs (example: egg-faced mona lisa), it's really inviting to people of all ages. the menu looks like a newspaper with cute little cartoons all over. \n\nservice: i don't know if all the servers are required to have their morning coffee, but all of them are so perky! there's an black egg you can flip over to a yellow egg - this indicates that your table needs something. when this happens, any one of the egg works staff will come over and will ask what you need. what a great idea! this prevents from you staring awkwardly all over the restaurant for your server. your server will bring your check over to your table but won't be your cashier. so after you're done with your meal, you have to go up to the front to pay. i don't mind this unless there's a huge line in the front at peak times. then i get a little annoyed, but i guess i have to deal with it.\n\nfood: yum. most of their dishes come with their \"works\" potatoes. perfectly cubed and perfectly seasoned! i can seriously have a plateful of just their potatoes. you can opt out of that for some fruit or cottage cheese. i've tried many of their dishes and was never disappointed. my favorites are listed below: \n\n- works veggie benny: calling all vegetarians! an english muffin topped with fresh spinach, tomatoes, huge chunks of avocado, two poached eggs and drizzled in hollandaise sauce. this is my favorite item on their menu hands down. \n- <mark>Vegetarian Crepe</mark>: calling all vegetarians, again! a hefty serving of guac, mushrooms, spinach and swiss cheese. the works poppy seed dressing is tangy and sweet, the ultimate dipping sauce to this dish.\n** i am not a vegetarian by no means, but the two above are <mark>Deli</mark>! **\n\n- greek scramble: chicken, mushrooms, artichoke hearts, spinach and feta cheese. opa! in my mouth. for real. \n-blackened prime rib benny: this is my boyfriend's favorite dish there. and i quote, \"what cow danced and left a mess in my mouth?!\". prime rib lovers, this is for you. \n\npro tip: portions are huge here. for a lower price, you can get half portions for most of the items on the menu. so for those on a diet, you can still enjoy the succulent flavors of egg works!", 
            "oh egg works, how i love thee.\n\ni have been to this particular egg works a handful of times and i love it each and every time. the staff rules, they always have a pot of coffee waiting for me, and the food never disappoints. from start to finish, the experience is awesome.\n\ni usually get an omelet. once, i ordered the cincy chili skillet and it was awesome. everything i get here is well made and <mark>Deli</mark>, including their fantastic banana nut muffins.\n\nthey don't rush you, despite how busy they are, and they always <mark>Deli</mark> service with a smile.\n\ni appreciate that they show sports, even in the am, on their tv's. \n\nwhat i'm trying to say is: eat here.", 
            "i love this restaurant, i have been going to it for years. overall the best service, sometimes the wait is long since they are always busy but definitely worth it.\nthe potatoes are <mark>Deli</mark> and the banana nut muffin to die for. they also serve lunch and the sandwiches do not disappoint.", 
            "love this breakfast place!  we found this place on yelp while we were in town and we immediately made plans to try it. it did not disappoint! the restaurant is spacious and had lots of room. although it looked busy, we found two seats at the counter immediately. we were greeted by helpful and happy staff to take our order. \n\nconsist with the other review, the banana nut muffins are <mark>Deli</mark>! they were warm and super moist! we ordered the country fried steak skillet and the denver omelette. loved both dishes!!! i especially loved the gravy on top of my fried potatoes and my country fried steak.\n\nwill post a picture of my country fried steak skillet. :)", 
            "this is my favorite breakfast place in las vegas!\n\nthey have a variety of food on their menu but the best items to order from is their \"local/island menu\" which includes their portuguese sausage, eggs & rice. \nthey give you the whole sausage; not just a couple of pieces so it's great!\noh & can't forget their banana nut muffin that comes with the meal (or you can get toast); it is <mark>Deli</mark>!!\nit's freshly baked so it's warm and moist.\n\nthe atmosphere of the restaurant is very cute. everything is barn themed with egg designs. the servers are friendly and the food comes out quick!\nand not to mention this place is decently priced. they used to have a lot of coupons in the local vegas magazines so it would make your meals even cheaper!", 
            "today was my first time ever going to their  chain restaurant and i was impressed for several reasons. \n\ntoday happen to be father's day and my dad decided to check this place out. we went and of course not only is it a sunday morning but it's a sunday morning on father's day. the line was insane! i was worried because i only had 1.5 hours before i had to go into work. as soon as i saw the line my first though was \"this place better be worth it\" and \" i better be seated fast\". once we reached the receptionist my name was at the bottom of the list to be called but they were constantly calling people to be seated and it only took max 10 minutes to be seated. i was highly impressed. i have never gotten faster service than i have at this place. we were seated at a booth that was a little snug for my family but it was still comfortable enough to eat in. i was surprised that the receptionist kept checking up on us to make sure that we were comfortable and even offered to give us a different table which was completely unnecessary. it was nice to have that sense that everyone in the restaurant wanted to make sure you were happy with not only your meal but the experience as well. \ni ordered the ruben sandwich which might not be the best breakfast choice but i thought it was <mark>Deli</mark>.  my parents tried the tostadas and they were huge and could probably feed two. their <mark>Chocolate Chip</mark> pancakes were also really tasty. i am not a real big fan of breakfast food in general but after trying this place i definitely will reconsider my lack of appreciation for breakfast food. if you are looking for a casual, tasty and decently priced place i highly recommend this one.", 
            "this place is the bomb bomb and the people are very friendly! great food, eggs are awesome here, i mean awesome. the muffins...best muffins i have ever had in my life. soft, sweet and <mark>Deli</mark>. i come here quite often, i just came in today before work to get some breakfast goodness!", 
            "great breakfast stop after a long flight from pennsylvania. in-flight snacks suck and we were starving! after picking up rental car and yelping breakfast we were <mark>Deli</mark> to find egg works.\n\nservice was friendly and fast. decor was fun and bright. the food was <mark>Deli</mark>. i had the breakfast burrito and it was stuffed full, hot, and not too greasy. my wife's western omelet was also a huge portion and the potatoes were very tasty.\n\na great find that we will definitely visit again.\n\nthe banana nut muffin was highly recommended but we were stuffed.", 
            "i was looking on yelp for a new place to go for breakfast when i saw egg works (which i'd never heard of) and saw they had several locations. driving from boulder city, we decided to try the eastern and sunset location. it was well worth the drive!! it was pretty busy but we were seated right away and our drink order was taken within seconds. the servers were friendly, diligent and energetic. the food came quickly and was <mark>Deli</mark>. i will most definately be a return customer!!", 
            "<mark>Deli</mark>, always top quality and fresh, love it", 
            "came here w/ friends after the badass dash. starving and ready for some pancakes, a good sign of a great restaurant is a: full parking lot and a timely wait. we experienced both, what makes out better is that we're waiting to be seated and droves of people are still coming in to get a place in line.\n\nunfortunately we waited 45mins, i almost gave then a 3star rating for that alone but they redeemed themselves by giving our entire party of 9 muffins (free charge) before the even handed us our menus.\n\nservice fast, customer service (good) especially race day.  egg works got hit w/ a double dose of racers that day (badass dash @ southpoint and the color run in henderson) and yes we all got in our cars for good pancakes.\n\ni don't like to go against the grain when dealing w/ pancake establishments, i go for old faithful: flapjacks, sausage and egg...hashbrown if i'm super hungry.  food came to the table steaming hot.  \n\nbuttermilke pancakes: nice and fluffy, kind of like an air fluffiness and big.  no sour after taste from the buttermilk, actually i could've ate the pancakes w/o the syrup.   really though, who eats pancakes w/o syrup???? shenanigans ok back to the air quality pancakes, the pancakes soak up the syrup um yea - <mark>Deli</mark>\n\neggs and sausage: no big wow factor here, eggs not runny, good color, fluffy. (ok so i cannot stop using the word fluffy to describe this food) but the eggs were fluffy! ;-)  just a regular sausage pattie.\n\nif i find myself on this side of town again around breakfast time, then i will definitely drop in for some pancakes.\n\n\nfyi: no split check, if you're coming w/ a large group i suggest you come w/ cash or designate that one credit card person that will pay and then reimburse them.\n\ntry it out, you'll be surprised!", 
            "big portions! check in on foursquare and get a free muffin (which came right out of the oven and was <mark>Deli</mark>!). you certainly get a generous plate for the price. great breakfast kitsch. the menu is made to look like a newspaper. super laid back feel. \n\nnot a huge egg fan but there was still plenty to order. i got the strawberry cream cheese french toast, which was almost sickeningly sweet. would definitely try something different next time. my friends really enjoyed their skillet and omelette though.", 
            "typical american diner.\nnot my cup of tea.\nwas edible not <mark>Deli</mark>.\nservice was so attentive it was almost oppressive.\nthis is not the place to go for a quiet, relaxing breakfast.\ni had the veggie benny and was disappointed, as usual.\nit still baffles me why americans can't figure out hollandaise sauce.\nit's not that complicated people!\negg yolk, butter, lemon.", 
            "great place for breakfast if your real hungry (the food is rather heavy).  i had the mushroom & cheese omelet this morning, was pretty good.  the seasoned potatoes were so so, kinda dry but edible.  the banana muffin was moist and <mark>Deli</mark>.  despite it being rather crowded, service was great, staff was frendly and we didn't have to wait long for a table, love that!  it can get rather loud so if your looking for a quiet place for breakfast, probably not the best choice.  we didn't mind the noise a bit, probably cause we were one of the tables being loud ourselves, hehe.", 
            "heck no techno.\nnot only is it beyond busy (can't really imagine why), the staff was not helpful, orders were wrong, and the food was forgettable. \n\nthis was such a let down. i was running late to a group breakfast with my parents and another couple, i told my mom to order for me. without looking at a menu, i just said to get a reuben.\n\nwhen i got there, my food was waiting for me, and everyone was eating besides my mom. i guess that the waitress had gotten the order wrong, and my mom was waiting for a new plate. my mom said that i would be arriving later, and my plate arrived early.\n\nas i tried to eat my (cold) sandwich, i asked for some thousand island and water.\n\nwhile we were eating, a different waitress comes and says, \"i was told to bring you a muffin.\" \n\nnot, hello, i have a muffin for you. or, did someone need a muffin?\n\nshe sounded unhappy to be handing out <mark>Deli</mark> muffins. how can you be grumpy when you are handing out bomb muffins?\n\noverall, overpriced, bland, mushy food.\nthe fries were good though.\nthis is also the 2nd time that orders have been wrong for my parents. not cool.\n\nthanks but no thanks.", 
            "<mark>Deli</mark> food. our waitress , donna was fantastic. from phoenix visiting with my boyfriend. had a blast. i had the \"egg-italiano\".", 
            "this was my first time visiting egg works on sunset. the service was great and it had a fun atmosphere. we all ordered the veggie benny, mine came with an egg shell in it. the shell itself was pretty big. i was hesitant to tell the server because i hate com<mark>Plain</mark> but my group insisted that i did. she was super wonderful about it. she comped my meal and gave me a free muffin (it was <mark>Deli</mark>). unfortunately, i did get sick shortly after breakfast. i feel like the sickness was more of a result of my sensitive stomach than anything the restaurant did. i would have given 5 stars for service and food quality. i deducted a star for the shell and getting sick afterwards. i'd totally try it again though!", 
            "there is a huge menu. lots of omelets, crepes (crepes are made witha very thin layer of egg), waffles, sandwiches, and more. i started my meal with a banana muffin. it was large enough to be a meal by itself. moist and very <mark>Deli</mark>. they accommodate changes in the menu items including half orders, egg whites only, etc. service is  consistently friendly. highly recommended.", 
            "just got done eating the most <mark>Deli</mark> veggie benny at egg works. i can never eat breakfast anywhere but here. there food is always so scrumptious and there staff is super friendly. speaking of staff, donna is quite the wonderful waitress. she was fun and attentive to our needs. we didn't even have to wait for a refill. i can't wait to come back next weekend.", 
            "mariia, our amazing waitress, served my crazy family of 8 this morning! she was absolutely patient with us and got all orders right despite 8 people asking questions all at once and talking over each other! the food was amazing as well, i got the chicken enchilada omelette and a waffle with whip and strawberry on the side- super yummy- and gave me two teas without me having to ask since i couldn't make up my mind. but anyway, she accommodated us from the beginning to the very end. always a <mark>Deli</mark> trip at egg works! :)", 
            "when my parents come to visit from california, we always go here for breakfast.  the service was impeccable, and the food was <mark>Deli</mark>.  donna, our server, was friendly, knowledgeable, and helpful with suggestions.  the wait to get a table was about ten minutes, but on a saturday morning, that's not too bad.  the food came quickly, and everyone loved their meals.", 
            "we love this place and come almost every week for a nice weekend breakfast. most recently or server donna made or visit a <mark>Deli</mark> with her great service and bright attitude. we always recommend a trip here for breakfast and laughs. get the veggie benedict or chicken fried steak. yoy won't be sorry.", 
            "donna is the best server ever!! the food here is <mark>Deli</mark>. awesome banana nut muffin!", 
            "egg works is probably the best breakfast restaurant chain in town. we usually go to the new one on eastern near seven hills. this one is pretty much the same in quality service and excellent food. \n\ndonna was our server and always close by to check on what we needed. we never had to wait long for refills or anything else. we might have to start coming to sunset over eastern because donna was so great. \n\nwe had different omelettes today and both were <mark>Deli</mark>. the potatoes are always amazing even though i'm usually a hash brown guy. won't stop coming to egg works.", 
            "i always leave happy and satisfied. food was <mark>Deli</mark> my servers name was donna, she was fast and very nice.  \n\nmust try this place!", 
            "the food is <mark>Deli</mark> and the best part is donna, our server:) she has a very pleasing personality and very attentive to her customers.", 
            "i always love this as a treat to myself.  it's a quick solid go to for a good hearty breakfast.  i almost always go here alone and just walk immediately to the breakfast bar.  quick service and within seconds i always get my own carafe of coffee.   \n\nfood is always pretty solid here.  aim more for the omelets though.  i've gotten waffles and pancakes here and they're fine.  but you'll probably forget what you ate after about an hour because they didn't leave an impression.  my go to favorite though is the chili rellano omelet.  my mouths watering now just thinking about it.  slap some hot sauce on that bad boy and you got this cheesy, chili, egg, spicy piece of <mark>Deli</mark> in your mouth.   i always go to work and brag about what i ate after that sucker.\n\ngive this place a go.  solid service and decent food.", 
            "my boyfriend and i love this place. we go here almost very sunday. we always get seated right away and all the servers are very attentive to our table. today we had the lovely donna as a server. she was an absolute <mark>Deli</mark> even though she was super busy she made time for us. good luck with disneyland donna!", 
            "amazing! excellent service and great healthy clean food donna did an amazing job helping us choosing our <mark>Deli</mark> meals i will come back!", 
            "amber was our server, she was excellent!  blackened prime rib benny was <mark>Deli</mark>, my boyfriend got the stuffed french toast which was amazing. we were greeted and seated promptly, coffee pot on the table for easy refills.  wonderful meal.", 
            "this place was awesome!  thank you donna! you were so pleasant and had a great idea with the veggie omelet & broccoli. <mark>Deli</mark>!", 
            "three of us had breakfast on tuesday. donna gave us excellent service. she seemed to be one step ahead of our needs. the food was <mark>Deli</mark>. we can always count on consistent and <mark>Deli</mark> food at egg works.", 
            "<mark>Deli</mark> breakfast fare served fast. the complementary bran muffin for first time visitors was just right. our server donna is amayzing, too!", 
            "i have gone here twice in the last week already, and although they are always busy, they try their beat to seat you right away. both times that i have went, the wait was no longer than ten minutes. their banana but muffin is hands down the best muffin ever. so is their country fried chicken skillet, waffles, pancakes, & island plates. my husband and i are trying to make this our monday morning regular place to go to till <mark>Homemade Soup Of The Day</mark> we grow old together. love this place and their <mark>Deli</mark> breakfast/brunch foods.", 
            "last week i moved to vegas. i didn't think the people here were going to be very friendly but my first time to a restaurant changed all of that. \n\nmy server donna was the best. i am from the east coast and people are very different then in vegas. she was so fast and i never had to tell her at all to get my refills or anything. she was on it!\n\nshe made me feel like i have lived in vegas my whole life. she recommended to me the works patatoes and <mark>Deli</mark> they were. i will be back every weekend from now on! thanks donna, and egg works!", 
            "donna was our server today, she always makes our visit to egg works even more enjoyable. she is quick, efficient and friendly. donna goes above and beyond to make sure her guests are happy. not to mention the food here is always <mark>Deli</mark> and fresh! thank you donna!", 
            "i travel a lot, and dine in a wide variety of places from fancy to dives. this place was spot on. food was good, came quickly and the variety for breakfast was amazing. from crepes, benedicts,  omelettes, srambles, and standard fare, everything was <mark>Deli</mark>. our server was phenomenal and absolutely on top of it. we didn't have to ask for anything from extra napkins to water to the check.", 
            "love it here! we sat down and our server donna came right away. service was great and food came within 15 minutes. service definitely makes breakfast dates, especially so early in the morning. our server was very attentive and sweet. country benny was <mark>Deli</mark> as always. my boyfriend had the cheese enchilada ranchero and pretty much licked the plate clean!", 
            "visiting for the weekend and decided to stop here for breakfast before heading home. \nmy fianc\\u00e9 had the 3 pigs omelette and he said it was <mark>Deli</mark>, \"like a party in my mouth\". i had the short stack with a side of scrambled eggs and the works potatoes. that too was <mark>Deli</mark>. at first it may seem like it's a bit pricey but when you see the portions, you'll understand. \nour waitress, sarah, was great. friendly, attentive and helpful, as was the rest of the staff. we are definitely coming back on our next trip to vegas!", 
            "i wrote this place off as being just another breakfast spot for a while now but this was out first stop today! and man was it the right choice!!!! its my new favorite breakfast spot.\n\nthe omelets are stupid huge and comes with a mountain of potatoes.  both of ours where perfect and they come with <mark>Deli</mark> banana muffins ( some came home with me). i cant wait to try there banana nut french toast next time. \n\nwe shared a plate of the pancakes, there not bad but they just didnt seem all that spectacular but in all fairness we where already stuffed when we got to them. \n\nour server ashley was amazing! its hard to find some one who is excellent at there job and still fun. \n\noverall its a little on the spendy side for breakfast food but the quality and the service justify it. we will be back!", 
            "the parking lot was full i thought for sure we were going to have to wait.  to my surprise we were sat immediately.  i has the veggie works benny.  <mark>Deli</mark>!  my hubby had  the works skillet he liked it a lot too!  we love the service!  great place!", 
            "christian was our server. very nice, respectful, funny, and knowledgable. \n\ni ordered the corned beef dish and it was by far the most <mark>Deli</mark> dish i have had for breakfast (it was a special skillet not the omelet) \n\ni will dine here for life!", 
            "food was <mark>Deli</mark>, seriously the strawberry cream cheese french toast made me pre-cum.  and my server donna was exceptional.", 
            "plenty of choices for breakfast. stuffed french toast and las vegas omelette were <mark>Deli</mark> with plenty to take home. our server perry was  helpful,courteous and very patient. we will be back.", 
            "this place gets 5 stars hands down. it was our first time here. welcomed with a smile. our waiter was eden and he was so nice and offered suggestions. he was very honest too. i asked what his favorite thing on the menu is and he said sundance special or bacon avocado omelet. i got the sundance and added avocado to it and boy let me tell you.... off the chain!!!! eden was so friendly and patient. they're salsa is <mark>Deli</mark> too. they care that your food is perfect too. if it's not right they take it back and make it perfect. eggs any way you can imagine. they hold true to they're slogan... eggs-actly what you want!!!! i'll definitely be coming back my next time in vegas!!!", 
            "sorry, but if you don't like egg works you are probably the type who would boo santa claus and throw eggs at the easter bunny.\nwhat is not to like about this place? the food is exceptional (and huge servings) the staff is a <mark>Deli</mark> (thank you luann) and it's easy to get to for dumb tourist like us who get lost in the shower.\nenough said. just go there with an empty stomach or you may be sorry.", 
            "absolutely <mark>Deli</mark>!!! first time visitors get a free banana nut muffin and it's so warm and soft. my wife ordered the stuffed french toast which also comes with a side of potatoes.  her plate was huge and of course wasn't able to finish it. i had the country fried skillet, i almost wished i would've gotten a half portion but didn't know it was an option until i overhead another waitress mention it. it was definitely amazing though.  i added the red hot sauce that is on every table and daaaaaamn.... excuse my gangsta but that shit was amazing!!! definitely will come by next vegas trip!", 
            "granted i just got off a 6 hour flight from hawaii, but i wasn't so jet-lagged that i could not help noticing the hostess on 11/01/14, circa 0930 hours, so obviously discriminating against us. \n\nupon being led to a 2-seater table in the middle of the walkway in the restaurant, i politely asked if we could sit in a 4-seater on the side of the room. the restaurant was not filled. the young brunette hostess told us that she is \"not allowed to seat 2 people in 4-seaters on a saturday morning.\" being that i was with my 78 year old non-confrontational asian mother, i did not persist in asking for another table. our server was very sweet, as all the servers have been in my past 4-5 visits to egg works. \n\nas we filled our stomachs with hot coffee, i became more and more lucid and then noticed that the 4-seater tables to the left of us and behind us had two people at each of them. i then observed miss hostess bringing another couple to a 4-seater across from me. the restaurant never filled up while we were there. \n\nyeah, the banana muffin is pretty <mark>Deli</mark> after a long plane ride, but i'll think twice about going to this egg works next time i'm in town and go some place else--hopefully, where i'm treated like everyone else.", 
            "it was my first time here, and oh boy! i enjoyed everything!! \n\ni order the chile relleno omelette and it was <mark>Deli</mark>. our server edan was very attentive and friendly.\n\ni will definitely come back to this location!!", 
            "do not miss out! this was the best breakfast meal that i had all weekend. i wish i had an egg works where i lived. the potatoes were well seasoned and the eggs were cooked to order. dont miss out on the banana muffin either its <mark>Deli</mark>. \n  the service was great. our server was brady, he had a great attitude and was attentive. he took the time to check in with us  to see how the meal tasted and to make sure we had everything we needed. the restaurant uses a yellow egg/black egg system that alerts all servers that some sort of attention is needed at the table. this is a very helpful way making the restaurant more efficient and an overall better experience. i will absolutely return and tell everyone i know how eggs-cellent this place is!", 
            "first time here for me. i got the country fried steak and my fianc\\u00e9 got the pork carnitas which was highly recommended by our server candice. everything from the moment we walked into the door till we walked out was amazing and <mark>Deli</mark>. besides the awesome food we also had an awesome server. candice you the best.!!", 
            "our server brady was super nice and attentive. he made breakfast fun! \nthe banana nut muffin was <mark>Deli</mark>.", 
            "my family loves to visit egg works whenever in vegas. the banana nut muffins are <mark>Deli</mark> and the loco moco hawaiian style breakfast was so yummy. everyone that works there is very nice and helpful. our waitress donna was very friendly and gave us great service.", 
            "awesome every time i go.. fast friendly service...food is <mark>Deli</mark> chili reano omelet awesome...", 
            "fabulous find. i followed other reviewers and got the stuffed cream cheese strawberry french toast. it was a huge portion and so <mark>Deli</mark>! i also love they left the coffee pot on the table so i didn't have to wait for a refill.", 
            "<mark>Deli</mark> food and as always fast and friendly service from donna!  great local breakfast place!", 
            "everything here is <mark>Deli</mark>! waffles are great. their toast is buttered for you. the banana nut bread is a must have. and the potatoes are diced nice and bite sized with great seasoning. great breakfast option, especially since it's better than ihop and the lines are shorter", 
            "donna our server was amazing! i love this place and always enjoy eating here. make sure to ask to sit in her section when you do come to enjoy the egg <mark>Deli</mark>.", 
            "breakfast is the most important meal <mark>Homemade Soup Of The Day</mark>. and in our valley, it seems that really good breakfast joints aren't as abundant as one would like. egg works happens to be one of my favorites due to their friendly staff, comfy atmosphere, and most importantly, their fantastic selection of breakfast goodies. their menu can be daunting to those of feeble breakfast tastes....but to a true breakfast maverick like myself, it is always a joy to peruse the menu on your hunt for a bellyful of wonderful. and you will get a bellyful. large portions abound, from the fresh made muffins, to the skillets, omelettes, and all the other egg creations. larger parties may have to wait to be seated, but good things come to those with patience. for those without, there is a fine mcdonald's in the same parking lot. my latest trip there was last week and donna was our server. she was spot on with getting my coffee, and although my dining companion was a bit tardy, she kept checking on me while i waited and enjoyed their <mark>Deli</mark> morning brew. once my  cohort arrived, we ordered and were served our <mark>Deli</mark> meals shortly after. halfway through, my buddy realized he didn't get his muffin. we asked donna as she passed by about it and after a quick apology brought not one, but two muffins. one was consumed, and the other was taken home for a latter morning treat. kudos to you, donna, and your fine establishment.  :)", 
            "ashely was our server and she was amazeballs. she was attentive, friendly, and on top of her game. the food was <mark>Deli</mark>, as usual. the restaurant was clean, patrons were happy, and staff was great.\n\nwhen you walk in, make sure you ask for ashely!!", 
            "egg works was just as i suspected and up to my expectations of providing great country hearty style breakfast. to top it off ashley was my waitress and she is awesome and was a <mark>Deli</mark> to conservate with and beautiful to look at. see you next time ashley, thanks!", 
            "awesome breakfast and brunch place.  we had our family reunion in vegas, so there were 31 of us.  they didn't take reservations on sunday, but they were very accommodating for 8:00 am and a party of 31.  the service was awesome, our server, she was so personable and on top of things, a real pro!  their egg dishes are humongous, 4 eggs!!  and a lot of <mark>Deli</mark> sides.  the <mark>Chocolate Chip</mark> pancakes were a hit as was the waffles and all. of their egg dishes, their scrambles and egg combos are <mark>Deli</mark>. sis had the egg crepes, too yummy and big. such a diverse and large menu, you will be sure to find something!  the seasoned potatoes were awesome.  great restaurant, great service and awesome wait staff!", 
            "we waited less than 5 minutes during a peak hour. the food was <mark>Deli</mark> and the menu had a ton of different choices. great service.", 
            "the potatoes here are addictive! the seasoning on it reminds me of doritos chips, maybe that's their secret flavor! the waffles are like chinese eggette desserts - very fluffy. i always get the veggie omelet which is always 2x more food then i can devour, but is <mark>Deli</mark>, fresh and gets my day going. my friends have tried some of the skillet items and other omelets (such as \"the works\") and they weren't as satisfied with those. the prime rib benny (grilled croissant with blackened prime rib) is really good too or the corn beef hash if you want something heavier. \n\nwait time on a saturday morning (~10am) was about 20-30 minutes.", 
            "love this place! we come here weekly. food is always <mark>Deli</mark> and the service is great. highly recommend the cordon bleu skillet.", 
            "first time here and donna brought us some warm <mark>Deli</mark> banana nut muffins as a welcome. best i have ever had. then had a great omlete made the way we needed it because we are on a diet. looking at other tables it all looked <mark>Deli</mark>! donna thanks for being such a great server! will come back when we come back to vegas!", 
            "still amazingly <mark>Deli</mark>!  just ate at the sunset/eastern location in henderson - donna was our server, and the food and service was impeccable as always! thanks egg works!", 
            "first time here and donna made me feel so welcome and provided excellent service!  <mark>Deli</mark> food as well!", 
            "donna is the sweetest human being alive and if you want to see serving excellence, come see donna.\nps, the food was <mark>Deli</mark>!", 
            "<mark>Deli</mark>. been eating here for years. i could eat here 7 days a week and be happy. four stars because over the last few years the service has gone down a bit. for some reason it's hard to get your food served all at once (pet peeve of mine, you order all together, you should get the food all together). but the food is so amazing i forgive them every time. of course the skillets are amazing, but try a salad! they're huge and fresh and <mark>Deli</mark>!", 
            "the food was so <mark>Deli</mark> like always! shout out to our server donna!!!! you were great! thank you for the great service!", 
            "our server ashley was amazing! the food was <mark>Deli</mark> & the server was courteous enough to make me a special omelette that wasnt on the menu! great  service!!!!", 
            "i just left here feeling content and satisfied. candace was our server and took care of us well. i asked our friend in las vegas to take us the best breakfast place she knew of and she took us here. i ordered the chile relleno omelet and cinci  coney dog and those were <mark>Deli</mark>.\n\ni highly recommend this to others.", 
            "my husband and i try to eat here at least three times in the year. ashley was very helpful and convinced my husband to try <mark>Homemade Soup Of The Day</mark>'s special, which was <mark>Deli</mark>. pretty much any form of the eggs benedict is amazing. also, the banana nut muffin.... take a whole loaf of the banana nut bread with you!", 
            "this place is cute! the food was <mark>Deli</mark>, they are very generous with their cheese and they melt it all the way though, as melty cheese should be! the portion sizes were just right. our waitress was chelsea, she was very perky in an inviting way, that makes you feel right at home, and she took very good care of us. i give it 4 stars only because it is no, \"hash house a go go.\" it is by far one of my favorite family owned restaurant experiences. the staff was the friendliest, they have unique & <mark>Deli</mark> food with a large variety on their menu, and are extremely clean. i live in orange county but will definitely be back when i'm in town visiting.", 
            "breakfast was outstanding! i had the mashed potato omelet, which was <mark>Deli</mark>. the service from donna was awesome.", 
            "get the works skillet! everyone here is so upbeat great way to start your day. chelsea was or server and she was amazing, she got me the perfect fruit plate for my picky self and had our order taken within minutes and our food was <mark>Deli</mark>!", 
            "<mark>Deli</mark>. donna was an awesome server and worked really hard! our only com<mark>Plain</mark> is the fried potatoes are really salty and over-seasoned. we had a really great breakfast otherwise and it was a nice little gem off the strip.", 
            "my family and i love coming to egg works! the food is always <mark>Deli</mark> (especially the works potatoes) and the service is great too! my most recent experience was amazing. our sever donna was very personable and quick with service. she made our morning! this restaurant is definitely a regular place for me and my family to come and enjoy good food and good people.", 
            "perfect go-to breakfast spot on a sleepy sunday morning.  food is always <mark>Deli</mark>. our server donna made our family breakfast a fantastic experience!  her warm, spot on service made our <mark>Deli</mark> breakfast even more wonderful!", 
            "everything was <mark>Deli</mark>! had the sunrise omelet with a mimosa, while the boyfriend had a reuben sandwich with a bloody mary.  candice was our server and provided excellent service. hope this helps her win the trip to disneyland!", 
            "got the stuffed french toast and it was a glorious helping of <mark>Deli</mark> breakfast food. my girlfriend got the <mark>Waffle Works</mark> with <mark>Banana</mark> and whipped cream which was also excellent and was consumed before i even started my second slice of french toast (hint: it was super good) the service was great jon was our waiter and he met out every need. better than ihop, denny's, etc... leslie knope would say: \"maybe not better than jjs diner but pretty damn close.\"", 
            "the food here is <mark>Deli</mark> ! my bf & i been here before couple times. employees are always nice & friendly. our server jon was the best ! very helpful & went above and beyond. amazing service jon , thank you :)", 
            "just got finished having a <mark>Deli</mark> breakfast here at egg works. our server lisa was great. she should win a trip to disneyland she is an excellent server! actually everytime we come here we always have excellent service. keep up the good work here at egg works.", 
            "so far as always the food is excellent and i'm loving it. great company with my girlfriend here and our waitress adriana is fantastic she seems to always have a smile on her face.  food is great the service has been fast the coffee hot food is <mark>Deli</mark>", 
            "our 1st yelp failure. major yelp failure. so sad. quite possibly the worst breakfast we've ever had!\n\npro: <mark>Deli</mark> banana nut muffins. 1 son liked his eggs & bacon, but said potatoes were ok.\n\ncons: corned beef hash tasted like mushy cat food. are a few bites & couldn't choke down any more. potatoes are odd & over seasoned. husbands omelet was edible enough for him to eat 2/3, but he said it was just ok. kids pancake wasn't even good. :/ \n\nour kids asked if we could give it a \"0\" or 1/2 star. 1 star is for the tasty muffin...which was the only enjoyable part of our $40+ breakfast.\n\nsuch a bummer!", 
            "amazing food, great service, <mark>Deli</mark> banana nut muffin. must try this place if you haven't yet! -ashley was our server", 
            "we stopped here for breakfast before heading back home from a weeklong vacation in vegas. it is located right across the street from mccarran airport. we arrived at around 10am on a friday and the place was pretty busy, but we were seated right away. \n\nall of the staff was super friendly and welcoming. they were quick to get our drink order. coffee tasted fresh and was good. we chose to sit on the patio, but it was a little noisy because of the planes literally flying right over the parking lot, so low you could practically look in the windows and wave to the passengers. we thought that was kind of fun, but it might be really annoying for some people. \n\ntheir menu is quite large, with many, many options. any kind of egg dish you can imagine is available. i got the veggie benny and my husband got the mexican-style burrito. (i can't remember exactly what it was called, but it has chorizo). \n\nthe food came out promptly and looked and smelled incredible! everything was very fresh. my veggie benny had toasted english muffins, topped with grilled tomato slices, fresh sliced avocado, fresh spinach, topped with two perfectly poached eggs and a tasty sauce. i greatly enjoyed it. the potatoes served with it were really <mark>Deli</mark>, but a little over-seasoned. \n\nmy husband's burrito was large and the red sauce it was covered in looked like it was made fresh, not canned. he loved it. \n\nwe will definitely be back next time we are in vegas!", 
            "<mark>Deli</mark> breakfast! this place has a great variety of amazing dishes. really hit the spot and very affordable. outstanding service from jay. <mark>Deli</mark> pleasant and energetic attitude! definitely on top of his game. thanks for a great experience jay! we will definitely be back.", 
            "shantel is an awesome waitress! i had the chile relleno omelet, it was <mark>Deli</mark>!  will definitely come back next time i'm in town.", 
            "jay was our server he was awesome and made our 1st time experience here great!!!!!! food was <mark>Deli</mark>... \n\ni got the chile relleno omelet. boyfriend got the stuffed french toast we both enjoyed our meals. \n\noh! and the banana nut muffin so fresh and <mark>Deli</mark>!", 
            "the food was <mark>Deli</mark> especially the pancakes. prices were great. the drinks were amazing and the waitress was awesome. i would definitely recommend this to locals and tourists.", 
            "this place was recommended by my husband's friend. it's a bit far from the strip but will worth it. this will be a must visit when coming to vegas. i don't remember the name if the food of what we got but it was <mark>Deli</mark>.", 
            "great food. best service ever from donna!  \n\ni don't normally like banana nut muffins, but gave them a try since donna brought us one. they were <mark>Deli</mark>!", 
            "we sat at the bar on a busy sunday morning and shantel had the greatest attitude and awesome recommendations! i highly recommend this place if you have nothing planned after so that you can take a nap after the huge, <mark>Deli</mark> portions.", 
            "chelsea r. at eggworks on sunset was our server on 5/24 she gave very good service with a smile, food was <mark>Deli</mark> and served a lot faster than i thought it would be being that the place was packed thank you chelsea can't wait to come again!", 
            "waiter was hilarious (ray?) and offered suggestions. i got buttermilk pancakes with turkey bacon and scrambled eggs. the pancakes were fluffy and the turkey bacon was smoky, but they weren't anything spectacular. \n\nthe orange juice tasted like it was homemade. it was very <mark>Deli</mark>. \n\n2 other people got corned beef hash (mashed potatoes, corned beef, eggs, side of hash) and they gobble it up. my sister got portuguese sausage with eggs and sticky rice and raved about it.", 
            "i've been meaning to come here for a while, but never made it for one reason or another. i came for the first time today... i wish i had come a long time ago. the menu is amazing, i was overwhelmed. there are so many <mark>Deli</mark> options, for kids too.\n\ni had the works omelette, and i couldn't even finish it, and i know how to pack it away, ok? the potatoes are <mark>Deli</mark>. there are a lot of breakfast options, more omelets, skillets, pancakes and waffles than i can name, several different eggs benedicts, and omg they have loco mocos? i have to come back, i'm coming back! i'm gonna make it a point to come back every time i visit las vegas.\n\nand a thank you to our server jay for making the meal pleasant, and for making sure my 6- year old niece was happy.\n\nmake sure you have one of their banana bread muffins. they make banana bread french toast! my brain explodes just thinking about it.", 
            "egg works is always <mark>Deli</mark>!  we waited for awhile on sunday morning which is to be expected.  i think they could have more outdoor seating, or water availible for guests that are waiting so long. \n\nonce we were seated everything was great! i wish i saved the receipt as our waitress was awesome. \n\ni highly recommend the muffins!", 
            "maria our waitress was super. made a couple of recommendations that were just <mark>Deli</mark>. we split a mashed potato and bacon omelette and a chicken enchilada omelette. very very good. i was skeptical of the mashed potato omelette but it turned out to be ta awesome start of my day. coffee is good, service is lightning fast! highly, highly recommended.  this app is the best. a total necessity when traveling. in yelp we trust!!!", 
            "the best place to come for a <mark>Deli</mark> breakfast!! every time i come to vegas it's a must place to eat! great service and even better food. thanks for the great service marc!", 
            "eggs works was really good! the service was fantastic and the food was <mark>Deli</mark>! our waiter rob was so kind and astonished us with his hospitality and not to mention he is pretty attractive! thanks rob!", 
            "the service was top notch! matt did a great job serving us. my son devoured the banana nut muffin in seconds. super moist, super <mark>Deli</mark>. the potatoes were crispy and full of flavor. will be back soon!", 
            "we were wary of egg works because, as an extension of egg and i... well, it's just not the original, right?! well, immediately on being seated chelsea greeted us warmly, making us feel welcome. it's the same menu, but could it be as good?  i'm here to say, yes! the ensenada burrito (my first try) was awesome! eggs and carnitas, mmm! what made it though was the sauce... a perfectly balanced tomatillo sauce, not too vinegar-y; very flavorful. the service too was spot on, with perfect checks of our experience without interrupting conversation (a pet peeve of mine).  we will definitely be back. oh, definitely don't pass up their banana nut muffin! <mark>Deli</mark>! also comes in loaf form!", 
            "first time here and i was pleasantly surprised by the friendliness of the staff (jay is the man!) and the quality of the food - the veggie benny i had was <mark>Deli</mark>! i definitely plan to come back :-)", 
            "our first experience here at egg works. we had a <mark>Deli</mark> fruit plat that was very large. we split a <mark>Deli</mark> omelet. just great and the best of service from matt. matt is very personable and always on the watch for our needs. we will be back! new fans.", 
            "i tend to go back and forth between the sunset location and the rainbow/215 location but i have to say that the sunset location is probably my favorite! i typically go on sundays and there always seems to be seats at the bar or a very low wait time for seating. the food is always amazing, hot, cooked to order, fresh! the last few times i've gone to the sunset location and had a seat at the bar and are served by shantel. this girl is awesome, she's always so friendly and not afraid to start up a quick conversation. usually i request pineapple with my meal instead of the potatoes and now she always has that <mark>Deli</mark> chili lime seasoning placed on the counter without a hesitation! \nservice like hers will definitely keep me coming back and it doesn't hurt that the food is <mark>Deli</mark>!\n\nthank you :)", 
            "this was my first visit to this location.  i had been to egg and i on sahara and decided to come here for their bloody mary and breakfast.  it was <mark>Deli</mark> and alohalina provided great service!", 
            "we tried egg works for the first time today and we'll definitely be back. our amazing server, ashley was amazing right from the start. she brought out these warm and <mark>Deli</mark> banana nut muffins to start our day. \nher menu suggestions were on point and the food was big and classic american!\nwe live on the strip so egg works was a breath of fresh air from the high priced and minimalist breakfast dishes we're used to!\nbig thanks again to ashley for making our breakfast so great. she's mine and my wife's favorite server in all of las vegas.", 
            "this place is awesome! ashley was our waitress and she was so friendly and helpful! our groups got chile rellenos omelette, the works skillet, taco skillet, and banana pancakes and everyone loved it! the banana nut muffin was also <mark>Deli</mark>! portions are large, but i think you can halve the meals. can't wait to come come back and try everything on the menu!", 
            "i may not be so much of a morning person but i love breakfast! egg works definitely works for me. i enjoyed the country kind of vibe in this place. it was 12:30 in the afternoon and we were greeted with \"good morning\" and a newspaper as a menu. i thought that was adorable!!! i look forward to returning. the food tastes home cooked kind of <mark>Deli</mark> and the portions for sure will satisfy your tummy.", 
            "loved it everything is <mark>Deli</mark> starting from eggs to pancakes .\nservice is amazing .. candice was super we loved her", 
            "its a great place to eat. our server \"pk\" is awesome! very helpful. traditional benedict and stuffed french toast is <mark>Deli</mark>.", 
            "<mark>Deli</mark> food and friendly service from jay and the girl at the front (didn't catch her name..but she's pregnant). tortilla soup was <mark>Deli</mark>!", 
            "service was awesome. thanks ashley ;) food was <mark>Deli</mark>. definitely will be back. went to other location on sahara yesterday. this  one is much better. better layout. will go there for now on. here again today. just heard uou have loyalty app. btw, jessica was awesome too. ;)", 
            "the food is good here, but i'm mainly writing this because of the service. i've never been to a place that i thought was being run as efficiently as possible until this restaurant. \n\non a sunday morning we waited about 20 minutes for a table, but once you get your table they really keep things moving. our waiter took our drink orders right away and returned with them quickly. we ordered and again our waiter returned ridiculously fast with our pre-breakfast muffins. we barely had time to finish our muffins when breakfast arrived. while we were eating i saw the staff turn a table after a large party left like a nascar pit crew. the whole staff really hustles in the morning.\n\nthe actual menu is huge. they have everything from unique scrambles to pancakes to benedicts. the muffins they bring before the meal are both <mark>Deli</mark> and moist. i had the mashed potato omelet which has mashed potatoes, bacon, cheese, onions, and sour cream. it was yummy, but not the most exciting option they offer. my husband had the chili omelet with chili and cheese. this was definitely even better than my omelet very tasty.\n\nthis is a good spot if you like a hearty breakfast with unique options.", 
            "came in for breakfast, blueberry pancakes <mark>Deli</mark>, service perfect with ashley! my son had a <mark>Chili Cheese Burger</mark> with the works style, said it was the best <mark>Chili Cheese Burger</mark> he's had in awhile!", 
            "great spot! the chicken enchilada omelet was <mark>Deli</mark> with well seasoned potatoes. our server candice was great!", 
            "had a great breakfast. the food is always <mark>Deli</mark> and our server jay was great. he made our experience great and we enjoyed our time", 
            "the food and coffee was <mark>Deli</mark> . the banana muffin was also good.\ni ordered the pork carn ranch it was sooo good.", 
            "loved the food here!  great portions and our server chelsea was attentive and answered all of our questions.  i had the denver omelet with egg whites and it was <mark>Deli</mark>. my wife had the bacon and avocado omelet with egg whites and it was also awesome.  they also serve mimosas and bloody marys if you so desire. if you're looking for a great place for breakfast or brunch, look no further!", 
            "amazing variety on the menu and one of the best places to grab breakfast. we love it here. my favorite is the <mark>Vegetarian Crepe</mark>. <mark>Deli</mark>! the burritos are good and their diablo potatoes are amazing!", 
            "tanya is awesome! we sat on the patio today because we had our beagle. she brought out a milk bone and an actual dog dish with some water super awesome! anyway the banana pancakes were <mark>Deli</mark>! i added strawberries on top... it was perfection! \n\nalways great service and <mark>Deli</mark> food!", 
            "came here after seeing all the great reviews and was not disappointed. absolutely <mark>Deli</mark>. the potatoes are fantastic. i'll definitely be back when i'm in town.", 
            "this place is great. fast service and <mark>Deli</mark> food. sometimes there is a bit of a wait, but its well worth it. do yourself a favor and this this place out.", 
            "first time trying this place. the food is <mark>Deli</mark> and our server hector was awesome.  the potato's were fantastic and the portions are huge.", 
            "my girlfriend and i were visiting from san diego and saw this place had poppin' reviews so we stopped by! we were immediately seated, our server approached us quickly and brought out a carafe of coffee, and complimentary banana nut muffins, which was very moist and <mark>Deli</mark>. after we perused through their detailed menu we ended up getting a loaded omelette and the italian skillet. the portions are huge, and the food was <mark>Deli</mark>. the price is fair and the atmosphere is laid back. definitely coming back, next time i'm in vegas.", 
            "my friends and i came here for post-vegas recovery. the menu is gigantic and so extensive and everything sounds so freaking good! i decided on the veggie bennie because i love avocado and it was great. i asked for the hollandaise sauce on the side which was probably a smart move because the cup was huge! the breakfast potatoes are really good and seasoned perfectly, and the service was pretty fast. there's a reason this place has a line--because it's <mark>Deli</mark>!\n\ngreat place to come for brunch or breakfast with friends or family. would definitely return... i wanna try that banana nut french toast!\n\ncheck in to get the free banana nut muffin!!! it's worth it!", 
            "jamie our server was very friendly and service was fast. the homemade banana nut muffin came out warm and was <mark>Deli</mark>! even my husbands toast was better than the standard toast (the melted butter was <mark>Deli</mark>). the potatoes that seem to be their thing was just ok. the prices for our egg dishes were a little steep but our tongues were satisfied!", 
            "first timer and won't be the last!  i had the veggie benny, terrific.  and not to mention the service was eggcellent!  tonya was or server and just a <mark>Deli</mark>!  we will be back soon!         \n thanks egg works indeed.  oh, almost forgot, the best \"free\" banana nut muffin ever!", 
            "just had a wonderful <mark>Deli</mark> and quick brunch with friends.  great service and food and atmosphere.  i love egg works,  i go to many of the locations and they're all consistently <mark>Deli</mark> and everything is perfect.", 
            "went here for lunch today.  they were not even remotely busy yet it took over half an hour, almost 40 minutes actually, for the four of us to get two salads, a <mark>Bbq Chicken Salad</mark> sandwich and my denver omlette was <mark>Deli</mark> last!!!  almost 10 minutes after my friends were <mark>Deli</mark> their food.\n\nnot a good experience at all.  i will not be going back and i certainly won't recommend it to anyone.", 
            "glad to have found this place so close to our hotel. food was <mark>Deli</mark> and mariia was great! we really enjoyed our visit :)", 
            "this place is ridiculously good. our server's name was christopher and he was probably one of the most attentive servers i've ever had while not being overbearing.\n\nchristopher recommended the santa cruz skillet to my fianc\\u00e9 and it was <mark>Deli</mark>. i had a mashed potato omelette because people on yelp seemed to like it but it's not my cup of tea... but it was still <mark>Deli</mark>.\n\nbonus points: the banana nut muffins are incredible here!\n\n:)", 
            "great service!  our server was eden.  \nalthough we kept our egg sign on its \"i'm good\" face, eden still checked up on us without over doing it.\n\ncoffee is all you can drink for 2.75 which me and my girls all shared (stated on the online menu)  and they give you a ton of caramel machiatto <mark>Deli</mark> creamers which i ended up taking the last for that was left.\ncome to think of it i don't think we were charged for that. \n\ni like that while we were waiting for our entree eden brought us out the homemade banana nut muffin.  (so we were told, if its your first time its free or its a side of your choice) or for you yelpers check in for a free muffin. ;)\n\ni ordered the sundance special... omg! it was soooooooo good! $13+\na veggie omelette w/ spinach, mushrooms, artichoke, swiss cheese and topped with feta cheese and fresh tomatoes.  i even added avocado to it..... writing this is making my mouth water!  this dish would have been great for two, but i was able to finish it myself since it was a social event with my girls i kept stuffing this belly.\ninstead of potatoes, i asked for rice and l left 1 scoop of rice behind.\n\nthe girls had groupons which they had to pay separately.\nfrom an even $50 bill, we paid a total of $13+!!!!!!!!!!!\n\nhell yes to us!\n\noh and we got there at 8:30am - 10am it wasn't too busy at all even on nevada day.", 
            "awesome breakfast place. lives up to their good reputation. tables for two there was no wait for us even as late as 9am. service was prompt! food came fast and was <mark>Deli</mark>! excellent experience. \n\nwe love that they have these cute little easier to help staff know whether we need service. we flipped ours for fun after quickly choosing from the menu, and our server ashley jumped even quicker to take our order. best prompt and cheerful service we've received in a while!\n\nyou rock, ashley!", 
            "came for some breakfast with my lovely girl friend. she had the traditional benny. i had the sunrise mountain. both were very <mark>Deli</mark>. the potatoes were great. i loved the seasoning. last but not least... ashley! she was our server and did an amazing job. she was very attentive and had a great attitude. she put smiles on me and my girls face. i shall definitely be back!", 
            "we have officially lived in las vegas for a year.\n\nhow have we never been to egg works before now??\n\nwe literally live right down the street and we drive by this location almost every single day. i'm honestly ashamed of myself.\n\nnow i have seen this place on a weekend and it is crazy packed! but, being a tuesday mid morning we were seated right away and it had a decent flow of customers.\n\nmaya (our wonderful server) came and greeted us right away. one of the things that stood out to me the most about our entire experience is that everyone working there seemed genuinely happy to be at work. everyone was bubbly and all smiles and it definitely made for a great dining experience!\n\nthe hubby ordered the chile relleno omelet and i had what i would describe as being their personal take on biscuits and gravy.\n\neverything was <mark>Deli</mark>! we especially loved their potatoes, they had a wonderful seasoning with a light kick!\n\nanother major bonus is when you check in on yelp you get a free banana nut muffin! so moist and tasty!!", 
            "love this place! great food and service! when were in town we always make it a point to come here. everything on the menu that we have tried was really <mark>Deli</mark>!!!!", 
            "i've wanted to eat here for the longest time, and i finally made it out. i must say, i definitely wasn't disappointed! our wonderful server, donna, gave us a couple (<mark>Deli</mark>!) complimentary banana bread muffins after finding out we were first timers, which i thought was awesome. i had the works skillet, and it was beyond amazing. the mix of all the delectable tastes together created a perfect dish! and my boyfriend very much enjoyed his waffles. i think we found our new breakfast place!", 
            "after a morning of early travel, once we got our rental car we yelped to find a breakfast spot since we were starving!  yelp did good. there was a slight wait and we sat the bar. shantel was our server and was awesome. i always judge good service by not having to ask for a refill, which i never had to with her. she also made a good recommendation for their green salsa which was very <mark>Deli</mark>!  i had the corned beef hash and husband had an omelet. we also split blueberry pancakes - yummy! the meal totally hit the spot. it's a cool atmosphere and doesn't feel touristy (even though we were-lol). we will most definitely be back the next time or even again on our trip.  it was eggs-cellent.", 
            "awesome place to hang out with family, child friendly and very helpful staff, everyone was so nice! and the food is <mark>Deli</mark> of course, the best part? they make it exactly how you want it :).", 
            "*donna donna donna- our server who was lovely! *\n\ni ordered the prime rib benedict and i found it to be a 7 out of 10. conceptually the components were all <mark>Deli</mark>. the bread was lightly toasted, the hollandaise sauce was as it should be rich with a mild zest. the meat was savory but i found all of these ingredients together kind of washed each other out. oh and my egg was poached perfectly. next time i want to try their country benedict. \n\nmy boyfriend had the beef style club burger and i can't speak to how it tastes but i was told it was also savory and nicely cooked. \n\nnow on to our service.... donna was our server and even though this place was packed she checked on us regularly. she was lovely, friendly and genuinely interested in making our first visit here a good one. can't wait to come back again and try another of their breakfast masterpieces.", 
            "egg works in henderson is our favorite breakfast place.  <mark>Deli</mark> food, and great service from donna!!!", 
            "eggworks is incredible and satisfying in every way, i came here twice before i reviewed, and i know third time will be a charm! everything is <mark>Deli</mark> and fresh and service is excellent.  candace is such a sweetheart, attentive and on point with any questions or things you need , i asked to be in her section and was quickly accommodated.  i'm sure all the servers are awesome but i will continue to be in her area, thanks candace (i vote for candace for disney trip!) banana nut muffins are stinking <mark>Deli</mark> you must have them, and know that you can choose a half order for those of you who a full plate is too much.  highly recommended. thanks eggworks for handing out those free kids meal to the schools because that's the reason we started coming here and will continue to do so.", 
            "we were seated and served quickly. our avocado omellette, banana nut muffin and french toast was <mark>Deli</mark>.  the female server was professional and prompt. no com<mark>Plain</mark>.", 
            "this place offers a great selection of <mark>Deli</mark> different breakfast dishes (and sandwiches) along with the standard fare. my wife and i enjoyed the very good service with no surprises. i thought the potatoes they offer are good, but my wife prefers a different style than what was offered. the coffee was merely ok. they must be doing something right because it was obvious from the crowded parking lot they are popular and busy. enjoyable change!", 
            "our server christopher is friendly and quick with the service. definitely coming back here again!  the food was <mark>Deli</mark> and good portion to share!  came hungry and now leaving with an extremely full tummy."
        ], 
        "dish_name": "Deli"
    }, 
    {
        "text": [
            "very nice place and wonderful service. the food here is excellent. their <mark>Works Egg Salad</mark> sandwiches are yum. i highly recommend"
        ], 
        "dish_name": "Works Egg Salad"
    }, 
    {
        "text": [], 
        "dish_name": "Chicken-apple-walnut"
    }, 
    {
        "text": [], 
        "dish_name": "Bacon, Lettuce, And Tomato"
    }, 
    {
        "text": [
            "for a few years, this has always been a favorite of mine -- however --- that changed yesterday. here is my account:\n\nservice is always great. if this were just about the service it would be a 5 star rating. my favorite waitress, candice (enter into drawing) is off on tuesdays so i was served by dolly. dolly is another of many friendly and bright eyed servers with an ear-to-ear smile.\n\ni ordered the \"<mark>Works Burger</mark>\". the first problem was that i was not served one. i'm not really certain which burger i received, but it was not a \"<mark>Works Burger</mark>\". it did have the swiss cheese i selected, and the grilled mushrooms & onions. however, it was missing the bacon! oh no! not the bacon!\n\nthe second issue was that i ordered \"medium\" and this burger was \"well done\". initially i would assume the wrong item was removed from the window, but i will still hold this against the rating as burgers are all served extra-rare or well done. there is no middle ground in this restaurant, so if you want anything in the range of rare through medium well i recommend you not order a burger. (this has been an on-going issue for some time now). also, the bottom of the bun was so soggy i felt it had been dropped into a sink. it was only 1/8\" tall as it was squished down from the burger.\n\nlastly, i have issues with the consistency of their food. some days the <mark>Works Tuna Salad</mark> is dry. other days it is runny mush that even the biggest fan of mayonnaise wouldn't swallow. this holds true for many items, and on this visit the potato salad was so full of mustard i couldn't eat it. bright yellow like an egg yolk.\n\nas a side thought, i will not complain about my food in the restaurant. dolly checked back a few times -- but it was my choice to not tell her about my issues. i won't say that i am not returning (pardon my double negative), but burgers are 100% out of the question."
        ], 
        "dish_name": "Works Tuna Salad"
    }, 
    {
        "text": [
            "i had low expectations for this place to be honest. the name and location itself seemed a bit... eh? but after walking in and ordering omg this place is amazing! the food is <mark>Deli</mark>! my friend and i shared the <mark>Grilled Veggie Pesto Sandwich</mark> with fries. the sandwich had grilled bread, veggies and was soooooo freaking good! though i probably couldn't finish a whole one i want to damn sure try! the fries were crispy shoe string fries and seasoned! yum! my friend and i were full and satisfied. i would definitely come back."
        ], 
        "dish_name": "Grilled Veggie Pesto Sandwich"
    }, 
    {
        "text": [
            "who would have thought a place named egg works would have tasted so good. i came here because my dad kept telling me to try this place out, since we were always in the area.\n\nanyways, we went there about 10am and the place was packed! we had to wait for a table that seated 4adults and 1 child, which was about 25mins but that was okay, we had plenty of time to chill outside. we were finally called in and the waitress was pleasant. my bf and i, were still thinking of what to order while dad and cousin already knew what to get. we decided to just share a plate that had fresh corned beef, option of getting that or the canned version (no thanks, fresh is always better), my dad got i believe the egg combo?? i could be wrong i forgot the name. he got a half serving because they have half servings there which is a plus because i don't eat much.\n\nas we were waiting, we seen this egg shape happy face at the end of table, my cousin ex<mark>Plain</mark> to us that there are two faces, one sad and one happy. if you need service you would just flip the happy to the sad face and a waitress will come over. as he was showing us, i kid you not like 2secs later a waitress came by and ask if everything was okay. i was impressed but we just simply told her that we were just curious of what that was. \n\nour food came, it was <mark>Deli</mark>! i tried some of my dads food and it was really great. i liked mine more because my filipino side loves corn beef canned or not ha ha. my cousins daughter had a fresh banana muffin and of course we stole a piece from her when she wasn't looking because she will not let that go, and that was really tasty. of course being such \"tourist\" we decided to take a pic of the egg and flipped it once again and 5secs later the waitress came up and asked what was wrong. still so amazed on how quick she came again! \n\nthe food here is great so try it out (it doesn't hurt to try right?) and the service was just as great. i like this place and would definitely come back again.", 
            "i am a glutton by nature and the way that egg works ii does breakfast only fuels my sinful constitution. the week before my birthday, i tend to go on a strict diet in preparation for the voracious appetite to come. out of the blue, the craving for eggs benedict manifested, so i succumbed. it was the first time in five years that i have even thought about ordering this dish, so i did my research to find a combination that would best suit my personality. \n\negg works happens to have the veggie works benny with grilled tomatoes, spinach, avocado, and two poached eggs smothered in hollandaise sauce. i almost got this, until i saw the blackened prime rib served on a grilled croissant with sauteed spinach, bell peppers, and eggs covered in the same decadently rich dressing. i could not resist and why should i? the  huge portion was served in a skillet with a a few slices of fresh fruit and home fries. the potatoes are well seasoned and crisp. i started by saying i would only eat half of them and soon the whole side was gone. the eggs benny was <mark>Deli</mark>, but not without some minor issues. the hollandaise is plentiful and salty, ask for it on the side. the prime rib was cooked to well done and on the tough side. what it has going for it outweighs my com<mark>Plain</mark>. the soft, airy croissant gives a texture that is not often associated with this dish, and i appreciated that. the eggs were poached to perfection. with one swift slash of my fork, the center burst out with all the fatty goodness of the yolk. the paprika on top, cut through the dense creaminess of the sauce. \n\nwith my craving subdued, i can go another five years without it and a day without eating. it will take a few hours in the gym to work off this meal, but there is no remorse or regret with this decision.", 
            "i love this place.  it's your typical breakfast diner, and we usually prefer to sit at the counter.  the food is always excellent.  i usually get a spinach, mushroom and cheese scramble with breakfast potatoes.  the potatoes are seasoned and absolutely amazing.  the oj is a little expensive, but it's usually expensive everywhere so i guess that's typical.  the better value is to split a carafe. the only com<mark>Plain</mark> i have is that i wish it was open later that 3pm.\n\nanother thing i like about this place is the little flip over eggs, to let your server know you need help. they are on every table and come in handy.", 
            "my family loves this place! great food and friendly service! eat here all the time and never a com<mark>Plain</mark>. the food is always very good and tons of things to try on the huge menu. \n\nsomething for everyone!", 
            "this was my first time visiting egg works on sunset. the service was great and it had a fun atmosphere. we all ordered the veggie benny, mine came with an egg shell in it. the shell itself was pretty big. i was hesitant to tell the server because i hate com<mark>Plain</mark> but my group insisted that i did. she was super wonderful about it. she comped my meal and gave me a free muffin (it was <mark>Deli</mark>). unfortunately, i did get sick shortly after breakfast. i feel like the sickness was more of a result of my sensitive stomach than anything the restaurant did. i would have given 5 stars for service and food quality. i deducted a star for the shell and getting sick afterwards. i'd totally try it again though!", 
            "this place is hopping with happy employees. our server is very nice and cheerful and did an excellent job of ex<mark>Plain</mark> the menu.", 
            "first time at this location. great service. our server was andrienne and she was awesome. i ordered the breakfast burrito. i really have no com<mark>Plain</mark>. definitely the best egg works/egg n i i've been to.", 
            "great hearty breakfast service is a little slow but that could have been because no one ex<mark>Plain</mark> that they have an egg u flip for service very much like bubba gumps lic plate gimmick but food was perfect for the hungry man try the skillets!!", 
            "wow, i feel bad for everyone who wrote glowing reviews.  they obviously have been subjected to really awful food all of their life.\n\ni got the chicken fried steak with over medium eggs and one of the muffins everyone raved about.  everything came with enough salt to preserve my digestive organs for the afterlife.  the potatoes are cheap, frozen cubes soaked in season salt...inedible.  the gravy was also way overseasoned, might of had some potential if not for that.  the banana nut muffin was nothing to write home about and had a weird texture.\n\nthe husband got the avocado bacon omelette.  though he is a hearty eater, two thirds of his food was left behind.  the omelette had a ton of cheese melted over top, usually a good thing, not in this case.  the cheese looked plastic like and he said it tasted microwaved.  he too had a large portion of blood pressure killing potatoes.\n\nthe kid had <mark>Chocolate Chip</mark> pancakes.  nothing to write home about but apparently way better than what we got.\n\n$41 for this lousy meal.  when we paid, the lady asked how everything was and my husband replied very salty and terribly overseasoned.  she responded by giggling like a school girl and telling him the total.  way to handle a com<mark>Plain</mark> there.  a $2 egg mcmuffin beats this junk any day.", 
            "donna was a great server, happy and cheerful. no com<mark>Plain</mark>!!\n\nthe atmosphere is more like a diner and not really our cup of tea. we both had the sundance omelette it was good, not exceptional. the fruit was old. the coffee average for the kind of breakfast place it is. \n\nwould we come back? most likely no. why 3 stars? donna is the reason for 3!!", 
            "wow donna made my experience at egg works great! food was fantastic at a great price! she was so helpful ex<mark>Plain</mark> all the food and how the signs work on the table. hope you make it to disney!", 
            "i always take visiting family and friends here for breakfast. i've probably eaten here at least 10x within the past few years. every friend and family i have taken here has always left feeling full and happy with the service.\n\nthe last time i was here i took a few friends who wanted to get away from the strip. they wanted a breakfast place that wasn't expensive and that wasn't your typical pancake place. here are a few things to keep in mind:\n\n 1. place is popular. if you think your eating at say 10am, get there at 9:30am to reserve your seat. for us they told us it was a 20 min wait but it was more like 15 min. if you have an impatient party do come in earlier. \n\n 2. there are coupons in local magazines. \n\n 3. come in hungry because the portions are generous.\n\nthe last thing i ordered was a mashed potato omelette. i think it is one of my favorite omelettes there now. my friends ordered omelettes with avocados and we were all surprise how generous the amount of avocado (not com<mark>Plain</mark> here).", 
            "<mark>Deli</mark>. donna was an awesome server and worked really hard! our only com<mark>Plain</mark> is the fried potatoes are really salty and over-seasoned. we had a really great breakfast otherwise and it was a nice little gem off the strip.", 
            "we were recommended this place by our hotel. the food was ok, not actually good. the highlight was definitely our server christian who was great. he ex<mark>Plain</mark> everything well. got our order down with no problems and was very attentive, the service as a whole is very good here. i ordered the corn beef hash and the mashed potatoe omelette. both were marginal at best however the fresh muffins were awesome.", 
            "such friendly fast service here.  chelsea learned that we were here for the first time and she brought us yummy banana muffins.  the eggs were cooked just right.  we thought the cottage potatoes were overly seasoned but that's our only com<mark>Plain</mark>.", 
            "eggcelent..lol. first time we tried here and we are hooked. portions are huge and service was amazing. our server candice was really prompt and she ex<mark>Plain</mark> the menu thoroughly for us...i used my check in for the banana nut muffin and it was good! definitely we will be back!", 
            "let me start off by saying this is probably our go-to breakfast joint every time we crave for a good breakfast. usually come here about once every two weeks. but the last time we went....our food was not all that great. now of course, as soon as we walked in we got seated. didn't like where we were placed because we like a little privacy...so we asked the lady hostess if we can be moved and she said yes and placed us near the back by the kitchen (which was not too bad).\n\nwe ordered, and waited about 20 minutes until our food came out. our banana nut muffin were the first things that came out. probably the best thing we had from them. now the worst thing about being at a restaurant is seeing & hearing all the arguments in the kitchen. this is exactly what happened. we heard com<mark>Plain</mark> from the kitchen workers, and the waiters and just everything we didn't want to....nor need to really hear. \n\nsoon as our food came out, it was super salty and soggy!!! my boyfriend ordered the skillet and i had the homemade corned beef hash. everyone loves a little salt here and there...but having too much, i thought i was going to have a heart attack! then we got our checks and left.\n\noverall it was a bad experience and i don't think we'll return to this place again. such a shame because we loved this place and it's close to our place. i hope we find another breakfast joint soon.", 
            "our server donna was awesome. we came from the airport and ex<mark>Plain</mark> we were in a rush and she took care of all 6 of us extremely fast with exceptional service.", 
            "oh man, sometimes i feel like yelpers are cray cray or just adhd. everything is so good all the time!!!!! ahh. it's a diner. everything is diner good all the diner time. \n\nknow what you're going to, a bustling breakfast joint. guy from triple d would approve i'm sure. because let's face it, this place smells and feels like guy's personality and puts out some hungry man food and some big man grease. that's all very good things by the way. \n\nthe staff is very good and friendly and prompt and the plates are huge. you get a complimentary muffin that people go gaga for but bleh, i guess i love bakeries too much. \n\ni don't remember what i ordered nor what my husband got if that ex<mark>Plain</mark> anything at all...but i do remember saying \"mmm\" or \"yummy\" in the midst of it and also that we walked out with no com<mark>Plain</mark>, stuffed to the brim, cured of our hangovers and with half of the brown dinosaur muffin in a doggy bag. i almost gave it to the dog too, when we got home, but it made a really yummy midnight snack later.\n\n4 stars by diner rating fyi if you can imagine such a thing. mainly because of the bang for your buck. bango.", 
            "we were seated and served quickly. our avocado omellette, banana nut muffin and french toast was <mark>Deli</mark>.  the female server was professional and prompt. no com<mark>Plain</mark>."
        ], 
        "dish_name": "Plain"
    }, 
    {
        "text": [], 
        "dish_name": "Blueberry"
    }, 
    {
        "text": [], 
        "dish_name": "Cashew & Blueberry"
    }, 
    {
        "text": [
            "candice was super friendly and attentive. she helped us choose the best meal, i had the <mark>Diced Apple & Cinnamon</mark> pancakes and my bf had the <mark>Works Burger</mark>. the whole egg works experience was fantastic ! the food was beyond amazing, it's a definite must ! i love the traditional-style restaurant experience!"
        ], 
        "dish_name": "Diced Apple & Cinnamon"
    }, 
    {
        "text": [
            "i love breakfast...eggworks 2 took a fairly good stab at it.  i ordered the benny, which is your standard eggs benedict and a side of their potatoes.\nnow, i don't expect a life changing experience for $9.50 but honestly, anyone could duplicate this for the same money or less.  the only serious chink in their armor was the coffee-bitter with a bleach after taste :o(\n<mark>Banana</mark> muffins were \"not ready\" didn't help!", 
            "my wife & i went here during a recent stay in vegas & had one of the most wonderful breakfasts in recent memory.  my wife had some amazing pancakes stuffed with fresh <mark>Banana</mark> and <mark>Chocolate Chip</mark> (special request).  they were so <mark>Deli</mark> she didn't even add syrup.   i had the classic 2 egg breakfast with smoked honey bacon that was really good.  the prices are really reasonable as well i think our whole bill was around 14.00.  well defiantly be going back here the next time were in vegas.", 
            "not gross, not fantastic. we've eaten breakfast here many times. it used to be really good, but the last few times that we've gone the food and service has been disappointing. i like that they'll put <mark>Banana</mark> inside the kid's pancakes if you ask.\n\n i think we've pretty much crossed it off our list of go-to places, but i'm sure we'll end up eating here again in the future since it's close to home.", 
            "i don't live in the area but whenever i'm in town, i always stop here for breakfast. their waffle with whipped cream and <mark>Banana</mark> is insane! \n\nthey have the best servers there, too. based on my visits, donna is the friendliest, funniest and most engaging of them all. \n\ngreat job egg works! can't wait for my next trip. :-)", 
            "got the stuffed french toast and it was a glorious helping of <mark>Deli</mark> breakfast food. my girlfriend got the <mark>Waffle Works</mark> with <mark>Banana</mark> and whipped cream which was also excellent and was consumed before i even started my second slice of french toast (hint: it was super good) the service was great jon was our waiter and he met out every need. better than ihop, denny's, etc... leslie knope would say: \"maybe not better than jjs diner but pretty damn close.\""
        ], 
        "dish_name": "Banana"
    }, 
    {
        "text": [
            "my wife & i went here during a recent stay in vegas & had one of the most wonderful breakfasts in recent memory.  my wife had some amazing pancakes stuffed with fresh <mark>Banana</mark> and <mark>Chocolate Chip</mark> (special request).  they were so <mark>Deli</mark> she didn't even add syrup.   i had the classic 2 egg breakfast with smoked honey bacon that was really good.  the prices are really reasonable as well i think our whole bill was around 14.00.  well defiantly be going back here the next time were in vegas.", 
            "we come here before i head off to my day job.  the coupons in the papers help a bunch with our frequent outings.  i cannot say enough about their service and how outstanding a job they do.  \nwe did have a moment on a busy weekend where nobody addressed giving us any service.  even the egg flipped to the bright yellow egg (notice to the servers that the customer needs something) wasn't getting noticed.  i do believe the manager came by and did everything in his power to help us.  he went above and beyond to help us out.  i have seen him do this from time to time and i do applaud him on his ability to pitch in and make it right.  so for what few times when we had issues the staff was on the ball and made it right.  \nthe waitresses are friendly and found one who even threw back the sarcastic humor. if there is a wait, its worth it and shouldn't take to long to be seated.  although sitting outside with all the planes landing does get noisy.\nlove the pumpkin <mark>Chocolate Chip</mark> pancakes!", 
            "today was my first time ever going to their  chain restaurant and i was impressed for several reasons. \n\ntoday happen to be father's day and my dad decided to check this place out. we went and of course not only is it a sunday morning but it's a sunday morning on father's day. the line was insane! i was worried because i only had 1.5 hours before i had to go into work. as soon as i saw the line my first though was \"this place better be worth it\" and \" i better be seated fast\". once we reached the receptionist my name was at the bottom of the list to be called but they were constantly calling people to be seated and it only took max 10 minutes to be seated. i was highly impressed. i have never gotten faster service than i have at this place. we were seated at a booth that was a little snug for my family but it was still comfortable enough to eat in. i was surprised that the receptionist kept checking up on us to make sure that we were comfortable and even offered to give us a different table which was completely unnecessary. it was nice to have that sense that everyone in the restaurant wanted to make sure you were happy with not only your meal but the experience as well. \ni ordered the ruben sandwich which might not be the best breakfast choice but i thought it was <mark>Deli</mark>.  my parents tried the tostadas and they were huge and could probably feed two. their <mark>Chocolate Chip</mark> pancakes were also really tasty. i am not a real big fan of breakfast food in general but after trying this place i definitely will reconsider my lack of appreciation for breakfast food. if you are looking for a casual, tasty and decently priced place i highly recommend this one.", 
            "wow, i feel bad for everyone who wrote glowing reviews.  they obviously have been subjected to really awful food all of their life.\n\ni got the chicken fried steak with over medium eggs and one of the muffins everyone raved about.  everything came with enough salt to preserve my digestive organs for the afterlife.  the potatoes are cheap, frozen cubes soaked in season salt...inedible.  the gravy was also way overseasoned, might of had some potential if not for that.  the banana nut muffin was nothing to write home about and had a weird texture.\n\nthe husband got the avocado bacon omelette.  though he is a hearty eater, two thirds of his food was left behind.  the omelette had a ton of cheese melted over top, usually a good thing, not in this case.  the cheese looked plastic like and he said it tasted microwaved.  he too had a large portion of blood pressure killing potatoes.\n\nthe kid had <mark>Chocolate Chip</mark> pancakes.  nothing to write home about but apparently way better than what we got.\n\n$41 for this lousy meal.  when we paid, the lady asked how everything was and my husband replied very salty and terribly overseasoned.  she responded by giggling like a school girl and telling him the total.  way to handle a com<mark>Plain</mark> there.  a $2 egg mcmuffin beats this junk any day.", 
            "a great little place. my son and i came to try it from a groupon i bought. i had the chili omelette with the works chili. it was very tasty and the portion was huge. the works potatoes are very good. they have like a cajun seasoning to them. my son got the mouse pancake with <mark>Chocolate Chip</mark>. he got the sausage patty. our server christian was awesome. it was hard to decide if the food or the service was better. i definitely recommend and if u can score the groupon even better. next time i'm in vegas, i will definitely come here.", 
            "great breakfast,  i had <mark>Chocolate Chip</mark>/butterscotch chip pancakes. my companions had western omelets,  our server was donna and she was terrific!  we will be eating there again soon.", 
            "awesome breakfast and brunch place.  we had our family reunion in vegas, so there were 31 of us.  they didn't take reservations on sunday, but they were very accommodating for 8:00 am and a party of 31.  the service was awesome, our server, she was so personable and on top of things, a real pro!  their egg dishes are humongous, 4 eggs!!  and a lot of <mark>Deli</mark> sides.  the <mark>Chocolate Chip</mark> pancakes were a hit as was the waffles and all. of their egg dishes, their scrambles and egg combos are <mark>Deli</mark>. sis had the egg crepes, too yummy and big. such a diverse and large menu, you will be sure to find something!  the seasoned potatoes were awesome.  great restaurant, great service and awesome wait staff!"
        ], 
        "dish_name": "Chocolate Chip"
    }, 
    {
        "text": [
            "i'm from st. louis, mo. if a place has biscuits and gravy i have to order it. i have no choice, i am driven! egg works has it and i ordered it with two fried eggs on top (there is no other way!) first off, those fried potatoes they serve are the bomb! crispy and evenly browned, not even remotely greasy. the husband and i gobbled them like fiends. the gravy definitely passed muster with my mid-western heart...rich and loaded <mark>Waffle With Meat</mark> flavor, and no pastiness. my eggs were perfectly cooked, as were my husband's. the biscuits were weird, tough and chewy. no fluffiness here...and they are an odd artificial golden yellow color, throughout. we actually scanned the menu to see what we could get that <mark>Deli</mark> gravy on next time, because i never want to bite one of those creepy biscuits again. we'll be back to try their other offerings, because the plates that sailed by us on their way to other diners looked quite tempting. coffee was just meh.. not yucky, just meh. we'll order tea next time and find something to smother with that gravy!", 
            "so this was our first time. every time we are here in vegas, we always pass by this place. read all the reviews on yelp and decided to try it. just have to say that it was yummie! the portions are big. the kids meal are big enough for two kids to share unless you have a big eater. \n\ni ordered pork and eggs, potatoes, and toast. since i cannot eat eggs, the waitress let me substitute fruit for the eggs. the potatoes were <mark>Deli</mark>. it was seasoned and like the potatoes that you get with hash.  my husband ordered stuffed french toast. he thought they were stuffed with fruit and cream cheese (his mistake), but when it came out it was like a french toast sandwich. an egg scramble <mark>Waffle With Meat</mark> between two pieces of french toast. the waitress was willing to exchange it for the strawberry and cream cheese french toast (which is the one that he was looking at), but my husband's mistake so he kept his plate. he did enjoy his breakfast. the other people at our table ordered the banana nut french toast and the loco moco. they both were happy with what they ordered. our waitress was very nice. she kept our drinks filled as best as she could since the restaurant was completely packed. we didn't mention that it was our first time to the restaurant, but she must have figured it out with some of our questions. she brought some warm banana nut muffin to the table, and they were <mark>Deli</mark>.\n\nwe will definitely be coming here more often on our future trips to vegas.", 
            "went here with my sister and nephews . love it! i got an omelette with bacon, sausage and other meats and potatoes. potatoes were good they were dusted with seasoning. i had orange juice and my order came with a choice of toast or muffin. muffin was was warm it went well <mark>Waffle With Meat</mark>. kid friendly they give you crayons and paper.", 
            "donna was a great server. food is exceptional.  awesome variety.  i had the country benny, eggs benedict country style.  biscuits instead of english muffin, sausage patty instead of canadia<mark><mark>Chili Cheese Burger</mark> n Bacon</mark> and sausage gravy instead of hollandaise.  it was excellent!!!  my wife had an omelet loaded <mark>Waffle With Meat</mark> and cheese and guacamole.  i had a bite and let me tell you.  it was awesome.  we search out egg works every time we go to vegas.  you should too."
        ], 
        "dish_name": "Waffle With Meat"
    }, 
    {
        "text": [
            "this place is by far the best breakfast place in las vegas. i always order half of whatever i order because the portions are huge! i have a hard time finishing even the half size portions. \n\nmy boyfriend always gets the <mark>Waffle Works</mark> with over hard eggs and a side of works potatoes. i usually opt for the classic with over medium eggs, toast, and fruit. if you want to splurge, i highly suggest the chili relleno omelet. \n\neverything on the menu is great unless you catch them on a bad day. today for instance, my over medium eggs were a runny, watery, mess. \n\nthe service is usually prompt, but don't expect to see your server again after you order.", 
            "this is by far the best place to go for a breakfast joint. it never cease to amaze me how great it is!  i love it.  \n\nnormally, when we come here its generally always packed with a 10 to even a 20 minutes wait time. (of course i wait) because usually it means 5 minutes less than they actually say and i would not go to another place.  if it it means i have to wait, then so be it! ha.\n\nratings (out of 5) 1: lame - 5:amazing!\n\nservice: 4\nfood: 5 \n(i always order the <mark>Waffle Works</mark> w/ strawberry & whipped cream, bacon, & egg thats over-medium or sometimes scrambled) \natmosphere: 3.8 \n(it is nothing fancy, but it works with the theme they have going on)", 
            "got the stuffed french toast and it was a glorious helping of <mark>Deli</mark> breakfast food. my girlfriend got the <mark>Waffle Works</mark> with <mark>Banana</mark> and whipped cream which was also excellent and was consumed before i even started my second slice of french toast (hint: it was super good) the service was great jon was our waiter and he met out every need. better than ihop, denny's, etc... leslie knope would say: \"maybe not better than jjs diner but pretty damn close.\"", 
            "this is the only chain that i know of with awesome egg bennies so when i get to pick out breakfast, this is where i go.\n\nfront of the house was a little awkward teenage girl, i think with training she can blossom into a friendly hostess.\n\nthe veggie benny is the best!! it always brightens up my morning. providing flavored cream for coffee is an extra plus. (hazelnut hands down). my other half ordered the <mark>Waffle Works</mark> which he found was mediocre.\n\nour waitress was the lovely candice. i absolutely enjoyed her enthusiasm. my boyfriend thought she was too peppy for his tastes but after our meal, he said she became bearable. he's grumpy when he's hungry.\n\nthe cashier seemed agitated too. i guess anyone in the lobby area isn't as chipper as candice. way to set the standards candice!", 
            "i went to egg works for the first time a few months ago and i just didn't care for the flavor at all, plus our food was cold but since this place has so many amazing reviews, i decided to wait for a review till i tried them one more time. it took me a few months but i just recently went back and now i totally understand the hype! great prices, good flavor and portions and many locations. \ni decided to go with the chicken fried steak since i'm not an omelet fan and my boyfriend went with the <mark>Waffle Works</mark>. so i'm a little weird with scrambled eggs, i like them slightly undercooked if that makes sense. i always thought places made them so rubbery and dry but this place makes them perfectly the way i like them! soft and fluffy but not watery or rubbery. their seasoned potatoes were also pretty addictive and the gravy on the chicken fried steak was seasoned perfectly and had the perfect texture. one thing that made me really happy, the breading didn't slide off the steak! whoo! my boyfriend's waffle was also nice and sweet with soft chewiness and i liked that they offered sausage patties. we also both checked in on yelp to get 1 free banana nut muffin each!!! awesome! so warm and flavorful! our server was also great and had a good sense of humor, she made us laugh a few times. \noverall, egg works doesn't offer any crazy menu items but simple can definitely be better if executed right. also, there are soo many different options to choose from! benedicts, omelets, pancakes, waffles, scrambles, skillets, sandwiches, crepes, salads, soups, burgers, even enchiladas, burritos, and spaghetti! basically, if you're looking to have breakfast with even the pickiest of eaters, they'll find something they like here!"
        ], 
        "dish_name": "Waffle Works"
    }, 
    {
        "text": [
            "huge selection of awesome breakfast fare.  our waitress karen was great.  we enjoyed the bacon and avocado omelet and <mark>Key Largo Crepe</mark> with potatoes and fresh baked banana nut muffin."
        ], 
        "dish_name": "Key Largo Crepe"
    }, 
    {
        "text": [], 
        "dish_name": "California Crepe"
    }, 
    {
        "text": [
            "my only breakfast house. best in las vegas always a friendly staff and the food is amazing!!!! have to get <mark>Works Crepe</mark> or enchilada omelette."
        ], 
        "dish_name": "Works Crepe"
    }, 
    {
        "text": [
            "my favorite breakfast place ever! no questions asked. \n\nwhoever thought of the concept of this place, from the decor to the food to everything else in the restaurant, is a bonafide genius! so thank you very very much. \n\ndecor: this is an extremely family oriented restaurant. with a large dining hall with silly pictures that features eggs (example: egg-faced mona lisa), it's really inviting to people of all ages. the menu looks like a newspaper with cute little cartoons all over. \n\nservice: i don't know if all the servers are required to have their morning coffee, but all of them are so perky! there's an black egg you can flip over to a yellow egg - this indicates that your table needs something. when this happens, any one of the egg works staff will come over and will ask what you need. what a great idea! this prevents from you staring awkwardly all over the restaurant for your server. your server will bring your check over to your table but won't be your cashier. so after you're done with your meal, you have to go up to the front to pay. i don't mind this unless there's a huge line in the front at peak times. then i get a little annoyed, but i guess i have to deal with it.\n\nfood: yum. most of their dishes come with their \"works\" potatoes. perfectly cubed and perfectly seasoned! i can seriously have a plateful of just their potatoes. you can opt out of that for some fruit or cottage cheese. i've tried many of their dishes and was never disappointed. my favorites are listed below: \n\n- works veggie benny: calling all vegetarians! an english muffin topped with fresh spinach, tomatoes, huge chunks of avocado, two poached eggs and drizzled in hollandaise sauce. this is my favorite item on their menu hands down. \n- <mark>Vegetarian Crepe</mark>: calling all vegetarians, again! a hefty serving of guac, mushrooms, spinach and swiss cheese. the works poppy seed dressing is tangy and sweet, the ultimate dipping sauce to this dish.\n** i am not a vegetarian by no means, but the two above are <mark>Deli</mark>! **\n\n- greek scramble: chicken, mushrooms, artichoke hearts, spinach and feta cheese. opa! in my mouth. for real. \n-blackened prime rib benny: this is my boyfriend's favorite dish there. and i quote, \"what cow danced and left a mess in my mouth?!\". prime rib lovers, this is for you. \n\npro tip: portions are huge here. for a lower price, you can get half portions for most of the items on the menu. so for those on a diet, you can still enjoy the succulent flavors of egg works!", 
            "amazing variety on the menu and one of the best places to grab breakfast. we love it here. my favorite is the <mark>Vegetarian Crepe</mark>. <mark>Deli</mark>! the burritos are good and their diablo potatoes are amazing!", 
            "<mark>Vegetarian Crepe</mark> @theeggworks mmm so good! when you're there, ask for donna! your breakfast comes with a hug! #vegas #lasvegas #eggworks"
        ], 
        "dish_name": "Vegetarian Crepe"
    }, 
    {
        "text": [
            "five of us went to lunch at the location on eastern.  they weren't very busy, yet it took quite a while for the food to come out.  i liked their fries and onion rings.  i ordered a <mark>Ranch Club Wrap</mark> without tomatoes.  it was a lot of food but i didn't care much for the cheese or the ranch dressing, too runny and sour.  two members of my party ordered the blts and we're happy.  the blts had a ton of bacon on them.  another member of our party had the pancakes and we both thought they tasted more like kfc biscuits than pancakes.  lastly, someone had the <mark>Chili Cheese Burger</mark> and they thought it was awful.  they said it tasted like they put chopped onions and oatmeal or some other type of filler in it.  they may serve up a mean egg breakfast, but i don't think i'll be going back to find out."
        ], 
        "dish_name": "Ranch Club Wrap"
    }, 
    {
        "text": [], 
        "dish_name": "Santa Fe Wrap"
    }
]